[{"data":1,"prerenderedAt":418},["Reactive",2],{"/articles/2017/09/29/feature-branching-vs-feature-flipping":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"date":11,"categories":12,"tags":14,"img":18,"cover":19,"readingTime":20,"body":25,"_type":413,"_id":414,"_source":415,"_file":416,"_extension":417},"/articles/2017/09/29/feature-branching-vs-feature-flipping","29",false,"","Feature branching vs Feature Flipping","![](/images/qXMqcos.png)\nJe ne sais pas vous mais de mon côté, dans chaque job que j'ai pu faire j'ai toujours retrouvé certains éternels débats. Vou...","1316","2017-09-29",[13],"waza",[15,16,17],"backend","feature-flipping","ff4j","qXMqcos.png","cover4.jpg",{"text":21,"minutes":22,"time":23,"words":24},"10 min read",9.895,593700,1979,{"type":26,"children":27,"toc":410},"root",[28,38,44,49,54,70,75,80,85,97,111,116,128,133,138,143,148,153,184,189,203,208,213,218,223,228,241,246,253,266,296,301,306,311,316,321,326,331,336,341,346,351,356,361,373,378,389,394,405],{"type":29,"tag":30,"props":31,"children":32},"element","p",{},[33],{"type":29,"tag":34,"props":35,"children":37},"img",{"alt":7,"src":36},"/images/qXMqcos.png",[],{"type":29,"tag":30,"props":39,"children":40},{},[41],{"type":42,"value":43},"text","Je ne sais pas vous mais de mon côté, dans chaque job que j'ai pu faire j'ai toujours retrouvé certains éternels débats. Vous avez des sujets qui semblent donner des sueurs froides à quasiment tout le monde dans toutes les sociétés. Je pourrais citer : la documentation (interne ou externe), la stratégie de branches, la façon d'estimer des tâches, les conventions de codages etc... etc... etc...",{"type":29,"tag":30,"props":45,"children":46},{},[47],{"type":42,"value":48},"En tout début de carrière ces sujets sont passionnants (ou pas), en tout cas vous vous y intéressez puisque la majorité relèvent de l'organisation, la méthode de travail et bon, ça parait plutôt une bonne chose d'être bien organisé.",{"type":29,"tag":30,"props":50,"children":51},{},[52],{"type":42,"value":53},"Je vous dévoile un peu la fin du film, au fil du temps, refaire les mêmes débats dans chaque nouvelle équipe vous lasse(ra) un peu. C'est pour cela que bosser sur un produit, qui plus est le sien, pendant plusieurs années est vraiment agréable. Ces sujets ont été taclés et désormais que la tuyauterie est faite on s'occupe de construire des fonctionnalités, chose finalement bien plus agréable. Cela ne veut pas dire qu'on y retouche plus mais le degré de maturité est assez fort pour que chaque changement ne soit pas une révolution mais une amélioration. Toutes les personnes qui enchaînent des projets de durée variant entre 6 mois et 2 ans avec des équipes dont le turnover implique un renouvellement complet tous les 18 mois savent de quoi je parle.",{"type":29,"tag":30,"props":55,"children":56},{},[57,68],{"type":29,"tag":58,"props":59,"children":63},"a",{"href":60,"rel":61},"http://eventuallycoding.com/wp-content/uploads/2017/09/65220-60709_backdrop_scale_1280xauto1.jpg",[62],"nofollow",[64],{"type":29,"tag":34,"props":65,"children":67},{"alt":7,"src":66},"/images/65220-60709_backdrop_scale_1280xauto1.jpg",[],{"type":42,"value":69}," Bref, je tenais donc à partager l'expérience Hopwork sur notre stratégie de branches et où nous en sommes aujourd'hui.",{"type":29,"tag":30,"props":71,"children":72},{},[73],{"type":42,"value":74},"Je vais spoiler dès le début cependant avant de rentrer dans le vif du sujet. Pour notre stratégie de branches, on a choisi la méthode la plus simple : le nobranching.",{"type":29,"tag":30,"props":76,"children":77},{},[78],{"type":42,"value":79},"Remarquez c'est un peu une ligne de conduite personnelle depuis quelques années, on fait du nosql, avec Lateral-thoughts on avait créé une nossii, et pour les estimations on a suivi le même chemin, on fait du noestimate...",{"type":29,"tag":30,"props":81,"children":82},{},[83],{"type":42,"value":84},"Bon mais en pratique cela veut dire quoi ? Non parce qu'à ce stade de ce billet, il y a peut être des gens qui ne savent même pas de quelle branche je parle.",{"type":29,"tag":30,"props":86,"children":87},{},[88],{"type":29,"tag":58,"props":89,"children":92},{"href":90,"rel":91},"http://eventuallycoding.com/wp-content/uploads/2017/09/9cd1d-branch.png",[62],[93],{"type":29,"tag":34,"props":94,"children":96},{"alt":7,"src":95},"/images/9cd1d-branch.png",[],{"type":29,"tag":30,"props":98,"children":99},{},[100,102],{"type":42,"value":101},"Déjà revenons aux fondamentaux, qu'est ce qu'une branche et pourquoi en faisons nous ? Quand je parle de branche, je parle de branche de code, c'est à dire une version de votre application construire à partir d'un instant T et qui diverge du code principal. Mettons que le code soit versionné sur git, on dit du code de votre application qui est mis en production et mis à jour tous les jours par l'équipe de développement qu'il est sur une branche de développement appelé master. Cette branche on peut la voir comme une succession de modifications, appelées commits pour les néophytes même si je doute que des néophytes lisent cet article, qui nous amène d'une version A à une version B.",{"type":29,"tag":58,"props":103,"children":106},{"href":104,"rel":105},"https://eventuallycoding.com/wp-content/uploads/2019/10/1dcb8-history-abc-11.png",[62],[107],{"type":29,"tag":34,"props":108,"children":110},{"alt":7,"src":109},"/images/1dcb8-history-abc-11.png",[],{"type":29,"tag":30,"props":112,"children":113},{},[114],{"type":42,"value":115},"Et parfois ce développement n'est pas si linéaire que cela, on va créer des ramifications (d'ou le nom de branche) à partir d'un instant T. Ces branches vont donc diverger du code principal puis être refusionné plus tard.",{"type":29,"tag":30,"props":117,"children":118},{},[119],{"type":29,"tag":58,"props":120,"children":123},{"href":121,"rel":122},"http://eventuallycoding.com/wp-content/uploads/2017/09/b8992-sans-titre.jpg",[62],[124],{"type":29,"tag":34,"props":125,"children":127},{"alt":7,"src":126},"/images/b8992-sans-titre.jpg",[],{"type":29,"tag":30,"props":129,"children":130},{},[131],{"type":42,"value":132},"Pourquoi fait-on cela ? Eh bien il arrive que l'on souhaite isoler le développement d'une fonctionnalité un peu longue dans une branche le temps qu'elle soit prête. On peut aussi souhaiter travailler en isolation des autres développeurs le temps de finir un travail sur plusieurs jours (hyper mauvaise idée en général).",{"type":29,"tag":30,"props":134,"children":135},{},[136],{"type":42,"value":137},"Dans certaines sociétés j'ai vu des stratégies de branches plutôt complexe avec des branches dédiées à chaque environnement : dev, intégration, preproduction, prod, des coupes circuits pour des hotfix qui avaient la particularité de partir de la branche de production pour revenir vers la branche de développement et des branches par fonctionnalités (on appellera cela le feature branching).",{"type":29,"tag":30,"props":139,"children":140},{},[141],{"type":42,"value":142},"Dès qu'on va commencer à mettre en place des politiques de gestion de branches, on va entrer dans des considérations parfois assez compliqué, par exemple comment mettre en place de l'intégration continue sur chaque branche, y compris les branches temporaires créées au fil d'une seule journée pour des devs spécifiques.",{"type":29,"tag":30,"props":144,"children":145},{},[146],{"type":42,"value":147},"Comment s'assurer que ce qui part en production correspond à ce qui été testé ? Ou même comment relire un historique git...",{"type":29,"tag":30,"props":149,"children":150},{},[151],{"type":42,"value":152},"Lorsque cela prend des proportions vraiment importantes il arrive qu'une ou plusieurs personnes devienne(nt) un \"intégrateur\" dont le rôle sera de faire les fusions de branches. J'ai vu des boîtes dont cette corvée était tournante chaque lundi et je vais vous dire, c'était pas une partie de plaisir. Il faut dire que l'outil de gestion de source utilisé n'était pas non plus super adapté pour cela.",{"type":29,"tag":30,"props":154,"children":155},{},[156,158,165,167,174,175,182],{"type":42,"value":157},"Je vais pas m'étaler plus sur le sujet, j'ai évidemment un avis subjectif et en réalité il existe sans doute des contextes où c'est nécessaire et des équipes pour lesquelles cela marche très bien. Il existe même des outils qui se sont crées par dessus les outils de gestion de sources pour résoudre certains problèmes évoqués plus haut : ",{"type":29,"tag":58,"props":159,"children":162},{"href":160,"rel":161},"https://danielkummer.github.io/git-flow-cheatsheet/",[62],[163],{"type":42,"value":164},"gitflow",{"type":42,"value":166},", ",{"type":29,"tag":58,"props":168,"children":171},{"href":169,"rel":170},"https://guides.github.com/introduction/flow",[62],[172],{"type":42,"value":173},"githubflow",{"type":42,"value":166},{"type":29,"tag":58,"props":176,"children":179},{"href":177,"rel":178},"https://bitbucket.org/yujiewu/hgflow/overview",[62],[180],{"type":42,"value":181},"hgflow",{"type":42,"value":183}," etc...",{"type":29,"tag":30,"props":185,"children":186},{},[187],{"type":42,"value":188},"Pour ma part, je suis assez rapidement arrivé a une conclusion qu'il fallait essayer d'éviter de tomber dans ces problématiques. J'appelle cela de la complexité inutile et si on peut s'en passer c'est bien.",{"type":29,"tag":190,"props":191,"children":192},"blockquote",{},[193,198],{"type":29,"tag":30,"props":194,"children":195},{},[196],{"type":42,"value":197},"La perfection est atteinte, non pas lorsqu'il n'y a plus rien à ajouter, mais lorsqu'il n'y a plus rien à retirer.\"",{"type":29,"tag":30,"props":199,"children":200},{},[201],{"type":42,"value":202},"Antoine de Saint Exupéry",{"type":29,"tag":30,"props":204,"children":205},{},[206],{"type":42,"value":207},"Dès 2011 j'ai souhaité essayer une nouvelle approche, le feature flipping. Le feature flipping consistant à activer ou désactiver une fonctionnalité avec une interrupteur logiciel plutôt que de la développer dans une branche séparée. C'est l'interrupteur logiciel qui aura la charge d'isoler ce code le temps qu'il soit prêt.",{"type":29,"tag":30,"props":209,"children":210},{},[211],{"type":42,"value":212},"En 2011 donc, il s'agissait d'une mission dans une boite que j'ai bien apprécié. La société venait de réaliser une très grosse refonte d'une partie de leur application sur une très longue période (plus d'1 an il me semble) et tout s'est passé sur une branche avec une double maintenance sur la branche principale et des fusions régulières entre les deux. Cela ne s'est pas passé sans difficultés dirons nous et l'atterrissage fut long et douloureux ^^",{"type":29,"tag":30,"props":214,"children":215},{},[216],{"type":42,"value":217},"J'avais la chance de rejoindre au tout début un autre projet de refonte tout aussi importante sur une autre partie du site. Et nous sommes cette fois partis du principe que tout se ferait sur la branche principale avec des systèmes de conditions dans le code pour activer ou non le nouveau ou l'ancien code. La refonte était très importante d'une point de vue architecturale, on introduisait de nouvelles briques techniques (moteur de rêgles par exemple), découpage d'un monolithe en plusieurs applis et beaucoup de refactoring.",{"type":29,"tag":30,"props":219,"children":220},{},[221],{"type":42,"value":222},"Le nouveau code et l'ancien code était régulièrement mis en production. Des conditions dans le code (de simple if then else) permettait de passer dans l'ancienne application ou la nouvelle. En fonctionnant de la sorte, il est apparu rapidement qu'il était malgré tout possible de mettre en commun certains refactoring ou même d'éprouver du code, qui bien que dormant pouvait avoir des effets de bord en terme de déploiement ou d'opérations. Et cela a eu de nombreux avantages, notamment d'éviter les fameux effets tunnels.",{"type":29,"tag":30,"props":224,"children":225},{},[226],{"type":42,"value":227},"Bien sûr que parfois le nouveau code apportait des complications mais, en étant fusionné avec le code de production, la détection de ces problèmes survenait très vite et donc le temps de correction/adaptation était également très rapide. Enfin, les refactoring ont pu aller bien plus loin puisque nous avions moins peur des fusions de code. Bref, je ne vais pas plus loin, c'était une première approche et elle fut très concluante avec de nombreux résultats positifs. Malgré tout il y avait quand même des systèmes de branches complexes entre environnements (intégration, prod, autres parties de l'application etc...) et la pratique restait relativement répandue dans certains cas. De plus le système de conditions avec de simples if pouvait sembler artisanal.",{"type":29,"tag":30,"props":229,"children":230},{},[231,233,239],{"type":42,"value":232},"Parlons d'Hopwork maintenant. Sur Hopwork nous appliquons cette stratégie \"no branching\" sur l'application complète. Concrètement, personne ne travaille sur une branche et tout le code est fait sur la branche principale avec la consigne stricte : \"",{"type":29,"tag":234,"props":235,"children":236},"strong",{},[237],{"type":42,"value":238},"on doit pouvoir livrer en production à n'importe quel moment",{"type":42,"value":240},"\".",{"type":29,"tag":30,"props":242,"children":243},{},[244],{"type":42,"value":245},"Et c'est le cas :",{"type":29,"tag":30,"props":247,"children":248},{},[249],{"type":29,"tag":34,"props":250,"children":252},{"alt":7,"src":251},"/images/DEiapjfWAAAUEey.jpg",[],{"type":29,"tag":30,"props":254,"children":255},{},[256,258,264],{"type":42,"value":257},"L'un des outils qui nous aide à faire cela est ",{"type":29,"tag":58,"props":259,"children":262},{"href":260,"rel":261},"http://ff4j.org/",[62],[263],{"type":42,"value":17},{"type":42,"value":265},". Cette librairie permet de passer d'un système artisanal avec de simples if à un système un peu plus complet :",{"type":29,"tag":267,"props":268,"children":269},"ul",{},[270,276,281,286,291],{"type":29,"tag":271,"props":272,"children":273},"li",{},[274],{"type":42,"value":275},"paramétrage à chaud des interrupteurs logiciels à activer ou désactiver",{"type":29,"tag":271,"props":277,"children":278},{},[279],{"type":42,"value":280},"stockage de l'état en base de données",{"type":29,"tag":271,"props":282,"children":283},{},[284],{"type":42,"value":285},"stockage en cache dans Redis pour les performances",{"type":29,"tag":271,"props":287,"children":288},{},[289],{"type":42,"value":290},"une console d'administration web",{"type":29,"tag":271,"props":292,"children":293},{},[294],{"type":42,"value":295},"des stratégies d'activation avancées qui permettent d'activer pour une population d'utilisateur, par tranche d'ip, par localisation géographique etc...",{"type":29,"tag":30,"props":297,"children":298},{},[299],{"type":42,"value":300},"Au moment de la rédaction de ce billet nous avons 94 fonctionnalités régie par ff4j et de toute nature : redirection de bots, changement d'interface utilisateur, test AB, nouvel algo de recherche, fonctionnalités admin etc... En dev cela signifie que, en principe, toute fonctionnalité que nous présumons être un peu longue, avoir des impacts ou juste être sortie plus tard se verra associer à un identifiant dans un fichier de features ff4j. Exemple avec la fonctionnalité de détection de visage sur les envois de photos de profil :",{"type":29,"tag":30,"props":302,"children":303},{},[304],{"type":42,"value":305},"    \u003Cfeature uid=\"profile-picture-face-check\"  description=\"Ensure the uploaded profile picture contains at least a face\"             enable=\"false\"/>",{"type":29,"tag":30,"props":307,"children":308},{},[309],{"type":42,"value":310},"Le code ensuite fera référence à cette fonctionnalité pour activer ou non une fonctionnalité :",{"type":29,"tag":30,"props":312,"children":313},{},[314],{"type":42,"value":315},"if (ff4j.isEnabled(\"profile-picture-resolution-check\"))",{"type":29,"tag":30,"props":317,"children":318},{},[319],{"type":42,"value":320},"... // fais la détection de visage",{"type":29,"tag":30,"props":322,"children":323},{},[324],{"type":42,"value":325},"Sur une page jsp de la même facon nous avons une taglib nous permettant d'inclure ou non une portion de jsp :",{"type":29,"tag":30,"props":327,"children":328},{},[329],{"type":42,"value":330},"\u003Cff4j:enable featureid=\"my-feature\">... \u003C/ff4j:enable>",{"type":29,"tag":30,"props":332,"children":333},{},[334],{"type":42,"value":335},"Evidemment il y a tout de même des contraintes.",{"type":29,"tag":30,"props":337,"children":338},{},[339],{"type":42,"value":340},"Il faut penser à supprimer le code mort régulièrement lorsqu'on finit par adopter définitivement une nouvelle fonctionnalité et que le ff4j ne sera plus mis en OFF. En bref, il faut faire du ménage. Logique.",{"type":29,"tag":30,"props":342,"children":343},{},[344],{"type":42,"value":345},"Il faut constamment penser à créer un code qui cohabite avec l'ancien. Parfois, c'est loin d'être trivial quand on change le modèle de données mais quel confort en cas de retour arrière... Dans les tests, surtout les tests d'interface, il faut penser aux fonctionnalités actives ou non et penser à tester les différents cas. Mais cela reste simple, il suffit d'appeler l'API de FF4J pour activer ou non une fonctionnalité.",{"type":29,"tag":30,"props":347,"children":348},{},[349],{"type":42,"value":350},"En comparaison lorsque l'on travaille par branche, il faut établir des stratégies de CI pour lancer les tests sur chaque branche. Et par expérience, les tests d'intégration et de performance sont les principales victimes de cette stratégie car il est assez coûteux de les maintenir par branche. Dès que l'on repose sur des outils externes comme des bases de données, des files de message, ou si ces tests sont lancés la nuit a cause de leur lenteur, on ne s'amuse pas à les dupliquer pour chaque branche. Avec le feature flipping, rien de tout cela.",{"type":29,"tag":30,"props":352,"children":353},{},[354],{"type":42,"value":355},"Outre le confort de dev, un retour arrière suite à une mise en prod où une fonctionnalité s'avérerait défectueuse consiste juste à désactiver la fonctionnalité dans l'écran ff4j. Et croyez moi, c'est appréciable. Il est aussi possible de diffuser une nouvelle fonctionnalité en avant première sur une population. Je pense avoir fait un petit tour des avantages que nous y trouvons.",{"type":29,"tag":30,"props":357,"children":358},{},[359],{"type":42,"value":360},"Pour l'anecdote en trainant sur un slack tech une fois j'avais assisté à une conversation où je n'ai pas souhaité participer et qui démontait cette pratique. Alors évidemment je ne doute pas que cette stratégie ne fera pas l'unanimité et ce billet n'a pas vocation à vous convaincre. Cette stratégie marche pour nous, c'est tout ce que je peux en dire. Et il y a sans doute des équipes pour qui le Feature Branching marche très bien.",{"type":29,"tag":30,"props":362,"children":363},{},[364],{"type":29,"tag":58,"props":365,"children":368},{"href":366,"rel":367},"http://eventuallycoding.com/wp-content/uploads/2017/09/f5805-featurebranch.jpg",[62],[369],{"type":29,"tag":34,"props":370,"children":372},{"alt":7,"src":371},"/images/f5805-featurebranch.jpg",[],{"type":29,"tag":30,"props":374,"children":375},{},[376],{"type":42,"value":377},"(Au fait, on met en prod tout les jours, parfois toutes les heures ;))",{"type":29,"tag":30,"props":379,"children":380},{},[381,383],{"type":42,"value":382},"Et si je devais trouver une référence un peu \"sérieuse\" sur le Feature flipping vs le Feature branching je vous renverrais à cet article de Martin Fowler qui partage la même vision et privilégie cette approche : ",{"type":29,"tag":58,"props":384,"children":387},{"href":385,"rel":386},"https://martinfowler.com/bliki/FeatureBranch.html",[62],[388],{"type":42,"value":385},{"type":29,"tag":30,"props":390,"children":391},{},[392],{"type":42,"value":393},"Alors ca ne donne pas un sceau de crédibilité absolue mais ça a l'avantage de se dire que à la limite, si on se plante, on n'est pas tout seul. Et finalement c'est rassurant. Ou pas :)",{"type":29,"tag":30,"props":395,"children":396},{},[397,399],{"type":42,"value":398},"Autre référence intéressante : ",{"type":29,"tag":58,"props":400,"children":403},{"href":401,"rel":402},"https://devops.com/feature-branching-vs-feature-flags-whats-right-tool-job/",[62],[404],{"type":42,"value":401},{"type":29,"tag":30,"props":406,"children":407},{},[408],{"type":42,"value":409},"Vous pouvez retourner à une activité normale.",{"title":7,"searchDepth":411,"depth":411,"links":412},2,[],"markdown","content:articles:2017:09:29:feature-branching-vs-feature-flipping.md","content","articles/2017/09/29/feature-branching-vs-feature-flipping.md","md",1699949282565]