[{"data":1,"prerenderedAt":376},["Reactive",2],{"/articles/en/2023/03/being-in-the-room":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"date":11,"tags":12,"cover":16,"book":17,"language":18,"alternates":19,"readingTime":22,"body":27,"_type":371,"_id":372,"_source":373,"_file":374,"_extension":375},"/articles/en/2023/03/being-in-the-room","03",false,"","Being in the room","Tomorrow's products cannot be designed without the engineers who make them, right from the start. You can't live in a technological world and not understand it.","16","2023-03-01",[13,14,15],"innovation","product","engineering","team-table.jpg","impactfulSoftwareEngineering","en",[20],{"fr":21},"https://eventuallycoding.com/2023/03/amenez-ingenieurs-dans-la-salle",{"text":23,"minutes":24,"time":25,"words":26},"8 min read",7.075,424500,1415,{"type":28,"children":29,"toc":362},"root",[30,38,43,48,61,68,73,78,100,105,110,115,120,126,136,142,147,153,158,164,169,179,193,203,223,251,261,267,281,286,301,306,311,341,346],{"type":31,"tag":32,"props":33,"children":34},"element","p",{},[35],{"type":36,"value":37},"text","I started my career with a first internship in a web startup in 2001. I believe I built a solid experience as a developer. But throughout my career I had several experiences that made me realize that there was a problem in the way many companies approach product development.",{"type":31,"tag":32,"props":39,"children":40},{},[41],{"type":36,"value":42},"Have you ever experienced those famous product & tech decisions that were clearly not to be made and could have been avoided easily by having a tech person in the room?",{"type":31,"tag":32,"props":44,"children":45},{},[46],{"type":36,"value":47},"It was too expensive, technically unrealistic, totally opposite to current market practices, not in adequacy with the users' expectations, not taking advantage of a recent innovation. In short, we could have done better and saved the company time and money.",{"type":31,"tag":49,"props":50,"children":51},"image",{},[52],{"type":31,"tag":32,"props":53,"children":54},{},[55],{"type":31,"tag":56,"props":57,"children":60},"img",{"alt":58,"src":59},"Software engineer not in the room where important decisions are made","/images/not-in-the-room.jpg",[],{"type":31,"tag":62,"props":63,"children":65},"h2",{"id":64},"software-is-eating-the-world",[66],{"type":36,"value":67},"Software is eating the world",{"type":31,"tag":32,"props":69,"children":70},{},[71],{"type":36,"value":72},"You probably know the expression \"Software is eating the world\". Software is everywhere today in our daily lives. It follows you on your mobile, at work, in the transport.",{"type":31,"tag":32,"props":74,"children":75},{},[76],{"type":36,"value":77},"If some companies still talk about cost centers when they talk about product teams, how many of them would be totally inoperative without these teams?",{"type":31,"tag":32,"props":79,"children":80},{},[81,83,87,89,98],{"type":36,"value":82},"Regularly, we hear about a new sector being radically transformed by a new Pure player. Our lives have been changing continuously under this strong technological pressure for the last few decades. And I think we are not yet ready for the future evolutions linked to AI.",{"type":31,"tag":84,"props":85,"children":86},"br",{},[],{"type":36,"value":88},"\nOn this topic, I invite you to read Kai-Fu Lee's book, ",{"type":31,"tag":90,"props":91,"children":95},"a",{"href":92,"rel":93},"https://www.aisuperpowers.com/",[94],"nofollow",[96],{"type":36,"value":97},"AI superpowers",{"type":36,"value":99},".",{"type":31,"tag":32,"props":101,"children":102},{},[103],{"type":36,"value":104},"But why, despite this, we continue to see product teams working without involving the engineers who will implement these solutions?",{"type":31,"tag":32,"props":106,"children":107},{},[108],{"type":36,"value":109},"In some environments, the tech executes and that's it. It's a shame, because far beyond knowing how to write code or set up software factories, the first skill of a \"software engineer\" is to solve problems and design solutions.",{"type":31,"tag":32,"props":111,"children":112},{},[113],{"type":36,"value":114},"Tomorrow's products cannot be designed without the engineers who make them, and this, from the very first steps. You can't live in a technological world and not understand it. Teams that don't grasp it are at a serious disadvantage. I'm not talking about state of the art or software quality, I'm talking about gaining a competitive advantage in a fast moving market full of uncertainty. The last few years have shown us how radically the world can change in a very short time.",{"type":31,"tag":32,"props":116,"children":117},{},[118],{"type":36,"value":119},"But for that to happen, you need to have engineering teams in that famous room where decisions are made. And I've been in several situations where this was not the case, for many reasons.",{"type":31,"tag":62,"props":121,"children":123},{"id":122},"seniors-not-aware-of-their-role",[124],{"type":36,"value":125},"Seniors not aware of their role",{"type":31,"tag":32,"props":127,"children":128},{},[129,131,134],{"type":36,"value":130},"If we consider only technical skills, I have known very good engineers, but who did not understand their role. These people did not see the business as a whole and could not see how to create impact. Their time management was problematic, whether it was how to organize it or how to prioritize it. They sometimes ended up burning out, while never working on the important issues.",{"type":31,"tag":84,"props":132,"children":133},{},[],{"type":36,"value":135},"\nSometimes, these people had the right insights, saw what needed to be done, but didn't know how to communicate, or even considered that it wasn't their job to bring these ideas to fruition.",{"type":31,"tag":62,"props":137,"children":139},{"id":138},"patchwork-engineering-teams",[140],{"type":36,"value":141},"Patchwork engineering teams",{"type":31,"tag":32,"props":143,"children":144},{},[145],{"type":36,"value":146},"Sometimes the action of the engineering teams is too vague. It seems to have no clear direction beyond the RUN. Teams don't scale, because management is too present and has turned into a Single point of failure, sometimes it's the opposite, teams are autonomous, but don't follow any common vision. Leadership is unable to create effective teams, and here again it fails to impose itself as a reliable actor who must participate in the construction of the product.",{"type":31,"tag":62,"props":148,"children":150},{"id":149},"sick-product-organizations",[151],{"type":36,"value":152},"Sick product organizations",{"type":31,"tag":32,"props":154,"children":155},{},[156],{"type":36,"value":157},"In some cases, it is the entire organization of the company that is the problem. They talk about agility, but continue to make a disguised waterfall where Engineering is relocated, in another building, another city, another country, and never consulted. These are also companies that have sometimes given in too much to complexity to cope with their growth, pushed into this by armies of certified consultants, experts in Scrum, or worse, SaFe, CMMI and other horrors.",{"type":31,"tag":62,"props":159,"children":161},{"id":160},"building-engineering-teams-that-create-impact",[162],{"type":36,"value":163},"Building engineering teams that create impact",{"type":31,"tag":32,"props":165,"children":166},{},[167],{"type":36,"value":168},"All of this formed the groundwork for my personal beliefs about how to run a product organization.",{"type":31,"tag":32,"props":170,"children":171},{},[172,174,177],{"type":36,"value":173},"When I participated in the creation of Malt, I had two main motivations.\nThe first was to shake up the codes of the Consulting/Freelancing market, to change the practices to make them more transparent, to dismantle the intermediaries, to simplify the life of freelancers.",{"type":31,"tag":84,"props":175,"children":176},{},[],{"type":36,"value":178},"\nBut the second reason was to build a company, in which I would have liked to work myself as an employee. And one of the factors for me was to create a strong, efficient Engineering and Product culture, which is the main vector of our growth.",{"type":31,"tag":32,"props":180,"children":181},{},[182,184,191],{"type":36,"value":183},"This is what I want to share in the future chapters of ",{"type":31,"tag":90,"props":185,"children":188},{"href":186,"rel":187},"https://eventuallycoding.com/en/2023/02/impactful-software-engineering",[94],[189],{"type":36,"value":190},"Impactful Software Engineering",{"type":36,"value":192}," of which this blog post is the introduction. I want to share what I have learned over the years and allow other technical leaders to benefit from it.",{"type":31,"tag":32,"props":194,"children":195},{},[196,198,201],{"type":36,"value":197},"I want to address in particular the \"Tech Leads\", whoever they are (CTO, Staff Engineer, Senior Engineer). By ricochet, it can be useful to Engineering Managers (VP, Eng Manager, Directors of eng...) whose help is needed.",{"type":31,"tag":84,"props":199,"children":200},{},[],{"type":36,"value":202},"\nBut of course it can also be useful for other people interested in building an efficient product/tech company.",{"type":31,"tag":32,"props":204,"children":205},{},[206,208,211,213,216,218,221],{"type":36,"value":207},"In the following chapters I will talk about the qualities expected from Software Engineers to make an individual impact.",{"type":31,"tag":84,"props":209,"children":210},{},[],{"type":36,"value":212},"\nI want to discuss the notions of leadership to multiply one's impact within a team.",{"type":31,"tag":84,"props":214,"children":215},{},[],{"type":36,"value":217},"\nI will describe what I consider to be an effective engineering organization and the pitfalls not to fall into.",{"type":31,"tag":84,"props":219,"children":220},{},[],{"type":36,"value":222},"\nI will also describe what I consider the most effective way to make product, and the role of Engineering in these two key phases, Discovery and Delivery.",{"type":31,"tag":32,"props":224,"children":225},{},[226,228,231,233,240,242,249],{"type":36,"value":227},"On the other hand, I will not talk much about management. This book will of course deal with the notions of career path, of engineering manager, but it will be done for individual contributors.",{"type":31,"tag":84,"props":229,"children":230},{},[],{"type":36,"value":232},"\nSimilarly, I will talk about products, but I will go into less detail than ",{"type":31,"tag":90,"props":234,"children":237},{"href":235,"rel":236},"https://www.svpg.com/team/marty-cagan/",[94],[238],{"type":36,"value":239},"Marty Cagan",{"type":36,"value":241}," or ",{"type":31,"tag":90,"props":243,"children":246},{"href":244,"rel":245},"https://www.producttalk.org/",[94],[247],{"type":36,"value":248},"Teresa Torres",{"type":36,"value":250}," whose books I recommend.",{"type":31,"tag":32,"props":252,"children":253},{},[254,256,259],{"type":36,"value":255},"Finally, this is not intended to become the future support of a coaching method. If one day I were to seek a new adventure, it would not be as a coach or counselor. I know to be wary of these types of predictions which often turn out to be wrong. But I know from having done it that I get way too frustrated in these situations and need to get my hands dirty.",{"type":31,"tag":84,"props":257,"children":258},{},[],{"type":36,"value":260},"\nAnyway, this book will not give you a turnkey method to apply, but rather talks about finding impact and attitude.",{"type":31,"tag":62,"props":262,"children":264},{"id":263},"disclaimer",[265],{"type":36,"value":266},"Disclaimer",{"type":31,"tag":32,"props":268,"children":269},{},[270,272,279],{"type":36,"value":271},"I have been the CTO and co-founder of ",{"type":31,"tag":90,"props":273,"children":276},{"href":274,"rel":275},"https://www.malt.com",[94],[277],{"type":36,"value":278},"Malt",{"type":36,"value":280}," for 11 years as I write this. We started with 3 people and are now over 600, in 6 countries with half a million registered freelancers. I've helped build a product team of about 130 people and have learned a lot over the years.",{"type":31,"tag":32,"props":282,"children":283},{},[284],{"type":36,"value":285},"I'd like to start with a disclaimer. We all have biases. And it's important to understand my biases in order to understand what I'm going to write about in this book. Also, I am aware that I have more to learn. At Malt, I made mistakes and I still make them.",{"type":31,"tag":32,"props":287,"children":288},{},[289,291,294,296,299],{"type":36,"value":290},"I have worked for several years as a Consultant or Freelance. In this context, I worked for very large companies, in telecoms (Bougues Telecom), banking (Société Générale), insurance (Axa), travel (Expedia Group), security (Airbus Group), energy (Enedis).",{"type":31,"tag":84,"props":292,"children":293},{},[],{"type":36,"value":295},"\nI also worked for a software editor in finance (Sungard).",{"type":31,"tag":84,"props":297,"children":298},{},[],{"type":36,"value":300},"\nFinally, I have been working for more than 10 years at Malt, which has become a major European scale-up.",{"type":31,"tag":32,"props":302,"children":303},{},[304],{"type":36,"value":305},"I am quite proud of my career path. But I know that I only know a small part of the industry.",{"type":31,"tag":32,"props":307,"children":308},{},[309],{"type":36,"value":310},"So my biases are the following:",{"type":31,"tag":312,"props":313,"children":314},"ul",{},[315,321,326,331,336],{"type":31,"tag":316,"props":317,"children":318},"li",{},[319],{"type":36,"value":320},"I consider myself mostly as an individual contributor (as opposed to manager)",{"type":31,"tag":316,"props":322,"children":323},{},[324],{"type":36,"value":325},"I have a strong background as a Backend Developer, and today more as a Web Developer",{"type":31,"tag":316,"props":327,"children":328},{},[329],{"type":36,"value":330},"I think I have an entrepreneurial spirit, not very averse to risks and changes",{"type":31,"tag":316,"props":332,"children":333},{},[334],{"type":36,"value":335},"I have worked in very large companies, but never in a Big Tech",{"type":31,"tag":316,"props":337,"children":338},{},[339],{"type":36,"value":340},"Even if I work in English on a daily basis in an international context, I have only worked in France.",{"type":31,"tag":32,"props":342,"children":343},{},[344],{"type":36,"value":345},"Finally, second warning, there is a difference between the opinions I can express here, the direction I want to take, and the reality of my daily life which can be more contrasted. Malt has dysfunctions, like everywhere else. My opinions are sometimes addressed to myself and give me a direction to go.",{"type":31,"tag":347,"props":348,"children":349},"tip",{},[350],{"type":31,"tag":32,"props":351,"children":352},{},[353,355,360],{"type":36,"value":354},"This blog post is part of the book ",{"type":31,"tag":90,"props":356,"children":358},{"href":357},"/en/2023/02/impactful-software-engineering",[359],{"type":36,"value":190},{"type":36,"value":361},".\nFeel free to read the other chapters.",{"title":7,"searchDepth":363,"depth":363,"links":364},2,[365,366,367,368,369,370],{"id":64,"depth":363,"text":67},{"id":122,"depth":363,"text":125},{"id":138,"depth":363,"text":141},{"id":149,"depth":363,"text":152},{"id":160,"depth":363,"text":163},{"id":263,"depth":363,"text":266},"markdown","content:articles:en:2023:03:being-in-the-room.md","content","articles/en/2023/03/being-in-the-room.md","md",1699798322902]