[{"data":1,"prerenderedAt":348},["Reactive",2],{"/articles/2016/03/14/les-levees-de-fond-en-startup":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"date":11,"categories":12,"tags":14,"img":18,"cover":19,"readingTime":20,"body":25,"_type":343,"_id":344,"_source":345,"_file":346,"_extension":347},"/articles/2016/03/14/les-levees-de-fond-en-startup","14",false,"","Les levées de fond en startup","Depuis quelque temps, je me rends compte que je réponds de plus en plus souvent, Lateral-Thoughts et Hopwork obligent, à des questions sur la création...","1241","2016-03-14",[13],"waza",[15,16,17],"malt","levee-de-fonds","startup","489d9-croissance.jpg","cover3.jpg",{"text":21,"minutes":22,"time":23,"words":24},"11 min read",10.365,621900,2073,{"type":26,"children":27,"toc":328},"root",[28,36,70,75,80,94,99,104,109,114,119,126,131,136,143,148,154,167,173,178,184,198,203,217,223,228,242,247,252,257,263,268,274,279,302,307,313,318,323],{"type":29,"tag":30,"props":31,"children":32},"element","p",{},[33],{"type":34,"value":35},"text","Depuis quelque temps, je me rends compte que je réponds de plus en plus souvent, Lateral-Thoughts et Hopwork obligent, à des questions sur la création d'entreprise et la recherche de financement. Je n'en suis pourtant pas un spécialiste mais j'ai tout de même quelques éléments de réponse alors pourquoi pas en faire un billet de blog. Je vais tenter de vous faire partager ce que j'en connais jusqu'ici",{"type":29,"tag":30,"props":37,"children":38},{},[39,41,50,52,59,61,68],{"type":34,"value":40},"Pour resituer tout d'abord, je vais parler de sociétés constituées de plusieurs personnes. J'ai aussi été freelance mais je n'en parlerais pas car la recherche de fonds est très très rarement nécessaire pour un freelance. Je parlerais ici de ",{"type":29,"tag":42,"props":43,"children":47},"a",{"href":44,"rel":45},"https://www.hopwork.fr/",[46],"nofollow",[48],{"type":34,"value":49},"Hopwork",{"type":34,"value":51}," et vous trouverez un billet dédié pour ",{"type":29,"tag":42,"props":53,"children":56},{"href":54,"rel":55},"http://www.lateral-thoughts.com/",[46],[57],{"type":34,"value":58},"Lateral-Thoughts",{"type":34,"value":60}," ",{"type":29,"tag":42,"props":62,"children":65},{"href":63,"rel":64},"http://www.lateral-thoughts.com/blog/2016/03/13/Le%20financement/",[46],[66],{"type":34,"value":67},"sur le blog de LT directement",{"type":34,"value":69}," (le cas étant beaucoup plus simple).",{"type":29,"tag":30,"props":71,"children":72},{},[73],{"type":34,"value":74},"Si vous vous posez des questions sur le financement d'une startup, ceci pourrait vous intéresser. Hopwork est une startup créée en 2012 dont le produit s'est véritablement lancé en 2013. Il s'agit d'une place de marché qui met en relation freelances et entreprises. Elle propose tout un tas de services aux deux parties (assurance, contractualisation en ligne, facturation en ligne, gestion des litiges, paiement par CB, prépaiement avec compte de séquestre, apport d'affaire etc...) C'est une startup au sens strict du terme, car elle est en forte croissance et a nécessité plusieurs levées de fond pour se financer. Une startup bien souvent n'est pas à l'équilibre, elle a pour vocation d'investir continuellement pour croître. Et cet investissement la met dans le rouge constamment.",{"type":29,"tag":30,"props":76,"children":77},{},[78],{"type":34,"value":79},"En gros pour une startup, le chiffre d'affaire et les dépenses ça ressemblent à ça :",{"type":29,"tag":30,"props":81,"children":82},{},[83],{"type":29,"tag":42,"props":84,"children":87},{"href":85,"rel":86},"http://eventuallycoding.com/wp-content/uploads/2016/03/489d9-croissance.jpg",[46],[88],{"type":29,"tag":89,"props":90,"children":93},"img",{"alt":91,"src":92},"croissance","/images/489d9-croissance.jpg",[],{"type":29,"tag":30,"props":95,"children":96},{},[97],{"type":34,"value":98},"Au début la croissance est faible, vous cherchez votre modèle. Pour certaines boîtes cette recherche peut prendre du temps et ne pas aboutir. Quand vous avez trouvé un modèle, vous réalisez des hausses de chiffres d'affaire mais vous finissez par rencontrer des plateaux de croissance. Pour dépasser ces plateaux vous devez identifier les leviers vous permettant de faire mieux, ces leviers demandent bien souvent de l'investissement (développement logiciel, recrutement, publicité, infrastructure) et vous relevez de l'argent. La différence entre vos dépenses et le chiffre d'affaire est souvent appelé \"Burn\". Vous brulez littéralement de l'argent.",{"type":29,"tag":30,"props":100,"children":101},{},[102],{"type":34,"value":103},"Il est tout à fait possible cependant pour une startup de choisir de rester sur un plateau de croissance, d'optimiser ces dépenses, réduire les investissements et rester une très belle boîte rentable. La fuite en avant n'est pas une nécessité absolue.",{"type":29,"tag":30,"props":105,"children":106},{},[107],{"type":34,"value":108},"Hopwork quant à elle est une place de marché. Une des caractéristiques d'une place de marché est qu'il faut beaucoup de transactions pour que ça fonctionne : - car la marge est faible au vu des investissements et qu'elle a vocation traditionnellement à diminuer avec la hausse du volume (que ce soit en valeur ou par le nombre de services ajoutés pour les utilisateurs) - car il faut que l'offre et la demande se trouvent, ce qui n'est possible qu'avec du volume",{"type":29,"tag":30,"props":110,"children":111},{},[112],{"type":34,"value":113},"Hopwork a donc réalisé jusqu'ici plusieurs levées de fonds avec des types d'investisseurs différents.",{"type":29,"tag":30,"props":115,"children":116},{},[117],{"type":34,"value":118},"Parlons maintenant des phases d'investissement des types d'investisseurs que l'on peut trouver.",{"type":29,"tag":120,"props":121,"children":123},"h2",{"id":122},"lamorcage",[124],{"type":34,"value":125},"L'amorcage",{"type":29,"tag":30,"props":127,"children":128},{},[129],{"type":34,"value":130},"Tout d'abord on va passer par la phase d'amorcage. Souvent on dit que c'est la période la plus difficile car l'entrepreneur ne sait pas comment se financer, il ne connait pas les différents types d'investisseurs, où les trouver, comment les séduire. Et surtout l'amorcage entre 0 et 500k se fait essentiellement auprès de fonds non professionnels : amis, familles et particuliers. On peut trouver de très bons business angels issus de fonds d'investissement mais ca reste rare. L'ACCRE reste pour moi bien souvent le meilleur moyen de démarrer si vous pouvez en bénéficier.",{"type":29,"tag":30,"props":132,"children":133},{},[134],{"type":34,"value":135},"J'en profite pour répondre à une question récurrente. Pourquoi chercher de l'argent ? Pourquoi ne pas simplement faire son produit le soir et le week end ou quelques jours de temps en temps sur ces congés ? J'imagine qu'on peut trouver des exceptions mais une startup qui va marcher, c'est des gens dédiés à 100%. Le monde du numérique va vite, aucune idée n'est révolutionnaire et la vôtre pas plus que les autres. Alors pour réussir il faut être à 100%, aller vite et bien. Et ça n'est pas possible en bossant juste de temps en temps. C'est une leçon que j'ai appris avec Localizeyourapps. Localizeyourapps était un produit avec un vrai potentiel, j'avais eu de nombreux contacts clients. Mais je ne m'y investissais pas assez. J'avais le défaut habituel du tech qui veut absolument faire un produit parfait avant d'aller plus loin mais je ne dédiais qu'une toute petite part de mon temps pour y arriver. Bref, ce fut un échec malgré un vrai potentiel. Je ferme la parenthèse, parlons donc de ces sources d'argent pour amorcer sa société.",{"type":29,"tag":137,"props":138,"children":140},"h3",{"id":139},"lassurance-chomage",[141],{"type":34,"value":142},"l'assurance chomage",{"type":29,"tag":30,"props":144,"children":145},{},[146],{"type":34,"value":147},"vi vi, c'est l'un des investisseurs majeurs de la création d'entreprise via l'ARCE et l'ARE. Beaucoup de personnes utilisent leur droit chômage via l'aide à la création d'entreprise pour tenir pendant 12 mois. Ca a été le cas de Vincent sur Hopwork. Quand on était salarié et qu'on peut vivre avec l'ARCE pour le début de la société, c'est idéal.",{"type":29,"tag":137,"props":149,"children":151},{"id":150},"entre-1-et-100k-les-amis-et-la-famille",[152],{"type":34,"value":153},"entre 1 et 100k Les amis et la famille",{"type":29,"tag":30,"props":155,"children":156},{},[157,159,165],{"type":34,"value":158},"On appelle cela la \"",{"type":29,"tag":160,"props":161,"children":162},"strong",{},[163],{"type":34,"value":164},"love money",{"type":34,"value":166},"\" dans le jargon des startups. Sur Hopwork nous n'y avons pas eu recours. Je n'aurais de toute façon pas personnellement fait investir des amis ou de la famille. Je trouve cela dangereux de mélanger les genres. Ca reste un moyen assez fréquent.",{"type":29,"tag":137,"props":168,"children":170},{"id":169},"entre-10-et-la-bpi",[171],{"type":34,"value":172},"entre 10 et ... la BPI",{"type":29,"tag":30,"props":174,"children":175},{},[176],{"type":34,"value":177},"On en parle peu mais en France nous avons des dispositifs de financement assez important via la Banque Publique d'Investissement (BPI). La BPI comporte plusieurs dispositifs d'aide qui vont de l'avance récupérable au prêt à taux 0. En tant que JEI nous avons bénéficié de plusieurs aides et prêt de la BPI. Certains montants sont aussi élevés que ce que vous pouvez trouver en financement par des business angels sans aucune perte de contrôle de la société. Mais qu'on ne s'y trompe pas, que ce soit le statut JEI, les aides au financement, les prêt à taux zéro, il faut aimer se farcir de l'administratif. C'est beaucoup de temps à passer dessus, temps que vous ne passez pas sur le développement de votre société. C'est pourquoi bien souvent on fait appel à un cabinet spécialisé qui va faire une partie des démarches pour vous (vous allez quand même y passer du temps) moyennant un pourcentage sur les aides obtenues. Sachant que le CIR est bien souvent détourné par les grands groupes ou les SSII qui financent leur intercontrat, les SSII qui créent des GIE pour bénéficier du statut JEI etc... personnellement je préférerais largement qu'il y ait juste une réduction des charges au globale sur les petites entreprises et ne pas avoir à gérer tout cet administratif. En l'état ça reste un avantage majeur des entreprises françaises par rapport au reste du monde donc on ne va pas cracher dessus non plus quand même.",{"type":29,"tag":137,"props":179,"children":181},{"id":180},"entre-50-et-500k-les-business-angels",[182],{"type":34,"value":183},"entre 50 et 500k Les business angels",{"type":29,"tag":30,"props":185,"children":186},{},[187,189,196],{"type":34,"value":188},"Ce sont des particuliers. Parfois il s'agit d'un ancien cadre avec un bon capital et qui souhaite se lancer dans une aventure entrepreneuriale. Parfois il s'agit de personnes qui en font véritablement leur métier et qui sont parfois aussi dans des fonds d'investissement professionnels mais réalisent quelques investissements à titre privé. La toute première levée de Hopwork de 30k s'est faite auprès d'un profil de ce type, ",{"type":29,"tag":42,"props":190,"children":193},{"href":191,"rel":192},"https://fr.linkedin.com/in/antoinefreysz",[46],[194],{"type":34,"value":195},"Antoine Freisz",{"type":34,"value":197},", qui a déjà fait de l'investissement précoce dans d'autres sociétés comme par exemple lafourchette.",{"type":29,"tag":30,"props":199,"children":200},{},[201],{"type":34,"value":202},"Antoine me permet de faire une première digression sur un sujet très important à mes yeux. Les investisseurs quand ils financent l'entreprise la rejoigne en tant que conseiller. Ils vont apporter leur aide, leur réseau, leur réputation parfois aussi. La startup doit autant choisir l'investisseur que l'investisseur choisit la startup. Dans le cas d'Antoine, il s'agit d'une personne avec une très grande expérience des entreprises du web, présent au conseil d'administration de plusieurs startups et dont le réseau s'est avéré très utile.",{"type":29,"tag":30,"props":204,"children":205},{},[206,208,215],{"type":34,"value":207},"Notre second tour de table s'est aussi déroulé auprès d'un business angels. Nous avons réalisé ",{"type":29,"tag":42,"props":209,"children":212},{"href":210,"rel":211},"http://www.frenchweb.fr/hopwork-la-marketplace-pour-freelances-leve-500-000-euros-et-vise-les-4-millions-deuros-de-chiffre-daffaires/152614",[46],[213],{"type":34,"value":214},"notre second tour avec Olivier Occelli pour 550k",{"type":34,"value":216},". Là encore l'expérience d'Olivier qui a fondé Naturabuy et qui est présent au capital de Doctolib, nous est très précieuse.",{"type":29,"tag":137,"props":218,"children":220},{"id":219},"mais-ces-investissements-cest-des-prêts",[221],{"type":34,"value":222},"Mais ces investissements, c'est des prêts ?",{"type":29,"tag":30,"props":224,"children":225},{},[226],{"type":34,"value":227},"Non pas du tout (à part la BPI). Les investisseurs qui vous donnent de l'argent le font contre des parts de votre société. En substance vous vous diluez dans le capital et l'investisseur prend 5, 10, 15, 20% des parts en fonction de la négociation que vous avez mené ensemble.",{"type":29,"tag":30,"props":229,"children":230},{},[231,233,240],{"type":34,"value":232},"Mais pourquoi 5 ou 20% me direz-vous ? Eh bien tout revient à savoir combien vous estimez la valorisation de votre société. Si par exemple vous souhaitez lever 500k euros et que vous démontrez que votre société vaut 2.5M, alors 500k correspond à 20% des parts. Toute la négociation qui va se jouer avec l'investisseur va donc porter sur la valorisation de votre société. Pour valoriser une société ",{"type":29,"tag":42,"props":234,"children":237},{"href":235,"rel":236},"http://www.actufinance.fr/fusions-acquisitions/techniques-valorisation.html",[46],[238],{"type":34,"value":239},"beaucoup de méthodes peuvent être utilisé",{"type":34,"value":241},"  mais un grand nombre de ces méthodes ne s'appliquent pas aux startups qui ne dégagent pas de CA. Dans ce cas c'est à vous de convaincre l'investisseur en fonction de vos métriques clés, de la taille du marché, de comparaison avec d'éventuels concurrents, de l'équipe actuelle et de la façon dont vous allez vous y prendre pour croitre. Au sujet de l'équipe, du peu que je connais désormais, cela semble être presque le critère numéro 1 pour juger un projet pour les investisseurs, tout du moins dans les premières périodes de la société. Et c'est très clairement la présence de Vincent Huguet parmi les fondateurs qui a permis à Hopwork de lever de l'argent. Vincent avait déjà une belle expérience avec la cofondation de Dromadaire, ooprint, la création de algoespecial au Mexique et une belle expérience chez Telmex. En termes de vitrine pour vendre l'équipe c'est un avantage incommensurable. Et c'est lui qui a de plus trouvé les investisseurs qui étaient soit des connaissances, soit très proche de ces cercles de connaissance.",{"type":29,"tag":30,"props":243,"children":244},{},[245],{"type":34,"value":246},"Désolé, vous comprendrez d'ailleurs que je n'ai pas beaucoup de conseils à prodiguer pour trouver les investisseurs car c'était le rôle de Vincent.",{"type":29,"tag":30,"props":248,"children":249},{},[250],{"type":34,"value":251},"Si vous n'êtes pas dans une situation aussi idyllique, il va falloir vous créer un réseau. Et pour cela je vous conseille grandement de passer par des incubateurs et des concours de startups. Sachez que certains incubateurs sont tellement prestigieux que le simple fait d'être sorti de chez eux est déjà un pas vers le succès (ycombinator aux USA par exemple).",{"type":29,"tag":30,"props":253,"children":254},{},[255],{"type":34,"value":256},"Mais poursuivons sur la phase d'investissement qui suit l'amorcage.",{"type":29,"tag":120,"props":258,"children":260},{"id":259},"les-séries",[261],{"type":34,"value":262},"Les séries",{"type":29,"tag":30,"props":264,"children":265},{},[266],{"type":34,"value":267},"Lorsque vous avez passé la phase d'amorcage, une startup va entrer dans des séries de financement auprès de fonds d'investissement puis des fonds de capital développement. Les américains appellent ces séries par des lettres, serie A, serie B etc... Ce qui correspond à la somme levée et le nombre de parts vendus dans l'opération.",{"type":29,"tag":137,"props":269,"children":271},{"id":270},"à-partir-de-500k-les-fonds-dinvestissement",[272],{"type":34,"value":273},"à partir de 500k, les fonds d'investissement",{"type":29,"tag":30,"props":275,"children":276},{},[277],{"type":34,"value":278},"Les fonds d'investissement/capitaux risqueurs/VC (venture capital) sont des sociétés qui font du placement financier dans des entreprises innovantes. Ces fonds ont pour objectif de revendre une partie de leur part sur des échéances de 4 a 8 ans pour réaliser une plus value. Ils attendent en principe une revente entre 2 et 5 fois la valeur initiale. On trouve cependant plusieurs types de fonds, le fond \"financier\" pur qui est adossé à une banque et dont le rôle de conseiller sera plus atténué et à l'inverse le fonds financier \"entreprenarial\".",{"type":29,"tag":30,"props":280,"children":281},{},[282,284,291,293,300],{"type":34,"value":283},"Pour ",{"type":29,"tag":42,"props":285,"children":288},{"href":286,"rel":287},"http://www.maddyness.com/finance/levee-de-fonds/2015/05/20/hopwork-freelance/",[46],[289],{"type":34,"value":290},"notre troisième tour de table de 1.5M d'euros",{"type":34,"value":292}," nous avons été rejoints par ",{"type":29,"tag":42,"props":294,"children":297},{"href":295,"rel":296},"http://www.isai.fr/en/",[46],[298],{"type":34,"value":299},"ISAI",{"type":34,"value":301}," qui est justement un fonds avec une véritable fibre d'entrepreneur du web et qui est déjà derrière de nombreuses sociétés dont l'emblématique Blablacar.",{"type":29,"tag":30,"props":303,"children":304},{},[305],{"type":34,"value":306},"Ces fonds sont souvent spécialisés, par secteur, par montant de levées etc... En effet certains fonds ne vont faire de l'investissement qu'à partir de 10M, d'autres uniquement dans le secteur des biotechnologies etc...",{"type":29,"tag":137,"props":308,"children":310},{"id":309},"à-partir-de-beaucoup-lentrée-en-bourse",[311],{"type":34,"value":312},"à partir de... beaucoup, l'entrée en bourse",{"type":29,"tag":30,"props":314,"children":315},{},[316],{"type":34,"value":317},"Ah, la fameuse IPO (initial public offering). L'entrée en bourse n'est pas nécessairement le Saint Graal mais c'est le moment où les stock-options (ou bon de souscription de part de création d'entreprise) peuvent enfin être convertis de virtuel à réel. C'est le moment où vous ouvrez votre capital aux actionnaires privés. C'est aussi le moment de vérité où le marché va montrer qu'il croit (ou non) à la valeur que vous prêtez à votre boîte. Je n'en parlerais pas plus que ça, c'est encore très loin de mes préoccupations sur Hopwork.",{"type":29,"tag":30,"props":319,"children":320},{},[321],{"type":34,"value":322},"Voilà, vous en savez désormais autant que moi. Mais n'hésitez pas à en discuter avec moi si on se croise lors d'un futur meetup.",{"type":29,"tag":30,"props":324,"children":325},{},[326],{"type":34,"value":327},"A bientôt",{"title":7,"searchDepth":329,"depth":329,"links":330},2,[331,339],{"id":122,"depth":329,"text":125,"children":332},[333,335,336,337,338],{"id":139,"depth":334,"text":142},3,{"id":150,"depth":334,"text":153},{"id":169,"depth":334,"text":172},{"id":180,"depth":334,"text":183},{"id":219,"depth":334,"text":222},{"id":259,"depth":329,"text":262,"children":340},[341,342],{"id":270,"depth":334,"text":273},{"id":309,"depth":334,"text":312},"markdown","content:articles:2016:03:14:les-levees-de-fond-en-startup.md","content","articles/2016/03/14/les-levees-de-fond-en-startup.md","md",1699797281904]