[{"data":1,"prerenderedAt":681},["Reactive",2],{"/articles/2013/09/09/serment-dhypocrite":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"date":11,"categories":12,"tags":14,"cover":18,"readingTime":19,"body":24,"_type":676,"_id":677,"_source":678,"_file":679,"_extension":680},"/articles/2013/09/09/serment-dhypocrite","09",false,"","Serment d'Hypocrite","Et si on parlait de la déontologie dans l’informatique","939","2013-09-09",[13],"waza",[15,16,17],"humeur","prism","professionnalisme","1dab7-1984-poster.jpg",{"text":20,"minutes":21,"time":22,"words":23},"10 min read",9.915,594900,1983,{"type":25,"children":26,"toc":666},"root",[27,35,42,47,63,68,73,78,84,89,94,99,129,135,149,199,204,209,222,227,237,246,251,256,262,267,272,286,291,296,301,306,311,316,321,327,340,345,358,363,436,449,455,468,482,494,499,513,518,523,537,553,558,627],{"type":28,"tag":29,"props":30,"children":31},"element","p",{},[32],{"type":33,"value":34},"text","La déontologie dans l’informatique, sujet complexe n’est ce pas ?",{"type":28,"tag":36,"props":37,"children":39},"h2",{"id":38},"le-serment-dhippocrate",[40],{"type":33,"value":41},"Le serment d'Hippocrate",{"type":28,"tag":29,"props":43,"children":44},{},[45],{"type":33,"value":46},"C’est un sujet qui me trottait dans la tête depuis quelques années suite à quelques projets dont je garde des souvenirs assez négatifs. Mais les événements récents m’ont poussé à y réfléchir d’autant plus.",{"type":28,"tag":29,"props":48,"children":49},{},[50,52,61],{"type":33,"value":51},"J’imagine qu’une grande majorité connaît déjà le ",{"type":28,"tag":53,"props":54,"children":58},"a",{"href":55,"rel":56},"http://fr.wikipedia.org/wiki/Serment_d%27Hippocrate",[57],"nofollow",[59],{"type":33,"value":60},"serment d’Hippocrate",{"type":33,"value":62}," prononcé par les médecins avant de commencer à exercer. C’est un texte écrit, selon Wikipédia, aux alentours du IV siècle avant JC et qui forme la base du code de déontologie médicale.",{"type":28,"tag":29,"props":64,"children":65},{},[66],{"type":33,"value":67},"Pour ceux dont le terme déontologie fait mal aux yeux, il s’agit d’un ensemble de règles et devoirs qui régissent une profession. Si l’origine grecque du mot ne parle pas d’éthique ou de morale (du grec deon, -ontos, ce qu'il faut faire, et logos, discours), c’est pourtant bien ce qu’on associe aujourd'hui à ce mot.",{"type":28,"tag":29,"props":69,"children":70},{},[71],{"type":33,"value":72},"C’est notamment ce code de déontologie médical qui fixe les grands principes du secret professionnel et du respect de la vie.",{"type":28,"tag":29,"props":74,"children":75},{},[76],{"type":33,"value":77},"A l’heure de PRISM ou d’AMESYS, qu’est-ce qui définit chez nous, informaticiens, les règles et devoirs que nous devrions respecter ?",{"type":28,"tag":36,"props":79,"children":81},{"id":80},"la-déontologie-dans-linformatique",[82],{"type":33,"value":83},"La déontologie dans l'informatique ?",{"type":28,"tag":29,"props":85,"children":86},{},[87],{"type":33,"value":88},"En fait la seule chose que j’ai jamais signé à l’école ou en entreprise ce sont des chartes informatiques. En gros ça disait qu’il ne fallait pas créer de bots XDCC sur les serveurs de l’école, qu’il ne fallait pas pirater les comptes des autres élèves pour leur changer leur fond d’écran, qu’il ne fallait pas utiliser son mail pour envoyer des kilos de powerpoint même s’ils étaient rigolos et qu’il fallait éviter d’installer des softs hackés.",{"type":28,"tag":29,"props":90,"children":91},{},[92],{"type":33,"value":93},"C’est déjà un début. Mais c'est assez pauvre.",{"type":28,"tag":29,"props":95,"children":96},{},[97],{"type":33,"value":98},"Quid du respect de la vie privée ? Du professionnalisme ?",{"type":28,"tag":29,"props":100,"children":101},{},[102,104,118,120,127],{"type":33,"value":103},"Comment un scandale comme PRISM peut-il à ce point passer inaperçu ",{"type":28,"tag":105,"props":106,"children":107},"sup",{},[108],{"type":28,"tag":53,"props":109,"children":115},{"href":110,"ariaDescribedBy":111,"dataFootnoteRef":113,"id":114},"#user-content-fn-1",[112],"footnote-label",true,"user-content-fnref-1",[116],{"type":33,"value":117},"1",{"type":33,"value":119}," aux yeux du grand public alors qu’il devrait y avoir au minimum ",{"type":28,"tag":53,"props":121,"children":124},{"href":122,"rel":123},"https://eventuallycoding.com/2013/08/12/travailler-autrement",[57],[125],{"type":33,"value":126},"533 000",{"type":33,"value":128}," informaticiens capable d’expliquer ces conséquences à leurs proches ? Est-ce que notre déontologie ne devrait pas nous forcer, nous qui comprenons les implications, à nous renseigner davantage et dénoncer les faits ?",{"type":28,"tag":36,"props":130,"children":132},{"id":131},"la-déontologie-expliqué-par-le-syntec-et-le-cigref",[133],{"type":33,"value":134},"La déontologie expliqué par le SYNTEC et le CIGREF",{"type":28,"tag":29,"props":136,"children":137},{},[138,140,147],{"type":33,"value":139},"Malgré tout, ",{"type":28,"tag":53,"props":141,"children":144},{"href":142,"rel":143},"http://fr.wikipedia.org/wiki/Code_de_d%C3%A9ontologie#En_informatique",[57],[145],{"type":33,"value":146},"en zieutant Wikipedia",{"type":33,"value":148}," on apprend que l’informatique en France a bien un semblant de code de déontologie, une charte rédigé par le club informatique des grandes entreprises françaises et le SYNTEC. Ca m’a arraché un œil en lisant la liste des auteurs, mais c’est véridique. Et on y aborde quand même :",{"type":28,"tag":150,"props":151,"children":152},"ul",{},[153,159,164,169,174,179,184,189,194],{"type":28,"tag":154,"props":155,"children":156},"li",{},[157],{"type":33,"value":158},"La connaissance des métiers,",{"type":28,"tag":154,"props":160,"children":161},{},[162],{"type":33,"value":163},"La transparence,",{"type":28,"tag":154,"props":165,"children":166},{},[167],{"type":33,"value":168},"L'impartialité,",{"type":28,"tag":154,"props":170,"children":171},{},[172],{"type":33,"value":173},"La qualité,",{"type":28,"tag":154,"props":175,"children":176},{},[177],{"type":33,"value":178},"L'innovation,",{"type":28,"tag":154,"props":180,"children":181},{},[182],{"type":33,"value":183},"La diffusion de l'information,",{"type":28,"tag":154,"props":185,"children":186},{},[187],{"type":33,"value":188},"Le partage des connaissances,",{"type":28,"tag":154,"props":190,"children":191},{},[192],{"type":33,"value":193},"La productivité,",{"type":28,"tag":154,"props":195,"children":196},{},[197],{"type":33,"value":198},"Le suivi.",{"type":28,"tag":29,"props":200,"children":201},{},[202],{"type":33,"value":203},"Et concernant “le suivi”, je me suis demandé si remplir les CRAs faisait partie de mon code déontologique :)",{"type":28,"tag":29,"props":205,"children":206},{},[207],{"type":33,"value":208},"C'est déjà bien ! Au moins on y parle de professionnalisme et ce serait déjà fantastique si on parvenait à respecter ces points, mais c’est un autre sujet...",{"type":28,"tag":29,"props":210,"children":211},{},[212,214,220],{"type":33,"value":213},"Malheureusement ",{"type":28,"tag":215,"props":216,"children":217},"strong",{},[218],{"type":33,"value":219},"je ne vois rien concernant la protection de la vie privée et la responsabilité collective vis-à-vis de la société",{"type":33,"value":221},".",{"type":28,"tag":29,"props":223,"children":224},{},[225],{"type":33,"value":226},"Toujours est-il que j’ai cherché sur Google cette fameuse charte et je n’ai pas réussi à mettre la main dessus. Par contre, je suis tombé sur cet article qui m’a donné un éclairage intéressant sur l’origine de cette charte :",{"type":28,"tag":29,"props":228,"children":229},{},[230],{"type":28,"tag":53,"props":231,"children":234},{"href":232,"rel":233},"http://www.argusdelassurance.com/social/le-cigref-et-le-syntec-font-la-paix-autour-d-une-charte.14513",[57],[235],{"type":33,"value":236},"Le Cigref et le syntec font la paix autour d'une charte",{"type":28,"tag":238,"props":239,"children":240},"blockquote",{},[241],{"type":28,"tag":29,"props":242,"children":243},{},[244],{"type":33,"value":245},"Le Club informatique des grandes entreprises françaises (Cigref) et la chambre syndicale des SSII et des éditeurs de logiciels (Syntec) établissent une charte de déontologie commune. Les relations entre les deux organismes se sont tendues depuis l'implosion de la bulle Internet. Le Cigref reproche aux prestataires de ne pas avoir su maîtriser les innovations qu'ils ont contribué à intégrer dans l'informatique des grandes entreprises. De même, le Syntec vit mal la pression sur les prix instaurée par les grandes entreprises.",{"type":28,"tag":29,"props":247,"children":248},{},[249],{"type":33,"value":250},"Ok, je vois mieux, le CIGREF reprochait un manque de maitrise des technologies et un manque de professionnalisme des SSII dans la période qui a suivi l’explosion de la bulle internet. Et cette fameuse charte a servi à enterrer la hache de guerre entre SSII et clients de SSII. Relisez les thèmes abordés par cette charte en sachant cela, on comprend mieux...",{"type":28,"tag":29,"props":252,"children":253},{},[254],{"type":33,"value":255},"Malgré tout, c’est vrai qu’un code déontologique est loin d’être simple à écrire.",{"type":28,"tag":36,"props":257,"children":259},{"id":258},"responsabilité-sociétale-et-déontologie",[260],{"type":33,"value":261},"Responsabilité sociétale et déontologie",{"type":28,"tag":29,"props":263,"children":264},{},[265],{"type":33,"value":266},"Il y a quelques années, j’ai participé à un projet dont le but affiché était d’automatiser un grand nombre d’opérations pour supprimer les coûts salariaux relatifs à ceux qui faisaient ces opérations à la mimine auparavant.",{"type":28,"tag":29,"props":268,"children":269},{},[270],{"type":33,"value":271},"Ce projet se déroulait dans le plus grand cynisme, il s’agissait bien de dégager des centaines de personnes pour dégager plus de profit. L’entreprise comme acteur social, on repassera.",{"type":28,"tag":29,"props":273,"children":274},{},[275,277,284],{"type":33,"value":276},"D’un autre côté, en prenant du recul, Keynes dans les années 20 prédisait que nous travaillerions de moins en moins, car nous aurions automatisé tout le travail pénible dans le futur. L’automatisation, la robolution serait donc une évolution inévitable qui pourrait conduire à cette fameuse ",{"type":28,"tag":53,"props":278,"children":281},{"href":279,"rel":280},"http://ecointerview.wordpress.com/2012/08/22/keynes-et-la-semaine-de-15-heures/",[57],[282],{"type":33,"value":283},"semaine de 15 heures de travail",{"type":33,"value":285}," imaginé par Keynes. (C’était aussi le principe qui régissait la société décrite dans la “nuit des temps” de Barjavel où le travail ne subsistait que pour donner un rôle social, mais n’avait aucune utilité réelle).",{"type":28,"tag":29,"props":287,"children":288},{},[289],{"type":33,"value":290},"C'est bien beau, mais entre temps la transition est plutôt douloureuse.",{"type":28,"tag":29,"props":292,"children":293},{},[294],{"type":33,"value":295},"Il est donc très difficile de me positionner sur ce sujet. Que pourrait faire un code déontologique pour moi dans ce cas-là si celui-ci me dit qu’il faut “agit pour le bien commun” ?",{"type":28,"tag":29,"props":297,"children":298},{},[299],{"type":33,"value":300},"En aidant à supprimer des postes, j'œuvre pour le bien commun ?",{"type":28,"tag":29,"props":302,"children":303},{},[304],{"type":33,"value":305},"Mais en aidant à conserver ces jobs, est-ce que je fais mieux ? Dans quelle mesure je participe au contraire à libérer des individus d'une tâche répétitive et inutile ? Si mon idéal est bien la semaine de 15h décrite plus haut, je dois travailler à automatiser les tâches répétitives pour que les humains puissent se consacrer à des tâches plus intéressantes.",{"type":28,"tag":29,"props":307,"children":308},{},[309],{"type":33,"value":310},"Encore faut-il qu'il y ait redistribution des richesses produites...",{"type":28,"tag":29,"props":312,"children":313},{},[314],{"type":33,"value":315},"En médecine aussi il existe des débats qui sont très compliqués à trancher : sur la culture de cellule souche, l’euthanasie etc... Et c'est pourquoi il existe un ordre des médecins qui en discute.",{"type":28,"tag":29,"props":317,"children":318},{},[319],{"type":33,"value":320},"Je ne crois pas qu'il existe l'équivalent pour nous.",{"type":28,"tag":36,"props":322,"children":324},{"id":323},"un-code-de-déontologie-très-complet-au-québec",[325],{"type":33,"value":326},"Un code de déontologie très complet au Québec",{"type":28,"tag":29,"props":328,"children":329},{},[330,332,339],{"type":33,"value":331},"Difficile ne veut pas dire qu’il ne faut pas s’y essayer. En cherchant un peu plus j’ai découvert que au Québec ils avaient bien réussi à rédiger ",{"type":28,"tag":53,"props":333,"children":336},{"href":334,"rel":335},"http://www.iro.umontreal.ca/%7Edift3830/code.txt",[57],[337],{"type":33,"value":338},"un code déontologique des informaticiens et informaticiennes",{"type":33,"value":221},{"type":28,"tag":29,"props":341,"children":342},{},[343],{"type":33,"value":344},"Ce code contient des chapitres sur le professionnalisme. Pour l'anecdote, on notera d’ailleurs le support officiel des groupes d’échanges dans la charte :",{"type":28,"tag":238,"props":346,"children":347},{},[348,353],{"type":28,"tag":29,"props":349,"children":350},{},[351],{"type":33,"value":352},"Les obligations des informaticiens envers leur profession",{"type":28,"tag":29,"props":354,"children":355},{},[356],{"type":33,"value":357},"L'informaticien aide, dans la mesure de ses possibilités, au développement de sa profession par l'échange de ses connaissances et de son expérience avec ses collègues et par sa collaboration à des activités de formation continue ou à des stages de perfectionnement.",{"type":28,"tag":29,"props":359,"children":360},{},[361],{"type":33,"value":362},"Mais il a aussi le mérite de parler de sujets plus profonds. Je vous laisse juge. J’ai supprimé quelques articles pour ne garder que ceux que je trouvais les plus intéressants.",{"type":28,"tag":238,"props":364,"children":365},{},[366,371,376,381,386,391,396,401,406,411,416,421,426,431],{"type":28,"tag":29,"props":367,"children":368},{},[369],{"type":33,"value":370},"Les obligations des informations envers le public",{"type":28,"tag":29,"props":372,"children":373},{},[374],{"type":33,"value":375},"2.02 L'informaticien favorise d'abord l'intérêt public dans l'exercice de sa profession.",{"type":28,"tag":29,"props":377,"children":378},{},[379],{"type":33,"value":380},"2.03 L'informaticien s'abstient de poser tout geste pouvant être nuisible à la société et d'inciter quiconque à le faire.",{"type":28,"tag":29,"props":382,"children":383},{},[384],{"type":33,"value":385},"2.04 L'informaticien évite de faire subir des préjudices aux personnes notamment, la modification ou la destruction non désirée de fichiers ou de programmes et les dommages causés à des biens informatiques. L'insertion de virus informatiques a comme conséquences éventuelles de faire subir de tels préjudices aux personnes.",{"type":28,"tag":29,"props":387,"children":388},{},[389],{"type":33,"value":390},"2.05 L'informaticien tient compte des conséquences éventuelles des actes professionnels qu'il est amené à poser afin d'éviter de causer des préjudices aux personnes.",{"type":28,"tag":29,"props":392,"children":393},{},[394],{"type":33,"value":395},"2.06 Pour éviter de causer des préjudices, l'informaticien informe, avec un souci d'exactitude et d'exhaustivité, toutes les personnes concernées sur les caractéristiques et les limitations des systèmes dont il a la responsabilité.",{"type":28,"tag":29,"props":397,"children":398},{},[399],{"type":33,"value":400},"2.07 L'informaticien signale aux personnes concernées tout fait ou toute information qui l'amènent à croire que des préjudices pourraient être causés au public.",{"type":28,"tag":29,"props":402,"children":403},{},[404],{"type":33,"value":405},"2.10 Dans sa pratique, l'informaticien s'efforce d'évaluer les systèmes informatiques et leurs impacts sur la vie, la santé, le bien-être et la propriété de toute personne avec la plus grande objectivité et avec un souci d'exactitude et d'exhaustivité.",{"type":28,"tag":29,"props":407,"children":408},{},[409],{"type":33,"value":410},"2.11 Dans tous les aspects de son travail, l'informaticien respecte ses obligations envers les personnes et tient compte des conséquences de l'exécution de ses travaux sur la vie, la santé, le bien-être et la propriété de toute personne.",{"type":28,"tag":29,"props":412,"children":413},{},[414],{"type":33,"value":415},"2.12 Dans la mesure de ses possibilités, l'informaticien fait prendre conscience au public en général de l'impact des systèmes informatiques et protège la société d'une mauvaise utilisation des systèmes informatiques.",{"type":28,"tag":29,"props":417,"children":418},{},[419],{"type":33,"value":420},"2.14 Lorsque l'informaticien considère que des travaux empiètent sur les droits et libertés fondamentaux des individus, il en informe toute personne ou organisme susceptible de corriger cette situation.",{"type":28,"tag":29,"props":422,"children":423},{},[424],{"type":33,"value":425},"2.16 Dans le cadre de sa pratique professionnelle, l'informaticien fait en sorte d'assurer la confidentialité des renseignements personnels ou confidentiels, de prendre toutes les mesures susceptibles de protéger ces renseignements et d'en assurer l'exactitude.",{"type":28,"tag":29,"props":427,"children":428},{},[429],{"type":33,"value":430},"2.17 Dans le cadre de sa pratique professionnelle, l'informaticien s'assure de conserver les seuls renseignements personnels ou confidentiels nécessaires à la bonne marche d'un système. Les renseignements personnels ou confidentiels ne doivent être conservés à des fins autres que celles prévues initialement sans le consentement des personnes concernées.",{"type":28,"tag":29,"props":432,"children":433},{},[434],{"type":33,"value":435},"2.19 L'informaticien favorise les mesures d'éducation et d'information dans le domaine de l'informatique, que ce soit dans l'entreprise où il exerce ou dans son milieu social.",{"type":28,"tag":29,"props":437,"children":438},{},[439,441,448],{"type":33,"value":440},"J'avoue que certains items me rappellent les ",{"type":28,"tag":53,"props":442,"children":445},{"href":443,"rel":444},"https://fr.wikipedia.org/wiki/Trois_lois_de_la_robotique",[57],[446],{"type":33,"value":447},"lois de la robotique d'Asimov",{"type":33,"value":221},{"type":28,"tag":36,"props":450,"children":452},{"id":451},"déontologie-et-respect-de-la-vie-privée",[453],{"type":33,"value":454},"Déontologie et respect de la vie privée",{"type":28,"tag":456,"props":457,"children":458},"image",{},[459],{"type":28,"tag":29,"props":460,"children":461},{},[462],{"type":28,"tag":463,"props":464,"children":467},"img",{"alt":465,"src":466},"1984-poster","/images/1dab7-1984-poster.jpg",[],{"type":28,"tag":29,"props":469,"children":470},{},[471,473,480],{"type":33,"value":472},"En tant qu’être humain, trouvez-vous normal de ne poser aucune question et exécuter les consignes aveuglement lorsqu’il s’agit d’organiser la surveillance généralisée, l’espionnage des individus. Si vous étiez chez Amesys, ",{"type":28,"tag":53,"props":474,"children":477},{"href":475,"rel":476},"http://www.humanite.fr/monde/amesys-information-judiciaire-ouverte-pour-complicite-de-torture-en-libye-497057",[57],[478],{"type":33,"value":479},"était-il nécessaire d’attendre que votre société soit sous l’objet d’une information judiciaire pour complicité d’acte de torture en Lybie",{"type":33,"value":481}," pour vous rendre compte de sa nuisance ?",{"type":28,"tag":29,"props":483,"children":484},{},[485,487,492],{"type":33,"value":486},"Et nous informaticiens, à l’heure ou le numérique a une place prépondérante dans nos vies, à l’heure où les prédictions les plus noires d'Orwell se sont réalisées, avons-nous prononcé ",{"type":28,"tag":215,"props":488,"children":489},{},[490],{"type":33,"value":491},"un serment d’hypocrite",{"type":33,"value":493}," au point de ne pas reconnaître ces actions néfastes quand elles se présentent ? Est-ce que \"je ne suis que prestataire\" ou \"ce n'est pas moi qui décide\" est vraiment une ligne de défense acceptable ?",{"type":28,"tag":29,"props":495,"children":496},{},[497],{"type":33,"value":498},"Oh vous vous dites peut-être, “moi je ne suis pas concerné, je ne travaille pas pour l’armée/la défense etc…”. A l'heure du BigData où chacun tente de conserver et exploiter un maximum de données ce serait pourtant surprenant. Dans le grand public on ne peut pas dire que Cisco, Google, Facebook, Microsoft et bien d'autres moins connus ait fait beaucoup mieux.",{"type":28,"tag":29,"props":500,"children":501},{},[502,504,511],{"type":33,"value":503},"Récemment ",{"type":28,"tag":53,"props":505,"children":508},{"href":506,"rel":507},"https://news.ycombinator.com/item?id=6154475",[57],[509],{"type":33,"value":510},"un employé de Blizzard se repentait d'avoir du poser des backdoors sur la version chinoise de WOW",{"type":33,"value":512}," afin de permettre sa vente en Chine. Tous les secteurs sont concernés.",{"type":28,"tag":29,"props":514,"children":515},{},[516],{"type":33,"value":517},"Pouvez-vous dire sérieusement après avoir lu la charte ci-dessus que vous l’avez toujours respecté ? Que vous avez placé l’intérêt du public devant tout le reste ? Que vous avez signalé une mauvaise utilisation de données personnelles ? Que vous avez informé vos proches des conséquences de nos métiers sur leurs vies ?",{"type":28,"tag":29,"props":519,"children":520},{},[521],{"type":33,"value":522},"Réfléchissez-y.",{"type":28,"tag":29,"props":524,"children":525},{},[526,528,535],{"type":33,"value":527},"Et pour conclure je finirais par une citation ",{"type":28,"tag":53,"props":529,"children":532},{"href":530,"rel":531},"http://www.zdnet.fr/actualites/tribune-un-nouvel-internet-securise-et-libre-vous-revez-39793826.htm",[57],[533],{"type":33,"value":534},"d'un article lu récemment",{"type":33,"value":536}," :",{"type":28,"tag":238,"props":538,"children":539},{},[540],{"type":28,"tag":29,"props":541,"children":542},{},[543,545,551],{"type":33,"value":544},"Cela serait bien que les ingénieurs ne restent pas silencieux sur la pression du gouvernement pour subvertir la sécurité de leurs produits. Lancer des alertes sur ce genre de choses me semble honorable. Plus largement, nous devons réfléchir sur ce qu'il convient de faire, parce que la situation actuelle n'est pas acceptable. ",{"type":28,"tag":546,"props":547,"children":548},"span",{},[549],{"type":33,"value":550},"...",{"type":33,"value":552},"Si les ingénieurs, ou même les simples mortels, pensent que quelque chose doit être fait, les urnes électorales sont l'endroit tout désigné pour le faire.",{"type":28,"tag":29,"props":554,"children":555},{},[556],{"type":33,"value":557},"Quelques liens à lire :",{"type":28,"tag":150,"props":559,"children":560},{},[561,572,583,594,605,616],{"type":28,"tag":154,"props":562,"children":563},{},[564,566],{"type":33,"value":565},"Lettre ouverte aux mathématiciens ayant travaillé pour le NSA : ",{"type":28,"tag":53,"props":567,"children":570},{"href":568,"rel":569},"http://lite2.framapad.org/p/nsa-maths",[57],[571],{"type":33,"value":568},{"type":28,"tag":154,"props":573,"children":574},{},[575,577],{"type":33,"value":576},"Inventaire à la Prévert des questions sans réponse sur #PRISM ",{"type":28,"tag":53,"props":578,"children":581},{"href":579,"rel":580},"http://reflets.info/inventaire-a-la-prevert-des-questions-sans-reponse-sur-prism/",[57],[582],{"type":33,"value":579},{"type":28,"tag":154,"props":584,"children":585},{},[586,588],{"type":33,"value":587},"Prism n’est qu’une partie d’un système bien plus vaste : ",{"type":28,"tag":53,"props":589,"children":592},{"href":590,"rel":591},"http://reflets.info/spoiler-what-is-prism/",[57],[593],{"type":33,"value":590},{"type":28,"tag":154,"props":595,"children":596},{},[597,599],{"type":33,"value":598},"La théorie du gros Zizi : ",{"type":28,"tag":53,"props":600,"children":603},{"href":601,"rel":602},"http://reflets.info/prism-la-theorie-du-gros-zizi/",[57],[604],{"type":33,"value":601},{"type":28,"tag":154,"props":606,"children":607},{},[608,610],{"type":33,"value":609},"L’hypocrisie française : ",{"type":28,"tag":53,"props":611,"children":614},{"href":612,"rel":613},"http://bluetouff.com/2013/07/01/prism-comment-passer-dun-spagrave-au-chuichoquee-en-moins-de-48h-avec-du-fleurpellerin-dedans/",[57],[615],{"type":33,"value":612},{"type":28,"tag":154,"props":617,"children":618},{},[619,621],{"type":33,"value":620},"Au moins 7 pays européens auraient des accords avec la NSA : ",{"type":28,"tag":53,"props":622,"children":625},{"href":623,"rel":624},"http://reflets.info/prism-and-guests-au-moins-7-pays-europeens-auraient-des-accords-avec-la-nsa/",[57],[626],{"type":33,"value":623},{"type":28,"tag":628,"props":629,"children":632},"section",{"className":630,"dataFootnotes":113},[631],"footnotes",[633,640],{"type":28,"tag":36,"props":634,"children":637},{"className":635,"id":112},[636],"sr-only",[638],{"type":33,"value":639},"Footnotes",{"type":28,"tag":641,"props":642,"children":643},"ol",{},[644],{"type":28,"tag":154,"props":645,"children":647},{"id":646},"user-content-fn-1",[648,650,655,657],{"type":33,"value":649},"Quelques articles dans la presse c’est bénin. Un tel scandale devrait avoir ",{"type":28,"tag":215,"props":651,"children":652},{},[653],{"type":33,"value":654},"au minimum",{"type":33,"value":656}," poussé tous les dirigeants actuels à être démis de leur fonction. Le watergate qui a poussé Nixon à la démission n’était qu’un pouillième de ce que PRISM, Amesys ou la NSA représente. ",{"type":28,"tag":53,"props":658,"children":663},{"href":659,"ariaLabel":660,"className":661,"dataFootnoteBackref":113},"#user-content-fnref-1","Back to content",[662],"data-footnote-backref",[664],{"type":33,"value":665},"↩",{"title":7,"searchDepth":667,"depth":667,"links":668},2,[669,670,671,672,673,674,675],{"id":38,"depth":667,"text":41},{"id":80,"depth":667,"text":83},{"id":131,"depth":667,"text":134},{"id":258,"depth":667,"text":261},{"id":323,"depth":667,"text":326},{"id":451,"depth":667,"text":454},{"id":112,"depth":667,"text":639},"markdown","content:articles:2013:09:09:serment-dhypocrite.md","content","articles/2013/09/09/serment-dhypocrite.md","md",1700467052717]