[{"data":1,"prerenderedAt":306},["Reactive",2],{"/articles/2021/11/25/recrutements-et-salaires-session-de-qa":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"date":11,"categories":12,"tags":14,"cover":17,"readingTime":18,"body":23,"_type":301,"_id":302,"_source":303,"_file":304,"_extension":305},"/articles/2021/11/25/recrutements-et-salaires-session-de-qa","25",false,"","Recrutements et salaires : session de Q&A","J'étais présent en tant qu'intervenant il y a quelques jours à [un meetup](https://www.linkedin.com/events/conf-rence-cequeveulentlesdev-l686238941497...","1875","2021-11-25",[13],"waza",[15,16],"salaires","startup","cover7.jpg",{"text":19,"minutes":20,"time":21,"words":22},"8 min read",7.475,448500,1495,{"type":24,"children":25,"toc":294},"root",[26,68,73,83,90,95,155,160,174,180,185,190,223,233,242,248,263,269,289],{"type":27,"tag":28,"props":29,"children":30},"element","p",{},[31,34,43,45,51,53,57,59,66],{"type":32,"value":33},"text","J'étais présent en tant qu'intervenant il y a quelques jours à ",{"type":27,"tag":35,"props":36,"children":40},"a",{"href":37,"rel":38},"https://www.linkedin.com/events/conf-rence-cequeveulentlesdev-l6862389414971211776/",[39],"nofollow",[41],{"type":32,"value":42},"un meetup",{"type":32,"value":44}," sur le thème ",{"type":27,"tag":46,"props":47,"children":48},"strong",{},[49],{"type":32,"value":50},"\"ce que veulent les devs à l'ère post covid\"",{"type":32,"value":52}," et j'aimerais revenir sur quelques questions qui ont été posées en session de Q&A.",{"type":27,"tag":54,"props":55,"children":56},"br",{},[],{"type":32,"value":58},"\nDéjà pour présenter le contexte, j'ai été invité à participer avec 3 autres participants pour venir parler de ce sujet. Pour ma part c'était lié à l'article que j'avais sorti en début d'année sur \"",{"type":27,"tag":35,"props":60,"children":63},{"href":61,"rel":62},"https://eventuallycoding.com/2021/07/06/les-salaires-dans-la-tech/",[39],[64],{"type":32,"value":65},"les salaires dans la tech",{"type":32,"value":67},"\" .",{"type":27,"tag":28,"props":69,"children":70},{},[71],{"type":32,"value":72},"L'évènement étant hébergé dans un incubateur c'est finalement assez logique que l'on retrouve majoritairement des porteurs et porteuses de projets ainsi que des recruteurs et recruteuses dans l'audience.",{"type":27,"tag":28,"props":74,"children":75},{},[76,78,81],{"type":32,"value":77},"A la fin de la session il y a eu quelques questions qui ont été posées et que j'aimerais partager sur ce blog.",{"type":27,"tag":54,"props":79,"children":80},{},[],{"type":32,"value":82},"\nD'autant que, avec le recul, j'aurais des compléments de réponse à apporter.",{"type":27,"tag":84,"props":85,"children":87},"h2",{"id":86},"comment-faire-pour-recruter-même-si-mes-finances-sont-plus-limitées",[88],{"type":32,"value":89},"Comment faire pour recruter même si mes finances sont plus limitées ?",{"type":27,"tag":28,"props":91,"children":92},{},[93],{"type":32,"value":94},"Je venais de présenter les échelles de salaire dans le monde de la tech et la pression de plus en plus forte sur le marché. Donc pour une boîte assez jeune, cela semble mission impossible pour recruter en comparaison.",{"type":27,"tag":28,"props":96,"children":97},{},[98,100,103,105,108,110,115,117,123,125,128,130,133,135,138,140,143,145,148,150,153],{"type":32,"value":99},"Pour répondre je rappellerais que Malt (Ex Hopwork) est passé par là aussi. Nous sommes aujourd'hui presque 300 mais nous avons démarré à 3 avec des finances bien plus réduites.",{"type":27,"tag":54,"props":101,"children":102},{},[],{"type":32,"value":104},"\nEt j'ai trouvé plusieurs personnes pour qui le challenge de rejoindre un projet de 0 a été un énorme levier de motivation.",{"type":27,"tag":54,"props":106,"children":107},{},[],{"type":32,"value":109},"\nLa motivation qui pousse à rejoindre une petite startup c'est en grande partie la recherche d'autonomie. Etre le ou la première dev, celui qui créé la plateforme, qui fait les premiers choix, qui va toucher à tout, le back, le front, la base de données. Il y a plein de gens qui recherchent cela, et qui sont prêt à être payé un peu moins que le marché ou en tout cas au marché du ",{"type":27,"tag":46,"props":111,"children":112},{},[113],{"type":32,"value":114},"segment local",{"type":32,"value":116}," (",{"type":27,"tag":35,"props":118,"children":120},{"href":61,"rel":119},[39],[121],{"type":32,"value":122},"Cf le billet de blog qui parle des segments de salaire",{"type":32,"value":124},").",{"type":27,"tag":54,"props":126,"children":127},{},[],{"type":32,"value":129},"\nMais il y a un deuxième élément que je n'ai pas mentionné hier soir, ce sont les BSPCE (ou stock options si vous ne connaissez pas le premier terme).",{"type":27,"tag":54,"props":131,"children":132},{},[],{"type":32,"value":134},"\nCertes, vous pouvez pas être trop large en salaire mais vous pouvez filer un bon montant en equity (des parts de l'entreprise). Et je pense qu'il faut le faire. Alors je sais que les BSPCE ne sont pas toujours bien compris. Les devs y sont moins sensibles aussi, à l'inverse d'autres fonctions (commerce et marketing). A vous d'en parler dans les bons termes.",{"type":27,"tag":54,"props":136,"children":137},{},[],{"type":32,"value":139},"\nPour ma part j'ai toujours dit que c'était un pari et j'ai pas essayé de vendre du rêve. Pour autant il faut expliquer ce qu'on peut en attendre.",{"type":27,"tag":54,"props":141,"children":142},{},[],{"type":32,"value":144},"\nSi l'entreprise marche correctement, elle peut faire x3, x5, x10 et même bien plus pour celles qui finiront par entrer dans le cercle des licornes. C'est pas toujours concret dans la tête des gens car il y avait pas beaucoup d'exemples jusqu'à présent en France de grosses levées.",{"type":27,"tag":54,"props":146,"children":147},{},[],{"type":32,"value":149},"\nLes choses ont changé, et désormais en France vous avez des gens qui peuvent revendiquer des bonus de 500k ou 1M grâce à leurs BSPCE.",{"type":27,"tag":54,"props":151,"children":152},{},[],{"type":32,"value":154},"\nAlors ok, ca reste un pari, il y a aucune garantie que ça marche ou alors ca montera peut être pas aussi haut, \"que\" 50 ou 100k. Mais entre ça, l'autonomie et l'excitation d'un projet qui part de 0 et dans tout les cas, l'apprentissage incroyable que l'on tire de ce genre d'expérience, vous avez des arguments à faire valoir pour attirer des gens pour vous rejoindre.",{"type":27,"tag":28,"props":156,"children":157},{},[158],{"type":32,"value":159},"Et je vais également citer Christophe Bernard, qui vient de rejoindre Malt et qui était présent mardi. Il a très bien écrit un propos que je tentais de faire passer quand je parlais de faire l'inventaire de ces atouts et besoins.",{"type":27,"tag":161,"props":162,"children":163},"blockquote",{},[164,169],{"type":27,"tag":28,"props":165,"children":166},{},[167],{"type":32,"value":168},"J'ajouterais un propos sur la question \"dans quel catégorie l'entrepreneur boxe\" [...] Les sous-questions à se poser : \"le besoin de recrutement et les moyens dispo ?\" / \"est-ce que le logiciel est plus ou moins critique ?\" / \"la stratégie de développement logiciel : landing page/ setup blog versus un produit ou sass dont on vend les licences ?\". Selon les réponses à ces questions, le sens qu'on met derrière \"développeur\" diffère. On apprend aussi quel effort il faut mettre dans la culture produit (pas le même niveau d'importance dans des entreprises à vocation différente). Tous n'ont pas besoin des stars qui travaillent chez Meta [...], en revanche, ce n'est pas forcément un bon choix de construire un produit ou un sass avec deux alternants qui s'en vont faute de formation (ou de séniorité dans l'équipe pour les tirer vers le haut). On a l'air de s'éloigner du sujet, mais en fait non : quand tu sais qui tu dois recruter, tu sais la fourchette réelle de salaire (peut-être fonction de ta géographie) et tu t'alignes ou pas.",{"type":27,"tag":28,"props":170,"children":171},{},[172],{"type":32,"value":173},"Christophe",{"type":27,"tag":84,"props":175,"children":177},{"id":176},"comment-trouver-une-associée-tech-est-ce-nécessaire",[178],{"type":32,"value":179},"Comment trouver un(e) associé(e) tech ? Est ce nécessaire ?",{"type":27,"tag":28,"props":181,"children":182},{},[183],{"type":32,"value":184},"(J'ai déjà souvent entendu cette question venant d'un(e) entrepreneur avec un background marketing ou sales.)",{"type":27,"tag":28,"props":186,"children":187},{},[188],{"type":32,"value":189},"Est-ce nécessaire ?",{"type":27,"tag":28,"props":191,"children":192},{},[193,195,198,200,207,209,216,218,221],{"type":32,"value":194},"J'ai souvent entendu et je pense que c'est partiellement vrai que l'on peut démarrer sans associé(e) technique, prouver son modèle avec une app fait en nocode et une bonne dose d'inventivité.",{"type":27,"tag":54,"props":196,"children":197},{},[],{"type":32,"value":199},"\nCependant, l'absence d'associé(e) tech, va se faire sentir assez vite et ce n'est sans doute pas pour rien que vous aurez toutes les peines du monde à aller voir des investisseurs sans associé technique dans l'équipe. Cf ",{"type":27,"tag":35,"props":201,"children":204},{"href":202,"rel":203},"https://lentreprise.lexpress.fr/gestion-fiscalite/budget-financement/cinq-conseils-pour-lever-de-l-argent-plus-facilement_1518862.html",[39],[205],{"type":32,"value":206},"cet article",{"type":32,"value":208}," ou ",{"type":27,"tag":35,"props":210,"children":213},{"href":211,"rel":212},"https://business.lesechos.fr/entrepreneurs/financer-sa-creation/six-regles-d-or-a-suivre-avant-de-lever-des-fonds-311962.php",[39],[214],{"type":32,"value":215},"celui-ci",{"type":32,"value":217},".",{"type":27,"tag":54,"props":219,"children":220},{},[],{"type":32,"value":222},"\nC'est une personne qui sera cruciale ne serait- ce que pour traduire votre vision business en solutions technologiques. C'est celle qui sera capable de recruter pour vous quand ce sera nécessaire, d'évaluer et de bosser avec une agence ou des freelances si vous choisissez cette option.",{"type":27,"tag":28,"props":224,"children":225},{},[226,228,231],{"type":32,"value":227},"A partir du moment où on tombe d'accord sur le fait que c'est nécessaire, on revient sur la première question. Puisque finalement embaucher son associé technique c'est rechercher bien souvent votre premier dev (*). Et un gros levier de motivation et d'engagement long terme c'est que cette personne soit associée au capital.",{"type":27,"tag":54,"props":229,"children":230},{},[],{"type":32,"value":232},"\nComment le trouver c'est un autre sujet, et j'ai pas de réponse magique là dessus. Mais le réseautage, la participation aux meetups et conférences fait partie des pistes que je conseille souvent.",{"type":27,"tag":28,"props":234,"children":235},{},[236],{"type":27,"tag":237,"props":238,"children":239},"em",{},[240],{"type":32,"value":241},"(*) c'est un peu plus compliqué puisque la vous recherchez non seulement un bon dev mais aussi une personne qui soit un entrepreneur donc avec une sensibilité business et à l'aise avec le fait d'être très autonome.",{"type":27,"tag":84,"props":243,"children":245},{"id":244},"comment-faire-pour-recruter-quand-jai-pas-dassociés-tech",[246],{"type":32,"value":247},"Comment faire pour recruter quand j'ai pas d'associés tech",{"type":27,"tag":28,"props":249,"children":250},{},[251,253,256,258,261],{"type":32,"value":252},"C'est un peu la suite logique des premières questions. Mettons que vous ne soyez pas à l'aise pour trouver un CTO tout de suite, ou que vous préfériez temporiser pour l'instant en attendant de trouver la bonne personne. Comment vous faites pour recruter des gens alors que vous ne comprenez pas leur métier ?",{"type":27,"tag":54,"props":254,"children":255},{},[],{"type":32,"value":257},"\nEh bien clairement c'est dur et presque mission impossible de le faire seul. Faites vous accompagner. Pour ça, je vous invite à trouver dans votre réseau des personnes dont c'est le métier et qui accepteraient, moyennant rémunération, de faire passer ces entretiens avec vous. Si vous faites partie d'un incubateur, il y a forcément des personnes qui pourraient jouer ce rôle. Comme ca a été dit pendant la soirée de mardi, votre rôle c'est de vendre votre vision de la société que vous créez. Vous devez vendre votre boite comme à des investisseurs, parler des perspectives d'avenir et de comment ils vont contribuer (et en bénéficier si vous avez suivi mon conseil sur les BSPCE).",{"type":27,"tag":54,"props":259,"children":260},{},[],{"type":32,"value":262},"\nPar contre n'essayez pas de parler technique si vous n'y comprenez rien, vous allez faire peur aux gens qui pourraient penser que vous allez tenter de faire le CTO alors que vous n'avez aucune crédibilité dessus.",{"type":27,"tag":84,"props":264,"children":266},{"id":265},"je-prends-plutot-des-stagiaires-pour-faire-mon-produit-mais-je-peux-pas-bien-les-suivre-ensuite",[267],{"type":32,"value":268},"Je prends plutot des stagiaires pour faire mon produit mais je peux pas bien les suivre ensuite",{"type":27,"tag":28,"props":270,"children":271},{},[272,274,277,279,282,284,287],{"type":32,"value":273},"Franchement là dessus, je sais qu'on peut avoir plein d'approches différentes pour réussir une boite. Mais cette approche fait partie de celles auxquels je ne crois pas du tout. Je ne crois pas, si votre société repose sur un produit qu'il faut développer, que la solution \"stagiaires\" soit une bonne idée.",{"type":27,"tag":54,"props":275,"children":276},{},[],{"type":32,"value":278},"\nAlors je ne dis pas, si la tech chez vous c'est uniquement le fait d'avoir un site wordpress et une boutique en ligne, un stagiaire ca marche très bien. Mais à partir du moment ou il y a quelque chose à développer, un SAAS ou une application complexe un peu conséquente, c'est rarement une bonne idée de commencer comme ça.",{"type":27,"tag":54,"props":280,"children":281},{},[],{"type":32,"value":283},"\nOk, il existe, dans des cas hyper rares, des exemples de stagiaires très doué(e) ET qui comprendront votre business. Mais c'est tellement rare que dans 99.9% des cas vous allez surtout faire de l'encadrement technique, que vous ne savez pas faire.",{"type":27,"tag":54,"props":285,"children":286},{},[],{"type":32,"value":288},"\nVous devez trouver un associé technique ou au moins un premier dev expérimenté (qui deviendra peut être votre associé technique plus tard) même si vous externalisez une partie, même si vous faites du nocode.",{"type":27,"tag":28,"props":290,"children":291},{},[292],{"type":32,"value":293},"Voilà, c'était un billet de blog un peu différent de d'habitude. C'est toujours après le meetup qu'on se dit qu'on a oublié de parler de ceci ou cela et j'avais envie de poursuivre le sujet.",{"title":7,"searchDepth":295,"depth":295,"links":296},2,[297,298,299,300],{"id":86,"depth":295,"text":89},{"id":176,"depth":295,"text":179},{"id":244,"depth":295,"text":247},{"id":265,"depth":295,"text":268},"markdown","content:articles:2021:11:25:recrutements-et-salaires-session-de-qa.md","content","articles/2021/11/25/recrutements-et-salaires-session-de-qa.md","md",1703146548888]