[{"data":1,"prerenderedAt":184},["Reactive",2],{"/articles/2023/12/challenge-accepted":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"tags":11,"date":13,"cover":14,"language":15,"readingTime":16,"body":21,"_type":179,"_id":180,"_source":181,"_file":182,"_extension":183},"/articles/2023/12/challenge-accepted","12",false,"","Youtube ? Challenge accepted","Et si eventuallycoding se déclinait en chaine youtube ?","31",[12],"youtube","2023-12-20","challenge-accepted/youtube.jpg","fr",{"text":17,"minutes":18,"time":19,"words":20},"4 min read",3.95,237000,790,{"type":22,"children":23,"toc":176},"root",[24,32,37,42,47,53,58,63,68,73,78,89,94,128,133,138,143,148,162,167],{"type":25,"tag":26,"props":27,"children":28},"element","p",{},[29],{"type":30,"value":31},"text","Je me suis demandé pas mal de fois, et si je testais des formats vidéos ?",{"type":25,"tag":26,"props":33,"children":34},{},[35],{"type":30,"value":36},"Pour tout vous dire, ça fait plus de 20 ans que je blog autour de la tech, de l’entreprenariat, ou des startups. J’ai commencé mes premiers articles sur developpez.com, puis sur hakanai.free.fr et enfin eventuallycoding.com.",{"type":25,"tag":26,"props":38,"children":39},{},[40],{"type":30,"value":41},"Pour comprendre pourquoi je fais ça, je vais vous raconter une petite anecdote.",{"type":25,"tag":26,"props":43,"children":44},{},[45],{"type":30,"value":46},"C’était pendant mes études. On devait coder un arbre binaire en C. Je n'avais pas bien compris la notion de pointeurs et je n’y arrivais pas.\nÀ l’époque, pas de forum, pas de blog, pas de youtube, rien. Mais il existait les newsgroup et pour ceux qui ont connu ça, c’était loin d’être aussi facile d’accès. Il fallait installer un programme pour collecter des flux directement depuis des serveurs de news. Je ne me rappelle pas de tout pour être franc, mais il fallait être motivé.\nEt j’ai trouvé un newsgroup qui parlait de programmation.",{"type":25,"tag":48,"props":49,"children":52},"nuxt-image",{"alt":50,"src":51},"Une magnifique interface pour accéder à des newsgroups","/images/challenge-accepted/newsgroup.png",[],{"type":25,"tag":26,"props":54,"children":55},{},[56],{"type":30,"value":57},"J’ai balancé tout mon code en mode “bon les gens, j’ai rien compris, c’est quoi qu’est faux”.\nÉvidemment, je me suis fait un peu incendier, on ne balance pas des Km de code avec une question aussi vague.",{"type":25,"tag":26,"props":59,"children":60},{},[61],{"type":30,"value":62},"Mais une personne m’a répondu. Il avait passé du temps à lire et il avait compris où je ramais. Il ne m’a pas corrigé mon programme, mais il m’a fait un super email pour m’expliquer le concept des pointeurs. Et je ne sais pas pourquoi, lui, il a réussi. Il a déclenché une petite étincelle qui m’a permis de comprendre.",{"type":25,"tag":26,"props":64,"children":65},{},[66],{"type":30,"value":67},"J’ai rencontré par la suite des tas de personnes comme lui qui partageaient leurs connaissances, sur des newsgroup mais après sur des forums, puis des blogs. Et à chaque fois, ils ont permis à des centaines, ou des milliers de petites étincelles de s’allumer chez des quidams comme moi.",{"type":25,"tag":26,"props":69,"children":70},{},[71],{"type":30,"value":72},"Et ça, ça m’a marqué. J’ai souhaité participer. J’ai compris que chaque fois qu’une personne en aidait une autre, cela pouvait créer un cercle vertueux où cette personne allait à son tour en aider une suivante.",{"type":25,"tag":26,"props":74,"children":75},{},[76],{"type":30,"value":77},"La connaissance librement diffusée en ligne est pour moi de même nature que l’open source. En y repensant, cela fait aussi partie des raisons qui m’ont poussé à aller donner quelques cours ensuite pendant 1 an à l’IUT de Montreuil.",{"type":25,"tag":26,"props":79,"children":80},{},[81,83,87],{"type":30,"value":82},"Mais on va pas se mentir, le blog aujourd’hui, ça commence à faire un peu has-been.",{"type":25,"tag":84,"props":85,"children":86},"br",{},[],{"type":30,"value":88},"\nMême l’expression “has-been” elle fait un peu has-been peut être :)",{"type":25,"tag":26,"props":90,"children":91},{},[92],{"type":30,"value":93},"En fait, je pense que je touche moins certaines personnes, notamment dans les plus jeunes générations.",{"type":25,"tag":26,"props":95,"children":96},{},[97,99,108,110,117,119,126],{"type":30,"value":98},"Attention, je continue à apprécier le format écrit. Ça dépend des sujets. Par exemple, dès que je mets des exemples de code, ou des tableaux de données, l’écrit, c’est quand même pas mal. Notamment si la personne veut recopier un extrait.\nMais sur d’autres types de contenu, par exemple sur la vulgarisation, je consomme moi-même beaucoup de vidéos youtube et j’aime tout autant.\nJ’aime beaucoup ce que fait ",{"type":25,"tag":100,"props":101,"children":105},"a",{"href":102,"rel":103},"https://www.youtube.com/@BenjaminCode",[104],"nofollow",[106],{"type":30,"value":107},"Benjamincode",{"type":30,"value":109}," par exemple, ou ",{"type":25,"tag":100,"props":111,"children":114},{"href":112,"rel":113},"https://www.youtube.com/@Micode",[104],[115],{"type":30,"value":116},"Micode",{"type":30,"value":118},", ",{"type":25,"tag":100,"props":120,"children":123},{"href":121,"rel":122},"https://www.youtube.com/@Underscore_",[104],[124],{"type":30,"value":125},"underscore_",{"type":30,"value":127}," et plein d’autres.",{"type":25,"tag":26,"props":129,"children":130},{},[131],{"type":30,"value":132},"J’ai donc envie de tester pour voir si je toucherais d’autres personnes que je ne touche pas habituellement avec mon blog.\nJe ne vous cache pas, je suis nerveux. Parce que, écrire, c’est facile. Mais montrer sa tronche, c’est une autre histoire. Et je sais que je n'aurai pas un rendu pro, sur l’image, le son ou le montage. Je me fais violence pour accepter que ce ne soit pas parfait.",{"type":25,"tag":26,"props":134,"children":135},{},[136],{"type":30,"value":137},"Une autre motivation, c'est que j’avais envie de (re)tester la création de vidéos et le montage.\nJ'ai besoin de nouveauté, je ne finis pas toujours tout, mais j’ai besoin d’essayer :) Et le montage, c’est marrant à faire. Par contre, ça prend un temps de malade.",{"type":25,"tag":26,"props":139,"children":140},{},[141],{"type":30,"value":142},"Ces vidéos, ce sera un test, je vais essayer d’apprécier le ratio effort/portée.\nSi je fais 15x plus d’effort, mais qu'à la fin ça touche 100x plus de gens, c’est gagné. Si ce n'est pas le cas, je resterai au blog. Mais, je sais qu’il faudra un peu de temps pour s’en rendre compte, ça se construit sur la durée. Ça ne se verra pas sur une ou deux vidéos donc je vais insister pendant quelques mois.",{"type":25,"tag":26,"props":144,"children":145},{},[146],{"type":30,"value":147},"Par rapport à mon blog, il va y avoir une différence. J’ai fait beaucoup d'efforts pour passer en anglais. Parce que je bosse dans une entreprise internationale avec quelque chose comme 30 nationalités différentes. Et ça me semble normal de partager en anglais, même si honnêtement, c’est plus long à faire.",{"type":25,"tag":26,"props":149,"children":150},{},[151,153,160],{"type":30,"value":152},"Par contre, pour les vidéos, je vais rester en francais. Pour un test comme celui-ci, c’est trop d’effort pour l’instant.\nEt pour ne rien vous cacher, je prédis que, de toute façon, dans quelques années, ",{"type":25,"tag":100,"props":154,"children":157},{"href":155,"rel":156},"https://twitter.com/alexcarliera/status/1733532015595753895",[104],[158],{"type":30,"value":159},"l’IA va tout changer dans ce domaine",{"type":30,"value":161},".",{"type":25,"tag":26,"props":163,"children":164},{},[165],{"type":30,"value":166},"Voilà, vous savez tout. Je vous laisse découvrir la première vidéo (déjà sorti il y a quelques semaines) :)",{"type":25,"tag":26,"props":168,"children":169},{},[170],{"type":25,"tag":100,"props":171,"children":174},{"href":172,"rel":173},"https://www.youtube.com/watch?v=su2gNQJkteg",[104],[175],{"type":30,"value":172},{"title":7,"searchDepth":177,"depth":177,"links":178},2,[],"markdown","content:articles:2023:12:challenge-accepted.md","content","articles/2023/12/challenge-accepted.md","md",1708268947569]