[{"data":1,"prerenderedAt":334},["Reactive",2],{"/articles/2011/10/06/nemrod-et-play-framework-love-story-nemrod-55":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"date":11,"categories":12,"tags":14,"img":18,"cover":19,"readingTime":20,"body":25,"_type":329,"_id":330,"_source":331,"_file":332,"_extension":333},"/articles/2011/10/06/nemrod-et-play-framework-love-story-nemrod-55","06",false,"","Nemrod et Play Framework : love story (Nemrod 5/5)","[![](/images/logo-web.png \"logo-web\")](http://eventuallycoding.com/wp-content/uploads/2011/10/logo-web.png) J’ai découvert Play Framework en version 1...","417","2011-10-06",[13],"waza",[15,16,17],"localizeyourapps","nemrod","play","logo-web.png","cover5.jpg",{"text":21,"minutes":22,"time":23,"words":24},"7 min read",6.985,419100,1397,{"type":26,"children":27,"toc":309},"root",[28,49,63,68,73,80,87,92,98,112,118,129,137,143,148,154,159,164,169,175,180,186,191,197,202,207,212,218,224,229,234,244,249,263,271,277,282,288,293,299,304],{"type":29,"tag":30,"props":31,"children":32},"element","p",{},[33,46],{"type":29,"tag":34,"props":35,"children":39},"a",{"href":36,"rel":37},"http://eventuallycoding.com/wp-content/uploads/2011/10/logo-web.png",[38],"nofollow",[40],{"type":29,"tag":41,"props":42,"children":45},"img",{"alt":7,"src":43,"title":44},"/images/logo-web.png","logo-web",[],{"type":47,"value":48},"text"," J’ai découvert Play Framework en version 1.0 (octobre 2009 si j’en crois la release notes) et j’avais tout de suite adhéré au concept. Sa productivité m’a tout de suite rappelé mes lointaines années où je faisais du PHP avec les avantages du Java en plus. Mais ça n’était encore qu’une version 1.0, pas très reconnu et avec de belles inconnues concernant son utilisation sur une application conséquente.",{"type":29,"tag":30,"props":50,"children":51},{},[52,54,61],{"type":47,"value":53},"Le temps a passé, ",{"type":29,"tag":34,"props":55,"children":58},{"href":56,"rel":57},"http://www.playframework.org/",[38],[59],{"type":47,"value":60},"Play Framework",{"type":47,"value":62}," a 2 ans d’existence, sa stack s’est étoffé de pas mal de modules et on commence à trouver des applications qui l’utilisent.",{"type":29,"tag":30,"props":64,"children":65},{},[66],{"type":47,"value":67},"Bref, si vous vous rappelez ce qui avait été dit dans les chapitres précédents, l’objectif était de développer vite, de voir rapidement une idée se matérialiser sur une page web. Il était hors de question de créer 5 fichiers java, 3 fichiers xml et je ne sais quoi encore pour avoir un résultat. On perd vite de vue l’objectif quand on met longtemps à le réaliser.",{"type":29,"tag":30,"props":69,"children":70},{},[71],{"type":47,"value":72},"Allez, maintenant dans le détail, voici ce qui nous a plus et moins plu sur Play Framework. Attention, ceci n’est pas un tutorial d’utilisation de Play Framework mais uniquement un retour d’expérience.",{"type":29,"tag":74,"props":75,"children":77},"h2",{"id":76},"ce-quon-a-aimé",[78],{"type":47,"value":79},"Ce qu'on a aimé",{"type":29,"tag":81,"props":82,"children":84},"h3",{"id":83},"la-compilation-à-chaud",[85],{"type":47,"value":86},"La compilation à chaud",{"type":29,"tag":30,"props":88,"children":89},{},[90],{"type":47,"value":91},"Sans doute l’un des points les plus importants. Je ne vais pas le détailler c’est sans doute celui que tout le monde connaît. Une modif dans le code, pas de relance de serveur, un F5 sur la page et tout est recompilé. Encore plus puissant que PHP si vous avez activé le mode update de JPA puisque vous n’avez même pas à faire vos ALTER en base de données. Au pire, même si vous relancez le serveur si par exemple la sémantique de vos données à changé, on est loin du temps de redémarrage d’un serveur “classique”, 10 secondes sur mon poste.",{"type":29,"tag":81,"props":93,"children":95},{"id":94},"les-intercepteurs",[96],{"type":47,"value":97},"Les intercepteurs",{"type":29,"tag":30,"props":99,"children":100},{},[101,103,110],{"type":47,"value":102},"Play Framework utilise (certains disent “abuse”) de la programmation par aspect. Pour les actions écrites dans les contrôleurs, vous pouvez donc définir des comportements via les intercepteurs : @After, @Before, @Catch, @Finally Et vous pouvez écrire vos propres intercepteurs avec @With. Tout le module de sécurité de ",{"type":29,"tag":34,"props":104,"children":107},{"href":105,"rel":106},"http://www.localizeyourapps.com",[38],[108],{"type":47,"value":109},"Localizeyourapps",{"type":47,"value":111}," utilise une extension du module Secure qui fonctionne sur ce principe.",{"type":29,"tag":81,"props":113,"children":115},{"id":114},"les-redirections",[116],{"type":47,"value":117},"Les redirections",{"type":29,"tag":30,"props":119,"children":120},{},[121,123],{"type":47,"value":122},"Vous avez déjà fait du Struts ? Vous vous rappelez du fichier qui définit toute la navigation et des ActionForward ? La même chose avec Play Framework : ",{"type":29,"tag":124,"props":125,"children":126},"code",{"className":7},[127],{"type":47,"value":128},"public static void show(Long id) { Client client = Client.findById(id); render(client); }",{"type":29,"tag":30,"props":130,"children":131},{},[132],{"type":29,"tag":124,"props":133,"children":134},{"className":7},[135],{"type":47,"value":136},"public static void create(String name) { Client client = new Client(name); client.save(); // On redirige vers la page qui montre le client juste en appelant la méthode du contrôleur ! show(client.id); }",{"type":29,"tag":81,"props":138,"children":140},{"id":139},"les-validateurs",[141],{"type":47,"value":142},"Les validateurs",{"type":29,"tag":30,"props":144,"children":145},{},[146],{"type":47,"value":147},"Par défaut l’API est déjà très sympa pour valider les formulaires. Vous rajoutez à cela les validateurs custom et le module Jquery Validation et vous avez un framework très puissant pour la gestion de vos formulaires.",{"type":29,"tag":81,"props":149,"children":151},{"id":150},"les-jobs",[152],{"type":47,"value":153},"Les jobs",{"type":29,"tag":30,"props":155,"children":156},{},[157],{"type":47,"value":158},"Lancer un job toutes les heures, facile, une petite annotation et le tour est joué :",{"type":29,"tag":30,"props":160,"children":161},{},[162],{"type":47,"value":163},"@Every(\"1h\")",{"type":29,"tag":30,"props":165,"children":166},{},[167],{"type":47,"value":168},"Les jobs sont utilisés dans Nemrod pour la purge des fichiers d’import et le chargement d’un jeu de données initial à l’import.",{"type":29,"tag":81,"props":170,"children":172},{"id":171},"lintégration",[173],{"type":47,"value":174},"L’intégration",{"type":29,"tag":30,"props":176,"children":177},{},[178],{"type":47,"value":179},"Je parlais des jobs Quartz juste au dessus. Mais finalement l’énorme force de Play Framework c’est l’intégration des outils. Que ce soit Quartz ou JPA. tout est intégré avec une configuration minimale et pas de prise de tête. Pour peu que vous vouliez utiliser d’autres frameworks comme CAMEL, AMQP etc..., il y a des modules pour ça.",{"type":29,"tag":81,"props":181,"children":183},{"id":182},"lempreinte-mémoire",[184],{"type":47,"value":185},"L’empreinte mémoire",{"type":29,"tag":30,"props":187,"children":188},{},[189],{"type":47,"value":190},"Vous savez combien Nemrod utilise de mémoire sur l’instance live ? 64Mo de ram ! Et il y a clairement de la marge, aucun tuning n’a été fait pour l’instant. Vous en aviez marre des 1Go de lancement de vos serveurs d’applis traditionnels, Play est fait pour vous.",{"type":29,"tag":81,"props":192,"children":194},{"id":193},"le-déploiement-sur-playapps",[195],{"type":47,"value":196},"Le déploiement sur playapps",{"type":29,"tag":30,"props":198,"children":199},{},[200],{"type":47,"value":201},"Nemrod est déployé sur playapps. Et pour cela, on utilise un module Playapps qui permet de réaliser l’install en moins de 5 minutes. D’ailleurs je compte proposer quelques patchs pour l’utilisation du module en mode non interactif histoire de pouvoir l’automatiser sur Jenkins. Pour info, si vous êtes sur Stax, Cloudbees ou Heroku, il y a aussi des modules pour vous.",{"type":29,"tag":30,"props":203,"children":204},{},[205],{"type":47,"value":206},"Bon, après je ne vais pas non plus m’étendre mais l’architecture en général d’une appli Play a vraiment de quoi plaire, du Stateless, des url faciles à réécrire etc...",{"type":29,"tag":30,"props":208,"children":209},{},[210],{"type":47,"value":211},"Bon, mais si voyait maintenant les points un peu moins bons",{"type":29,"tag":74,"props":213,"children":215},{"id":214},"ce-quon-a-moins-aimé",[216],{"type":47,"value":217},"Ce qu'on a moins aimé",{"type":29,"tag":81,"props":219,"children":221},{"id":220},"les-tests",[222],{"type":47,"value":223},"Les tests",{"type":29,"tag":30,"props":225,"children":226},{},[227],{"type":47,"value":228},"Je vais peut être surprendre quelques personnes mais oui, les tests nous ont posé problème avec Play. Déjà pour utiliser play auto-test, il faut que chaque test étendent UnitTest. Sauf que étendre UnitTest ca implique un démarrage du serveur Play pour chaque test. Et ça, c’est plutôt coûteux. Grosso modo nous avons environ 2s par classe de tests. Multipliez ça par une 30aine de tests et vous obtenez rapidement un temps qui frôle la minute. Imaginez ça sur des suites de tests plus importantes, ça peut être assez gênant.",{"type":29,"tag":30,"props":230,"children":231},{},[232],{"type":47,"value":233},"Toujours sur les tests, il n’est pas si simple de tester un contrôleur.",{"type":29,"tag":235,"props":236,"children":237},"ul",{},[238],{"type":29,"tag":239,"props":240,"children":241},"li",{},[242],{"type":47,"value":243},"Soit on fait du FunctionalTest mais il est difficile d'enchaîner plusieurs actions après une page authentifié. J’ai pas trouvé d’exemples là-dessus et je n’ai pas réussi pour l’instant.",{"type":29,"tag":30,"props":245,"children":246},{},[247],{"type":47,"value":248},"C’est dommage, sachant que chaque action correspondant à une méthode d’un contrôleur, de ne pas pouvoir tester un contrôleur de façon plus simple.",{"type":29,"tag":30,"props":250,"children":251},{},[252,254,261],{"type":47,"value":253},"Il y a un module qui tente d’apporter des solutions : ",{"type":29,"tag":34,"props":255,"children":258},{"href":256,"rel":257},"https://github.com/GuyMograbi/play%5C_test%5C_module",[38],[259],{"type":47,"value":260},"https://github.com/GuyMograbi/play\\_test\\_module",{"type":47,"value":262}," Mais devoir créer un contrôleur de test par contrôleur et surcharger chaque méthode ne me plaît pas des masses.",{"type":29,"tag":235,"props":264,"children":265},{},[266],{"type":29,"tag":239,"props":267,"children":268},{},[269],{"type":47,"value":270},"Soit on fait du selenium. Mais je ne suis pas un grand fan du selenium à outrance. C’est souvent lourd à maintenir, surtout quand l’appli évolue vite côté IHM comme c’est le cas de Nemrod. Et je n’ai pas encore vu comment ajouter ces propres librairies de méthodes dans les tags selenium qui sont compris par Play. A la limite ça permettrait de factoriser quelques actions.",{"type":29,"tag":81,"props":272,"children":274},{"id":273},"le-build",[275],{"type":47,"value":276},"Le build",{"type":29,"tag":30,"props":278,"children":279},{},[280],{"type":47,"value":281},"Autre point qui me chagrine c’est le build. Ok je suis super habitué à Maven et j’aime bien pouvoir choisir les plugins que j'exécute en fonction des profiles. J’aime bien séparer mes tests unitaires de mes tests d’intégration ou de mes tests de performance. La c’est plus dur. J’ai un goal auto-test pour lancer tout les types de tests sans distinctions. Si je déclare un plugin cobertura il s’execute tout le temps, même quand je fais tourner le site en DEV. Quand je déclare une dépendance elle est toujours incluse, il n’y a pas de notions de scope de test par exemple. Bref, il manque un peu de maturité et sans doute quelques modules pour avoir plus de souplesse sur le build.",{"type":29,"tag":81,"props":283,"children":285},{"id":284},"les-templates",[286],{"type":47,"value":287},"Les templates",{"type":29,"tag":30,"props":289,"children":290},{},[291],{"type":47,"value":292},"Sur le principe, les templates dans Play sont vraiment sympa. Les tags sont facile à créer, il y a pas de cycle de vie méga complexe à comprendre pour créer une page etc... Mais en pratique, il y a quand même des petits trucs rapidement fatiguants. Premièrement la courbe d’apprentissage est relativement élevé. Heureusement qu’ils ont rajouté une cheatsheet récemment parce que sinon c’est pas inné de connaître tout les signes cryptiques utilisable dans un template. Mais bon, on va dire que c’est un mauvais moment à passer. Par contre le fait de ne pas avoir d’auto complétion ou de vérification syntaxique dans mon IDE ça c’est dur. Même une fois qu’on commence à comprendre les templates on n’est jamais à l’abri d’une faute découverte à l'exécution. Sur ce sujet, il semble que Play 2.0 va bientôt intégrer Japid et que ce dernier peut être utilisé avec un plugin Eclipse. Ok, ça c’est une bonne chose. Même si la lecture de la doc du plugin Japid m’a un peu donné mal à la tête ^^ Vive les notations $ ~ { % ! Je prévois quand même d’y passer, ne serait-ce que pour les perfs qui sont annoncées bien meilleures qu’avec les templates Groovy.",{"type":29,"tag":81,"props":294,"children":296},{"id":295},"jpa",[297],{"type":47,"value":298},"JPA",{"type":29,"tag":30,"props":300,"children":301},{},[302],{"type":47,"value":303},"Allez, soyons honnête, ça n’a rien à voir avec Play mais JPA commence à me sortir par les yeux. Ça fait quelques temps que j’utilise Hibernate et JPA maintenant et c’est vraiment “pourquoi faire simple quand on peut faire compliqué”. Malheureusement comme je souhaite que Nemrod soit multi base de données, c’est un passage obligé. Et donc mon seul reproche de Play sur ce coup là c’est que ce soit tellement simple d’utiliser JPA ^^ Ben oui, pour le coup comme c’est simple et que les modifs de schéma sont faites sans relancer le serveur ça en devient presque magique. Et puis un jour on se réveille avec 4000 requêtes joués par page, des transactions super longues qui bloquent la base et des performances en berne.",{"type":29,"tag":30,"props":305,"children":306},{},[307],{"type":47,"value":308},"Au final, Play c’est quand même le productivity killer, le retour aux sources pour les développement web. Il manque quelques petits trucs et j’attends de découvrir la version 2.0 avec impatience pour voir l’évolution prise.",{"title":7,"searchDepth":310,"depth":310,"links":311},2,[312,323],{"id":76,"depth":310,"text":79,"children":313},[314,316,317,318,319,320,321,322],{"id":83,"depth":315,"text":86},3,{"id":94,"depth":315,"text":97},{"id":114,"depth":315,"text":117},{"id":139,"depth":315,"text":142},{"id":150,"depth":315,"text":153},{"id":171,"depth":315,"text":174},{"id":182,"depth":315,"text":185},{"id":193,"depth":315,"text":196},{"id":214,"depth":310,"text":217,"children":324},[325,326,327,328],{"id":220,"depth":315,"text":223},{"id":273,"depth":315,"text":276},{"id":284,"depth":315,"text":287},{"id":295,"depth":315,"text":298},"markdown","content:articles:2011:10:06:nemrod-et-play-framework-love-story-nemrod-55.md","content","articles/2011/10/06/nemrod-et-play-framework-love-story-nemrod-55.md","md",1699796134252]