[{"data":1,"prerenderedAt":861},["Reactive",2],{"/articles/2023/01/migration-to-nuxt":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"date":11,"tags":12,"cover":17,"readingTime":18,"body":23,"_type":856,"_id":857,"_source":858,"_file":859,"_extension":860},"/articles/2023/01/migration-to-nuxt","01",false,"","Le projet Singapore : Migration vers Nuxt","Dans ce billet, je souhaite vous présenter le projet Singapore, qui vise à simplifier et moderniser toute notre stack frontend en utilisant Nuxt.  ","10","2023-01-10",[13,14,15,16],"rewrite","refactoring","malt","nuxt","singapore.jpg",{"text":19,"minutes":20,"time":21,"words":22},"14 min read",13.615,816900,2723,{"type":24,"children":25,"toc":845},"root",[26,43,66,71,78,83,112,117,137,142,155,160,165,178,184,194,199,204,237,242,247,252,265,270,275,280,293,299,304,309,322,331,336,355,360,370,375,380,385,391,396,401,424,429,434,440,445,450,455,460,465,470,479,484,527,535,540,563,593,598,616,621,627,632,650,655,660,665,671,676,681,712,718,723,728,743,748,777,782,792,797,810,820,825,840],{"type":27,"tag":28,"props":29,"children":30},"element","p",{},[31,41],{"type":27,"tag":32,"props":33,"children":37},"a",{"href":34,"rel":35},"https://eventuallycoding.com/2023/01/faut-il-reecrire-de-zero",[36],"nofollow",[38],{"type":39,"value":40},"text","Dans un précédent billet",{"type":39,"value":42},", j'évoquais des chantiers de simplification engagés en 2022.",{"type":27,"tag":28,"props":44,"children":45},{},[46,48,55,57,64],{"type":39,"value":47},"J'espère que nous aurons l'occasion d'aborder plusieurs de ces chantiers sur ce blog ",{"type":27,"tag":32,"props":49,"children":52},{"href":50,"rel":51},"https://blog.malt.engineering/",[36],[53],{"type":39,"value":54},"et celui de Malt",{"type":39,"value":56},".\nEntre temps, dans ce billet, je souhaite vous présenter l'un de ces projets dont l'objectif est de moderniser toute notre technologie frontend en utilisant ",{"type":27,"tag":32,"props":58,"children":61},{"href":59,"rel":60},"https://nuxt.com/",[36],[62],{"type":39,"value":63},"Nuxt",{"type":39,"value":65},".",{"type":27,"tag":28,"props":67,"children":68},{},[69],{"type":39,"value":70},"J'espère vous donner un aperçu de notre méthodologie, comment nous en sommes arrivés à prendre cette décision et comment nous l'avons mis en œuvre.",{"type":27,"tag":72,"props":73,"children":75},"h2",{"id":74},"contexte",[76],{"type":39,"value":77},"Contexte",{"type":27,"tag":28,"props":79,"children":80},{},[81],{"type":39,"value":82},"Pour bien comprendre d'abord de quoi on parle, voici quelques chiffres importants début 2022 :",{"type":27,"tag":84,"props":85,"children":86},"ul",{},[87,93,98],{"type":27,"tag":88,"props":89,"children":90},"li",{},[91],{"type":39,"value":92},"l'équipe d'ingénierie est proche de 100 développeurs",{"type":27,"tag":88,"props":94,"children":95},{},[96],{"type":39,"value":97},"la taille de la base de code des applications front avoisine 1M de ligne(j'exclus toutes les libs communes, apis, services et applis qui ne font que du back)",{"type":27,"tag":88,"props":99,"children":100},{},[101,103,110],{"type":39,"value":102},"la taille totale de la base de code approche les 2.4M de lignes de code (",{"type":27,"tag":32,"props":104,"children":107},{"href":105,"rel":106},"https://www.informationisbeautiful.net/visualizations/million-lines-of-code/",[36],[108],{"type":39,"value":109},"et voici une infographie pour vous donner une base de comparaison",{"type":39,"value":111},")",{"type":27,"tag":28,"props":113,"children":114},{},[115],{"type":39,"value":116},"Le risque à cette taille, c'est la complexification et l'intrication.",{"type":27,"tag":28,"props":118,"children":119},{},[120,122,129,131,135],{"type":39,"value":121},"Il y a quelque temps déjà nous avons construit une équipe plateforme dont l'objectif est de créer un produit à l'intérieur du produit, à destination des autres équipes.\nDans la littérature, vous entendrez souvent parler de ",{"type":27,"tag":32,"props":123,"children":126},{"href":124,"rel":125},"https://tomgeraghty.co.uk/index.php/platform-as-a-product/",[36],[127],{"type":39,"value":128},"\"platform as a product\"",{"type":39,"value":130}," car le travail d'une telle équipe est de concevoir la plateforme comme on construirait un produit externe. On utilisera des phases d'exploration (discovery) incluant des interviews utilisateurs et un usage intensif des données.",{"type":27,"tag":132,"props":133,"children":134},"br",{},[],{"type":39,"value":136},"\nBref, du quantitatif et du qualitatif. L'idée étant d'être très concret et pragmatique pour éviter l'effet \"architectes en tour d'ivoire\" qui peut encore exister ici et là.",{"type":27,"tag":28,"props":138,"children":139},{},[140],{"type":39,"value":141},"Leur travail englobe des sujets divers :",{"type":27,"tag":84,"props":143,"children":144},{},[145,150],{"type":27,"tag":88,"props":146,"children":147},{},[148],{"type":39,"value":149},"l'expérience développeur (DX ou developer experience si vous avez l'habitude des articles de blogs anglais sur le sujet)",{"type":27,"tag":88,"props":151,"children":152},{},[153],{"type":39,"value":154},"les services partagés, techniques comme les logs, le monitoring, mais aussi fonctionnels comme certaines apis, SSO, api gateway etc...",{"type":27,"tag":28,"props":156,"children":157},{},[158],{"type":39,"value":159},"Pour cette équipe, la simplification doit être l'un de ces enjeux principaux. Ce qui est simple s'explique bien et s'utilise bien.\nElle doit prendre en compte la conduite de changement, il ne suffit pas d'améliorer la plateforme, il faut accompagner les utilisateurs. Ca peut être via de la formation, de la documentation, l'usage de standards et j'en passe.",{"type":27,"tag":28,"props":161,"children":162},{},[163],{"type":39,"value":164},"Je parlais de quantitatif plus haut, c'est important pour rationaliser le travail. Nous souhaitons avoir systématiquement des critères chiffrés pour entamer un projet. Faire de la technique pour de la technique n'a aucun sens. Il faut mettre en évidence pourquoi on le fait et fixer un objectif d'amélioration.\nSans chiffres, il n'y a pas d'objectifs.\nSans objectifs, on ne peut rien prioriser et il n'y a pas d'alignement.",{"type":27,"tag":28,"props":166,"children":167},{},[168,170,176],{"type":39,"value":169},"Voici pour la mise en contexte, maintenant abordons les origines du projet \"",{"type":27,"tag":171,"props":172,"children":173},"strong",{},[174],{"type":39,"value":175},"Singapore",{"type":39,"value":177},"\", justement démarré dans le cadre de cette équipe.",{"type":27,"tag":72,"props":179,"children":181},{"id":180},"lorigine-du-projet",[182],{"type":39,"value":183},"L'origine du projet",{"type":27,"tag":28,"props":185,"children":186},{},[187,189,192],{"type":39,"value":188},"Avec le temps, la charge cognitive de chaque développeur est devenue importante au vu de la taille de la base de code. Les choix technologiques de ces 10 dernières années sont pour certains encore très pertinents, mais pour d'autres, c'est moins évident, pour rester poli :)",{"type":27,"tag":132,"props":190,"children":191},{},[],{"type":39,"value":193},"\nEt c'est justement le cas pour les technologies front-end que nous utilisons.",{"type":27,"tag":28,"props":195,"children":196},{},[197],{"type":39,"value":198},"Sur le début d'année 2022 nous faisons le constat suivant.",{"type":27,"tag":28,"props":200,"children":201},{},[202],{"type":39,"value":203},"6 technologies différentes sont utilisés côté front-end :",{"type":27,"tag":84,"props":205,"children":206},{},[207,212,217,222,227,232],{"type":27,"tag":88,"props":208,"children":209},{},[210],{"type":39,"value":211},"JSP, le moteur de templating Java par défaut",{"type":27,"tag":88,"props":213,"children":214},{},[215],{"type":39,"value":216},"AngularJS pour une page du site (je l'ai redécouvert au moment de l'écriture de ce billet)",{"type":27,"tag":88,"props":218,"children":219},{},[220],{"type":39,"value":221},"Vue.js (2 avec une migration en cours vers la 3), essentiellement pour des parties où l'utilisateur est connecté ou bien pour des applications internes",{"type":27,"tag":88,"props":223,"children":224},{},[225],{"type":39,"value":226},"des modules Javascript maison, appelé hopmodule, utilisé principalement dans les JSP",{"type":27,"tag":88,"props":228,"children":229},{},[230],{"type":39,"value":231},"Des templates Handlebars sont partagés entre backend et frontend pour certaines pages qui nécessitent d'être rendu côté serveur puis ensuite rendu dynamique côté client",{"type":27,"tag":88,"props":233,"children":234},{},[235],{"type":39,"value":236},"Nuxt 2 pour une application (parmi une vingtaine)",{"type":27,"tag":28,"props":238,"children":239},{},[240],{"type":39,"value":241},"Pour comprendre, en 2012 nous avions fait le choix des JSP pour faire du rendu côté serveur (SSR pour server side rendering) afin d'être compris par les moteurs d'indexation (Google, Bing) et donc avoir un bon SEO.\nPlus tard nous avons introduit des frameworks comme AngularJS, remplacé par la suite par Vue.js afin de rendre dynamique des portions de la page après chargement.\nEnfin nous avons totalement utilisé Vue.js pour des applications complètes (SPA pour Single page application).",{"type":27,"tag":28,"props":243,"children":244},{},[245],{"type":39,"value":246},"Tout ceci implique qu'il y a beaucoup à savoir quand on développe côté front, notamment parce qu'il a fallu répondre plusieurs fois aux mêmes enjeux, pour chaque technologie.",{"type":27,"tag":28,"props":248,"children":249},{},[250],{"type":39,"value":251},"Si je prends un exemple, sur notre portail de documentation développeur :",{"type":27,"tag":84,"props":253,"children":254},{},[255,260],{"type":27,"tag":88,"props":256,"children":257},{},[258],{"type":39,"value":259},"pour l'échappement de caractères, nous détaillons plus d'une demi-douzaine de façons de faire (avec JSP, avec la taglib spring-message, avec les attributs data-js utilisé par nos micro modules, etc...)",{"type":27,"tag":88,"props":261,"children":262},{},[263],{"type":39,"value":264},"pour l'internationalisation, rebelote, nous détaillons là encore plus d'une demi-douzaine de façons d'internationaliser les pages",{"type":27,"tag":28,"props":266,"children":267},{},[268],{"type":39,"value":269},"Autre chose à savoir, la plupart du code source des applications front est inclus dans le code source des applications backs dans des répertoires src/main/front et c'est le rôle de l'usine logicielle de séparer les artefacts au moment du build.\nMais les développeurs eux doivent tout charger dans leur IDE (intellij pour beaucoup d'entre nous).\nOr avec le volume de code et l'ensemble des plugins nécessaires pour comprendre toutes les technologies, intellij souffre beaucoup. Et quand je dis beaucoup....",{"type":27,"tag":28,"props":271,"children":272},{},[273],{"type":39,"value":274},"Au quotidien, lorsque l'on travaille sur le front-end des applications, il y a également de l'outillage qui tourne en permanence, par exemple pour faire des copies de fichiers ayant été modifiés (des JSP présentes dans une librairie commune) vers le répertoire où tourne l'application en cours de travail.",{"type":27,"tag":28,"props":276,"children":277},{},[278],{"type":39,"value":279},"Je passe sur de nombreux autres détails, mais ce qu'il faut retenir :",{"type":27,"tag":84,"props":281,"children":282},{},[283,288],{"type":27,"tag":88,"props":284,"children":285},{},[286],{"type":39,"value":287},"les outils pour travailler sont nombreux, ce qui rend parfois compliqué les fois où cela ne se passe pas bien. Il faut souvent plusieurs personnes pour débloquer une personne rencontrant un problème",{"type":27,"tag":88,"props":289,"children":290},{},[291],{"type":39,"value":292},"la charge sur la machine est importante, ce qui rend nécessaire d'avoir des machines de courses pour travailler. Et même comme cela, l'expérience n'est pas toujours fluide.",{"type":27,"tag":72,"props":294,"children":296},{"id":295},"la-question-à-1m-de-dollars",[297],{"type":39,"value":298},"La question à 1M de dollars",{"type":27,"tag":28,"props":300,"children":301},{},[302],{"type":39,"value":303},"A ce moment-là, j'aime bien me poser une question simple :",{"type":27,"tag":28,"props":305,"children":306},{},[307],{"type":39,"value":308},"\"Quels seraient mes choix si nous devions créer Malt en partant d'une feuille blanche en 2022 ? Est-ce que nous pourrions faire beaucoup mieux ?\"",{"type":27,"tag":28,"props":310,"children":311},{},[312,314,321],{"type":39,"value":313},"En parallèle de cette question, j'ai eu plusieurs expériences positives avec des stack ",{"type":27,"tag":32,"props":315,"children":318},{"href":316,"rel":317},"https://jamstack.org/",[36],[319],{"type":39,"value":320},"jamstack",{"type":39,"value":65},{"type":27,"tag":323,"props":324,"children":325},"tip",{},[326],{"type":27,"tag":28,"props":327,"children":328},{},[329],{"type":39,"value":330},"Jamstack is an architectural approach that decouples the web experience layer from data and business logic, improving flexibility, scalability, performance, and maintainability.",{"type":27,"tag":28,"props":332,"children":333},{},[334],{"type":39,"value":335},"J'ai pu tester avec succès :",{"type":27,"tag":84,"props":337,"children":338},{},[339,350],{"type":27,"tag":88,"props":340,"children":341},{},[342,344],{"type":39,"value":343},"gridsome pour le site ",{"type":27,"tag":32,"props":345,"children":348},{"href":346,"rel":347},"https://www.malt.engineering/",[36],[349],{"type":39,"value":346},{"type":27,"tag":88,"props":351,"children":352},{},[353],{"type":39,"value":354},"Nuxt et nuxt-content pour mon blog personnel.",{"type":27,"tag":28,"props":356,"children":357},{},[358],{"type":39,"value":359},"La réponse à la question ci-dessus semble évidente, en 2022 l'approche standard la plus efficace serait sans doute d'utiliser une approche Jamstack.",{"type":27,"tag":28,"props":361,"children":362},{},[363,365,368],{"type":39,"value":364},"D'autant que, ici on parle de front, mais cela change aussi le développement côté back. On passe sur un paradigme orienté API. On ne construit plus des vues métiers car la logique de présentation est désormais déporté. On pense en termes de contrats d'API et cela peut faciliter le travail de notre équipe mobile qui n'aura plus autant besoin de développement adhoc.",{"type":27,"tag":132,"props":366,"children":367},{},[],{"type":39,"value":369},"\nCela ouvre aussi d'autres horizons comme le fait d'ouvrir nos APIs en externes.",{"type":27,"tag":28,"props":371,"children":372},{},[373],{"type":39,"value":374},"Pour rendre à César ce qui appartient à César, cette piste avait déjà été envisagée en 2018 par Mickael J. On imaginait à ce moment-là une solution utilisant Nuxt afin de faire du Server side rendering et donc de répondre aux contraintes SEO.\nNous n'étions pas encore prêt à investir autant dans ce changement. Nous n'avions peut-être pas non plus la maturité nécessaire. Toujours est-il que nous n'avons pas entamé ce chantier.",{"type":27,"tag":28,"props":376,"children":377},{},[378],{"type":39,"value":379},"En 2022 notre complexité front a cependant augmenté et nous devons simplifier \"l'expérience développeur\" au risque d'avoir de grosses déconvenues très prochainement autrement.\nA cette étape, il ne s'agissait encore que d'une intuition. Il était devenu nécessaire d'étudier la faisabilité de ce chantier et de se fixer des objectifs chiffrés sur le résultat.",{"type":27,"tag":28,"props":381,"children":382},{},[383],{"type":39,"value":384},"Nous déciderons d'appeler le projet \"Singapore\" qui représente symboliquement le départ de l'île de Java (les JSP) vers le pays le plus proche du continent Asiatique.",{"type":27,"tag":72,"props":386,"children":388},{"id":387},"présentation-de-nuxt",[389],{"type":39,"value":390},"Présentation de nuxt",{"type":27,"tag":28,"props":392,"children":393},{},[394],{"type":39,"value":395},"En quelques mots, qu'est-ce que Nuxt ?\nC'est un meta framework, c'est-à-dire que c'est un framework au-dessus d'un autre framework : vue.js",{"type":27,"tag":28,"props":397,"children":398},{},[399],{"type":39,"value":400},"Il apporte notamment la possibilité d'utiliser plusieurs modes de rendus :",{"type":27,"tag":84,"props":402,"children":403},{},[404,409,414,419],{"type":27,"tag":88,"props":405,"children":406},{},[407],{"type":39,"value":408},"Client side rendering (pas vraiment besoin de Nuxt dans ce cas là, vous pourriez faire pareil avec Vue.js tout seul)",{"type":27,"tag":88,"props":410,"children":411},{},[412],{"type":39,"value":413},"Server side rendering (pour envoyer le contenu complet déjà rempli au navigateur, remplissant ainsi les contraintes SEO)",{"type":27,"tag":88,"props":415,"children":416},{},[417],{"type":39,"value":418},"Universal rendering (le premier appel fait du SSR, ensuite l'application est chargée et tout se fait en client side rendering)",{"type":27,"tag":88,"props":420,"children":421},{},[422],{"type":39,"value":423},"de la génération statique",{"type":27,"tag":28,"props":425,"children":426},{},[427],{"type":39,"value":428},"Et pourquoi Nuxt ?\nLa question aurait pu se poser avec Next.js qui a le même objectif dans l'écosystème React. Next est plus ancien, semble plus mature et bénéficie d'une communauté très large.",{"type":27,"tag":28,"props":430,"children":431},{},[432],{"type":39,"value":433},"Mais nous sommes très à l'aise avec Vue.js, framework que nous utilisons depuis maintenant plusieurs années.\nEt dans l'écosystème vue.js, c'est Nuxt qui nous a semblé le plus mature.",{"type":27,"tag":72,"props":435,"children":437},{"id":436},"etude-préalable",[438],{"type":39,"value":439},"Etude préalable",{"type":27,"tag":28,"props":441,"children":442},{},[443],{"type":39,"value":444},"Après avoir initié la réflexion, je me suis lancé sur l'étude préalable en juillet/août 2022.",{"type":27,"tag":28,"props":446,"children":447},{},[448],{"type":39,"value":449},"L'objectif de l'étude était de vérifier que nous pouvions reproduire l'ensemble de nos applications front actuelles. Il fallait par exemple valider toutes nos spécificités sur l'internationalisation (la gestion des formes plurielles avec ICU), la sécurité (les taglibs spring security), le feature flipping (avec ff4j) etc...",{"type":27,"tag":28,"props":451,"children":452},{},[453],{"type":39,"value":454},"Le second objectif de l'étude, c'était de définir les critères de succès.",{"type":27,"tag":28,"props":456,"children":457},{},[458],{"type":39,"value":459},"Enfin, cette phase était aussi la première étape d'une opération de conduite de changement. L'aspect humain était crucial dans cette phase d'étude dans le sens où elle devait impliquer et embarquer les futurs sponsors du projet.",{"type":27,"tag":28,"props":461,"children":462},{},[463],{"type":39,"value":464},"Lors de cette étape, un meeting hebdomadaire a été mis en place afin de partager l'avancement, discuter des points techniques en cours d'étude ou faire des démonstrations.\nUn support écrit et collaboratif (un google docs) a été tenu à jour pendant toute la durée de l'étude avec toutes les discussions liés aux prototypes, les comptes rendus de réunions etc...\nCe document n'est pas une ADR à proprement parler (architecture decision record) mais peut servir à en rédiger. Il a notamment servi à la rédaction de la documentation développeur par la suite.",{"type":27,"tag":28,"props":466,"children":467},{},[468],{"type":39,"value":469},"Tous les prototypes non sensibles ont été publiés en open source afin de communiquer avec l'équipe Nuxt :",{"type":27,"tag":28,"props":471,"children":472},{},[473],{"type":27,"tag":32,"props":474,"children":477},{"href":475,"rel":476},"https://gitlab.com/maltcommunity/public/singapore-prototypes",[36],[478],{"type":39,"value":475},{"type":27,"tag":28,"props":480,"children":481},{},[482],{"type":39,"value":483},"Parmi les points que nous avons abordés lors de l'étude :",{"type":27,"tag":84,"props":485,"children":486},{},[487,492,497,502,507,512,517,522],{"type":27,"tag":88,"props":488,"children":489},{},[490],{"type":39,"value":491},"la problématique de déploiement pour les apps avec et sans SSR",{"type":27,"tag":88,"props":493,"children":494},{},[495],{"type":39,"value":496},"l'authentification",{"type":27,"tag":88,"props":498,"children":499},{},[500],{"type":39,"value":501},"le partage de code entre client et serveurs",{"type":27,"tag":88,"props":503,"children":504},{},[505],{"type":39,"value":506},"i18n",{"type":27,"tag":88,"props":508,"children":509},{},[510],{"type":39,"value":511},"les modules Nuxt",{"type":27,"tag":88,"props":513,"children":514},{},[515],{"type":39,"value":516},"le SEO",{"type":27,"tag":88,"props":518,"children":519},{},[520],{"type":39,"value":521},"les taglibs spring security et spring message",{"type":27,"tag":88,"props":523,"children":524},{},[525],{"type":39,"value":526},"les micro frontends",{"type":27,"tag":323,"props":528,"children":529},{},[530],{"type":27,"tag":28,"props":531,"children":532},{},[533],{"type":39,"value":534},"Je ne rentrerais pas en détail ici sur chaque sujet sinon ce billet serait gigantesque. Mais s'il y a un intérêt particulier pour l'un de ces items, il pourrait être abordé dans un futur billet.",{"type":27,"tag":28,"props":536,"children":537},{},[538],{"type":39,"value":539},"Fin août, l'étude a permis de valider la faisabilité technique. En sus, les objectifs listés étaient les suivants :",{"type":27,"tag":84,"props":541,"children":542},{},[543,548,553,558],{"type":27,"tag":88,"props":544,"children":545},{},[546],{"type":39,"value":547},"diminution du temps de cycle",{"type":27,"tag":88,"props":549,"children":550},{},[551],{"type":39,"value":552},"diminution du temps de build",{"type":27,"tag":88,"props":554,"children":555},{},[556],{"type":39,"value":557},"découplage front et back",{"type":27,"tag":88,"props":559,"children":560},{},[561],{"type":39,"value":562},"diminution du temps de démarrage des applications",{"type":27,"tag":28,"props":564,"children":565},{},[566,568,571,573,576,578,581,583,586,588,591],{"type":39,"value":567},"Ces métriques vont cependant évoluer par la suite.",{"type":27,"tag":132,"props":569,"children":570},{},[],{"type":39,"value":572},"\nLes temps de cycle sont à ce jour mal mesurés chez nous. C'est surprenant, car c'est sans doute la métrique plus importante de toutes mais effectivement nous ne sommes pas encore assez bons pour la suivre correctement.",{"type":27,"tag":132,"props":574,"children":575},{},[],{"type":39,"value":577},"\nLa diminution du temps de build devait beaucoup être liée au fait de supprimer les dépendances entre build front et back. Ce sujet a été adressé en parallèle dans un autre chantier lié à la CI (migration de maven vers gradle).",{"type":27,"tag":132,"props":579,"children":580},{},[],{"type":39,"value":582},"\nLe temps de démarrage est intéressant, mais nous ne collectons pas la mesure sur les postes de travail.",{"type":27,"tag":132,"props":584,"children":585},{},[],{"type":39,"value":587},"\nPour ma part j'ai certaines applis qui pouvaient mettre entre 100 et 200 secondes à démarrer. Mais je n'ai aucun moyen de démontrer que ce phénomène est le même chez tout le monde, et il n'est pas vrai sur toutes les applis.",{"type":27,"tag":132,"props":589,"children":590},{},[],{"type":39,"value":592},"\nLe temps en intégration et production est, de plus, totalement différent du poste de dev (en grande partie lié à l'instrumentation datadog et le dimensionnement des pods).",{"type":27,"tag":28,"props":594,"children":595},{},[596],{"type":39,"value":597},"Sur le découplage, à l'origine, on se demande comment le mesurer. Et puis nous noterons plusieurs axes possibles :",{"type":27,"tag":84,"props":599,"children":600},{},[601,606,611],{"type":27,"tag":88,"props":602,"children":603},{},[604],{"type":39,"value":605},"le passage de 6 technologies front à une seule est déjà une métrique en soi.",{"type":27,"tag":88,"props":607,"children":608},{},[609],{"type":39,"value":610},"la suppression du volume de JSP. Cette mesure n'est cependant pas très satisfaisante puisqu'elle mesure juste un changement de techno. Elle n'apporte pas plus que la précédente.",{"type":27,"tag":88,"props":612,"children":613},{},[614],{"type":39,"value":615},"la diminution de la base de code. En effet, le passage de 6 technos à une seule va supprimer beaucoup de code en doublon. Chaque techno ayant implémenté les mêmes briques de bases pour la sécu, l'internationalisation etc...",{"type":27,"tag":28,"props":617,"children":618},{},[619],{"type":39,"value":620},"Un premier prototype grandeur nature va nous permettre d'y voir plus clair.",{"type":27,"tag":72,"props":622,"children":624},{"id":623},"un-premier-prototype",[625],{"type":39,"value":626},"Un premier prototype",{"type":27,"tag":28,"props":628,"children":629},{},[630],{"type":39,"value":631},"Sur septembre, une première application a été migrée. Les critères de choix de ce premier projet étaient :",{"type":27,"tag":84,"props":633,"children":634},{},[635,640,645],{"type":27,"tag":88,"props":636,"children":637},{},[638],{"type":39,"value":639},"de taille modeste, car une seule personne allait travailler dessus à temps plein, tout du moins au début",{"type":27,"tag":88,"props":641,"children":642},{},[643],{"type":39,"value":644},"pas visible pour l'utilisateur final, pour limiter les risques",{"type":27,"tag":88,"props":646,"children":647},{},[648],{"type":39,"value":649},"faiblement couplée avec les autres composants (pas central) pour éviter de marcher sur les plates bandes de plusieurs équipes",{"type":27,"tag":28,"props":651,"children":652},{},[653],{"type":39,"value":654},"Ce premier projet a été une SPA (sans utilisation de SSR). Il s'agit d'un back office interne, une appli relativement simple (12k lignes de code).\nCependant, cette application est intéressante, car elle utilise des JSP, des petites applications en vue2, et du javascript custom.\nElle permettait donc de démontrer la faisabilité sur de nombreux points en suspens et de valider l'architecture générale cible pour une SPA en CSR (client side rendering).",{"type":27,"tag":28,"props":656,"children":657},{},[658],{"type":39,"value":659},"La migration s'est faite en \"double run\" : Les deux applis ont coexisté avec un mécanisme de routage effectué par Traefik (notre reverse proxy).\nLa démarche de migration devait aussi valider la facon dont on pouvait basculer et revenir en arrière en cas de soucis.",{"type":27,"tag":28,"props":661,"children":662},{},[663],{"type":39,"value":664},"En cours de route, l'équipe s'est étoffée; ce qui permettra ensuite d'avancer plus rapidement pour la fin d'année.",{"type":27,"tag":72,"props":666,"children":668},{"id":667},"un-effet-de-bord-une-documentation-totalement-remaniée",[669],{"type":39,"value":670},"Un effet de bord, une documentation totalement remaniée",{"type":27,"tag":28,"props":672,"children":673},{},[674],{"type":39,"value":675},"Comme je l'indiquais plus haut, l'un des enjeux dans un projet de ce type est avant tout humain. Pour améliorer la developer experience, il ne faut pas lésiner sur l'accompagnement.",{"type":27,"tag":28,"props":677,"children":678},{},[679],{"type":39,"value":680},"Dans ce cadre, j'ai décidé de totalement revoir notre portail de documentation interne à destination des développeurs. Cela pourrait faire l'objet d'un billet à part entière, mais dans les grandes lignes voici quelques éléments importants :",{"type":27,"tag":84,"props":682,"children":683},{},[684,698],{"type":27,"tag":88,"props":685,"children":686},{},[687,689,696],{"type":39,"value":688},"On suit globalement les principes listés sur ",{"type":27,"tag":32,"props":690,"children":693},{"href":691,"rel":692},"https://documentation.divio.com/",[36],[694],{"type":39,"value":695},"ce très bon article de référence sur la gestion de la documentation",{"type":39,"value":697}," (même si on ne le connaissait pas encore à ce moment là, je vous recommande sa lecture)",{"type":27,"tag":88,"props":699,"children":700},{},[701,703,710],{"type":39,"value":702},"nous avons abandonné antora pour passer sur ",{"type":27,"tag":32,"props":704,"children":707},{"href":705,"rel":706},"https://v2.vuepress.vuejs.org/",[36],[708],{"type":39,"value":709},"vuepress",{"type":39,"value":711},", toujours dans l'optique de capitaliser sur vue.js",{"type":27,"tag":72,"props":713,"children":715},{"id":714},"les-résultats",[716],{"type":39,"value":717},"Les résultats",{"type":27,"tag":28,"props":719,"children":720},{},[721],{"type":39,"value":722},"Mi-octobre, une démo a pu être faite avec l'application porté sur Nuxt.",{"type":27,"tag":28,"props":724,"children":725},{},[726],{"type":39,"value":727},"Voici quelques résultats :",{"type":27,"tag":84,"props":729,"children":730},{},[731],{"type":27,"tag":88,"props":732,"children":733},{},[734,736,741],{"type":39,"value":735},"7,7k lignes de code. C'est une diminution de ",{"type":27,"tag":171,"props":737,"children":738},{},[739],{"type":39,"value":740},"53%",{"type":39,"value":742}," de l'application d'origine",{"type":27,"tag":28,"props":744,"children":745},{},[746],{"type":39,"value":747},"Nuxt et Vue3 permettent effectivement d'être beaucoup plus concis que l'équivalent en JSP. Les applications vue ont été simplifiées également.\nMais un autre bénéfice, et c'est l'un des intérêts des réécritures comme celle-ci, a été l'occasion de détecter les fonctionnalités obsolètes et de les supprimer.",{"type":27,"tag":84,"props":749,"children":750},{},[751,772],{"type":27,"tag":88,"props":752,"children":753},{},[754,756,763,765,770],{"type":39,"value":755},"les performances sont globalement meilleures. Tests effectués avec ",{"type":27,"tag":32,"props":757,"children":760},{"href":758,"rel":759},"https://k6.io/",[36],[761],{"type":39,"value":762},"K6",{"type":39,"value":764}," : Un P95 a 489ms avant pour 271ms après, soit ",{"type":27,"tag":171,"props":766,"children":767},{},[768],{"type":39,"value":769},"44%",{"type":39,"value":771}," d'amélioration",{"type":27,"tag":88,"props":773,"children":774},{},[775],{"type":39,"value":776},"un score lighthouse en hausse également, 86 vers 94 en performance, 72 vers 84 en accessibilité et 67 vers 83 en best practices..",{"type":27,"tag":28,"props":778,"children":779},{},[780],{"type":39,"value":781},"Concernant les progrès sur l'accessibilité, tout n'est pas lié au fait d'utiliser nuxt mais aussi à une utilisation massive du design system Malt alors que l'ancienne app l'utilisait peu.",{"type":27,"tag":28,"props":783,"children":784},{},[785,787,790],{"type":39,"value":786},"Une seconde application a été migrée entre mi-octobre et décembre, cette fois très centrale puisqu'il s'agit de la page d'accueil et de quelques pages de contenu.\nCette fois, le SSR était obligatoire.",{"type":27,"tag":132,"props":788,"children":789},{},[],{"type":39,"value":791},"\nSans rentrer dans le détail, on utilise Prismic et nuxt prismic pour créer ce contenu.",{"type":27,"tag":28,"props":793,"children":794},{},[795],{"type":39,"value":796},"Les résultats sur cette application sont les suivants :",{"type":27,"tag":84,"props":798,"children":799},{},[800,805],{"type":27,"tag":88,"props":801,"children":802},{},[803],{"type":39,"value":804},"43% de code en moins",{"type":27,"tag":88,"props":806,"children":807},{},[808],{"type":39,"value":809},"le score lighthouse est passé de 90 a 96 en perf, 89 a 95 en accessibilité et 67 a 83 en best practices.",{"type":27,"tag":28,"props":811,"children":812},{},[813,815,818],{"type":39,"value":814},"On constate donc que pour l'instant, en moyenne, on allège la base de code des applications front de plus de 40% ce qui est au-dessus de nos attentes initiales.",{"type":27,"tag":132,"props":816,"children":817},{},[],{"type":39,"value":819},"\nLe temps de démarrage s'améliore lui de 22% sur staging et prod.",{"type":27,"tag":28,"props":821,"children":822},{},[823],{"type":39,"value":824},"La surprise vient de l'amélioration des performances qui n'était pas un objectif initial. Les gains sont très forts sur la première app.\nIls existent aussi sur la seconde application mais malgré tout, le \"server response time\" reste très grand et nous devons travailler pour l'améliorer.\nCependant, pour un premier jet, c'est très satisfaisant.",{"type":27,"tag":28,"props":826,"children":827},{},[828,830,833,835,838],{"type":39,"value":829},"Pour rajouter quelques éléments, 5 personnes étaient impliquées en décembre à temps plein sur le projet.",{"type":27,"tag":132,"props":831,"children":832},{},[],{"type":39,"value":834},"\nEn janvier, 10,53% des applications a été migrées.",{"type":27,"tag":132,"props":836,"children":837},{},[],{"type":39,"value":839},"\nLe projet, reconnu comme étant stratégique, est désormais une priorité de l'ensemble de l'équipe Produit et sera mis en œuvre progressivement durant toute l'année.",{"type":27,"tag":28,"props":841,"children":842},{},[843],{"type":39,"value":844},"Et voilà qui conclura cette première étape. Ce billet pourrait faire l'objet de suite plus tard, soit pour donner un état d'avancement, soit pour aller plus en profondeur sur certains sujets techniques bien spécifiques.",{"title":7,"searchDepth":846,"depth":846,"links":847},2,[848,849,850,851,852,853,854,855],{"id":74,"depth":846,"text":77},{"id":180,"depth":846,"text":183},{"id":295,"depth":846,"text":298},{"id":387,"depth":846,"text":390},{"id":436,"depth":846,"text":439},{"id":623,"depth":846,"text":626},{"id":667,"depth":846,"text":670},{"id":714,"depth":846,"text":717},"markdown","content:articles:2023:01:migration-to-nuxt.md","content","articles/2023/01/migration-to-nuxt.md","md",1707915849915]