[{"data":1,"prerenderedAt":495},["Reactive",2],{"/articles/2021/10/20/se-tenir-a-jour-dans-une-equipe-produit":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"date":11,"categories":12,"tags":14,"cover":18,"readingTime":19,"body":24,"_type":490,"_id":491,"_source":492,"_file":493,"_extension":494},"/articles/2021/10/20/se-tenir-a-jour-dans-une-equipe-produit","20",false,"","Se tenir à jour dans une équipe produit","English version : https://medium.com/nerds-malt/stay-up-to-date-in-a-product-team-c1ffa8eca1a0\nAujourd’hui je vais aborder le sujet de l’animation de...","1844","2021-10-20",[13],"waza",[15,16,17],"formation","malt","training","Illustration_sans_titre-36-1024x371.jpg",{"text":20,"minutes":21,"time":22,"words":23},"9 min read",8.675,520500,1735,{"type":25,"children":26,"toc":478},"root",[27,43,48,53,58,78,83,90,95,100,105,113,124,129,134,139,144,149,154,159,164,170,175,180,185,192,198,203,208,213,218,223,228,233,238,243,250,256,261,266,271,276,281,286,292,297,302,307,312,317,322,327,333,338,343,348,353,358,367,373,378,383,388,394,399,404,409,414,419,425,430,435,449,453,458,463,468,473],{"type":28,"tag":29,"props":30,"children":31},"element","p",{},[32,35],{"type":33,"value":34},"text","English version : ",{"type":28,"tag":36,"props":37,"children":41},"a",{"href":38,"rel":39},"https://medium.com/nerds-malt/stay-up-to-date-in-a-product-team-c1ffa8eca1a0",[40],"nofollow",[42],{"type":33,"value":38},{"type":28,"tag":29,"props":44,"children":45},{},[46],{"type":33,"value":47},"Aujourd’hui je vais aborder le sujet de l’animation de la connaissance dans une équipe produit car cela fait partie, pour moi, des sujets très importants sur lesquels il faut s’investir.",{"type":28,"tag":29,"props":49,"children":50},{},[51],{"type":33,"value":52},"Et quand je dis qu’il faut investir, je m’adresse autant aux contributeurs individuels qui que vous soyez, qu’aux entreprises. ",{"type":28,"tag":29,"props":54,"children":55},{},[56],{"type":33,"value":57},"Quand je parle d’animation de la connaissance, je pense à différents sujets :",{"type":28,"tag":59,"props":60,"children":61},"ul",{},[62,68,73],{"type":28,"tag":63,"props":64,"children":65},"li",{},[66],{"type":33,"value":67},"la formation des individus",{"type":28,"tag":63,"props":69,"children":70},{},[71],{"type":33,"value":72},"le développement de la curiosité personnelle ",{"type":28,"tag":63,"props":74,"children":75},{},[76],{"type":33,"value":77},"la diffusion de la connaissance",{"type":28,"tag":29,"props":79,"children":80},{},[81],{"type":33,"value":82},"Je vous propose donc de voir quels sont les différents éléments mis en place dans l’équipe de Malt en 2021 si jamais ça peut vous donner des idées. Et puis peut-être, pourquoi faisons-nous cela si jamais vous vous posez la question.",{"type":28,"tag":84,"props":85,"children":87},"h2",{"id":86},"pourquoi-former-les-gens",[88],{"type":33,"value":89},"Pourquoi former les gens ?",{"type":28,"tag":29,"props":91,"children":92},{},[93],{"type":33,"value":94},"On va peut-être commencer par là parce que sinon le reste du billet n’a pas trop de sens.",{"type":28,"tag":29,"props":96,"children":97},{},[98],{"type":33,"value":99},"Pour moi la réponse est plutôt évidente, mais apparemment c’est pas le cas pour tout le monde. ",{"type":28,"tag":29,"props":101,"children":102},{},[103],{"type":33,"value":104},"Je pourrais d’abord donner une citation célèbre (même si  je ne retrouve pas qui en est l’auteur)",{"type":28,"tag":29,"props":106,"children":107},{},[108],{"type":28,"tag":109,"props":110,"children":112},"img",{"alt":7,"src":111},"/images/Illustration_sans_titre-36-1024x371.jpg",[],{"type":28,"tag":29,"props":114,"children":115},{},[116,118],{"type":33,"value":117},"“Q: ",{"type":28,"tag":119,"props":120,"children":121},"em",{},[122],{"type":33,"value":123},"What if we train them and they leave? R: What if we don’t and they stay?”",{"type":28,"tag":29,"props":125,"children":126},{},[127],{"type":33,"value":128},"Cette phrase vaut sans doute pour tous les métiers. Vous avez besoin d’une super équipe ou de rajouter des expertises dans l’équipe existante ? Une des solutions c’est de les recruter, mais l’autre c’est de les former. ",{"type":28,"tag":29,"props":130,"children":131},{},[132],{"type":33,"value":133},"Ne faites pas l’impasse sur la formation de vos équipes. ",{"type":28,"tag":29,"props":135,"children":136},{},[137],{"type":33,"value":138},"Pire, concernant la tech et le produit, ces métiers évoluent constamment. L’approche du métier de PM aujourd’hui n’a rien à voir avec le métier d'il y a 10 ans. Les frameworks et solutions technologiques évoluent tous les ans (je peux troller sur les frameworks JS ?). ",{"type":28,"tag":29,"props":140,"children":141},{},[142],{"type":33,"value":143},"Si vous travaillez dans le produit ou la tech, je m’adresse à vous particulièrement. ",{"type":28,"tag":29,"props":145,"children":146},{},[147],{"type":33,"value":148},"La veille technologique n’est pas un plus, vous devez en faire, au risque de n’être plus pertinent dans votre métier d’ici quelques années. La curiosité doit être une de vos qualités. ",{"type":28,"tag":29,"props":150,"children":151},{},[152],{"type":33,"value":153},"Et, je vais être transparent, je pense que c’est de votre responsabilité de prendre cela en main, car c’est votre avenir qui en dépend. ",{"type":28,"tag":29,"props":155,"children":156},{},[157],{"type":33,"value":158},"Bien sûr que l’idéal c’est que votre société vous donne les moyens pour le faire. Mais si ça ne vient pas, ne dormez pas, à la fin c’est vous qui en subirez les conséquences. Donc soyez acteur de votre formation.",{"type":28,"tag":29,"props":160,"children":161},{},[162],{"type":33,"value":163},"Maintenant que j’ai fait cette courte introduction, faisons le point sur tout ce que nous avons déjà fait ou continuons à faire.",{"type":28,"tag":84,"props":165,"children":167},{"id":166},"les-bbl-brown-bag-lunch",[168],{"type":33,"value":169},"Les BBL (brown bag lunch)",{"type":28,"tag":29,"props":171,"children":172},{},[173],{"type":33,"value":174},"Nous avons utilisé ce format plusieurs fois pour faire venir des intervenants externes. Le principe est simple, ils viennent sur la pause déjeuner, on  leur fournit un repas (le fameux brown bag lunch) et en échange ils nous présentent un sujet.",{"type":28,"tag":29,"props":176,"children":177},{},[178],{"type":33,"value":179},"Par exemple, on a fait venir Philippe Charrière pour parler de Clever Cloud, Sébastien Deleuze pour Kotlin et Spring, Vladislav Pernin autour de la mesure de la performance.",{"type":28,"tag":29,"props":181,"children":182},{},[183],{"type":33,"value":184},"Malheureusement la dynamique en 2019 était bonne mais vite interrompue par le COVID en 2020. On va reprendre ce format prochainement.",{"type":28,"tag":29,"props":186,"children":187},{},[188],{"type":28,"tag":109,"props":189,"children":191},{"alt":7,"src":190},"/images/Illustration_sans_titre-37-1024x911.jpg",[],{"type":28,"tag":84,"props":193,"children":195},{"id":194},"les-malt-tech-days",[196],{"type":33,"value":197},"Les Malt tech days ",{"type":28,"tag":29,"props":199,"children":200},{},[201],{"type":33,"value":202},"Un Malt Tech Day correspond à une journée entière de conférences. L’objectif est de partager des sujets assez variés sur une journée de talks pour éveiller la curiosité de chacun, diffuser de la connaissance, partager nos métiers entre backend, front, mobile, data, secu, ops. ",{"type":28,"tag":29,"props":204,"children":205},{},[206],{"type":33,"value":207},"La première édition a eu lieu en 2019 sur Lyon. Nous avons eu beaucoup de propositions, donc il a fallu faire un mini CFP. 15 sujets ont été fournis, nous en avons sélectionné le maximum (11) pour tenir sur la journée. Cela a été possible avec deux salles en parallèle.  ",{"type":28,"tag":29,"props":209,"children":210},{},[211],{"type":33,"value":212},"Nous avons ensuite tenté d’en faire un événement semestriel. Avec le COVID nous avons dû transformer l'événement en visio conf, ce qui a forcément diminué les intéractions, et donc l’émulation mais bon, il a bien fallu s’adapter. ",{"type":28,"tag":29,"props":214,"children":215},{},[216],{"type":33,"value":217},"A chaque édition nous avons invité un intervenant externe qui est venu nous parler de sujet totalement externe à Malt. Le dernier en date était core commiter dans la fondation Apache et nous a parlé de la gouvernance des projets dans une fondation Open source. ",{"type":28,"tag":29,"props":219,"children":220},{},[221],{"type":33,"value":222},"Ce format est incroyablement riche, c’est un super moment pour créer du lien dans l’équipe (quand il n’y a pas le COVID), pour partager des sujets peu connus dans d’autres équipes, pour échanger sur des pratiques, faire découvrir les autres métiers.",{"type":28,"tag":29,"props":224,"children":225},{},[226],{"type":33,"value":227},"Parmi les sujets qui sont déjà passés, je pourrais citer : ",{"type":28,"tag":29,"props":229,"children":230},{},[231],{"type":33,"value":232},"l’architecture hexagonale, API Design, les biais dans les analyses data, un capture the flag, le riskstorming, TLA+, Shenandoah, Kafka etc...",{"type":28,"tag":29,"props":234,"children":235},{},[236],{"type":33,"value":237},"Certaines présentations ont été rejouées par la suite dans des conférences, des meetups ou en Malt Academy. Mais je vais parler de tout ça juste après.. ",{"type":28,"tag":29,"props":239,"children":240},{},[241],{"type":33,"value":242},"Et pour la petite anecdote, on songe à ouvrir le format davantage en externe, donc stay tuned.",{"type":28,"tag":29,"props":244,"children":245},{},[246],{"type":28,"tag":109,"props":247,"children":249},{"alt":7,"src":248},"/images/Illustration_sans_titre-38-1024x724.jpg",[],{"type":28,"tag":84,"props":251,"children":253},{"id":252},"les-conférences",[254],{"type":33,"value":255},"Les conférences ",{"type":28,"tag":29,"props":257,"children":258},{},[259],{"type":33,"value":260},"Justement, parlons des conférences. Combien de fois je vois des personnes galérer pour que son entreprise paie une journée de conférence entre 100 et 500 euros. Les conférences sont un excellent moyen pour se former. C’est bien sûr très différent de la formation avec un animateur, des TP etc... , quoi qu’on trouve désormais des labs dans pas mal de confs, mais c’est également plus diversifié, et plus propice à ouvrir l’esprit, faire émerger des idées.",{"type":28,"tag":29,"props":262,"children":263},{},[264],{"type":33,"value":265},"Là dessus la politique chez Malt est très ouverte. Chacun dans l’équipe peut s’inscrire et aller en conférence de son choix dans l’année.",{"type":28,"tag":29,"props":267,"children":268},{},[269],{"type":33,"value":270},"Malt paie la conférence et les frais. Aucun congé n’est nécessaire, ça paraît bête mais ce n'est pas le cas partout.  ",{"type":28,"tag":29,"props":272,"children":273},{},[274],{"type":33,"value":275},"Idem, nous encourageons les personnes qui le souhaitent à postuler comme orateurs. Plusieurs ont déjà participé en tant que speakers à des conférences : Mixit, Devoxx, des meetups en France mais également dans plusieurs pays d’Europe. ",{"type":28,"tag":29,"props":277,"children":278},{},[279],{"type":33,"value":280},"Vous pourriez me demander quelle est la politique sur les dépenses, ou le contenu ? Il n’y en a pas. La consigne est simple, choisissez dans l’intérêt commun de Malt et de vous-même, votre progression étant également de l’intérêt de Malt.",{"type":28,"tag":29,"props":282,"children":283},{},[284],{"type":33,"value":285},"Et il n’y a pas d’abus. ",{"type":28,"tag":84,"props":287,"children":289},{"id":288},"les-malt-tech-training-sessions-mtts-pour-les-intimes",[290],{"type":33,"value":291},"Les Malt tech training sessions (MTTS pour les intimes)",{"type":28,"tag":29,"props":293,"children":294},{},[295],{"type":33,"value":296},"Dans la continuité des Malt Tech Days, nous avons initié ce nouveau format en 2020 pour combler les périodes entre chaque édition des MTD. ",{"type":28,"tag":29,"props":298,"children":299},{},[300],{"type":33,"value":301},"C’est un format un peu différent puisqu’il n’y a qu’une seule conférence proposée, tous les mois, sur 1 à 2h. ",{"type":28,"tag":29,"props":303,"children":304},{},[305],{"type":33,"value":306},"C’est très orienté “pratique”. Une MTTS doit permettre à chacun de se former sur un sujet chez nous. Ce n’est pas juste une introduction générale mais un “comment Malt utilise…”",{"type":28,"tag":29,"props":308,"children":309},{},[310],{"type":33,"value":311},"Les sessions sont enregistrées pour pouvoir être redonné plus tard aux nouveaux arrivants.",{"type":28,"tag":29,"props":313,"children":314},{},[315],{"type":33,"value":316},"Nous n’avons pas encore totalement abouti sur le sujet car la prochaine étape va être de découper les vidéos pour en faire des modules d’apprentissage qui feront partie de parcours d’onboarding dans 360 learning (un outil d’e-learning d’entreprise). ",{"type":28,"tag":29,"props":318,"children":319},{},[320],{"type":33,"value":321},"Quelques exemples des derniers sujets :",{"type":28,"tag":29,"props":323,"children":324},{},[325],{"type":33,"value":326},"le design system, l’internationalisation, hateoas dans nos applis vue.js, la sécurité, kube/argoCD/Kustomize",{"type":28,"tag":84,"props":328,"children":330},{"id":329},"les-malt-academy",[331],{"type":33,"value":332},"Les Malt Academy",{"type":28,"tag":29,"props":334,"children":335},{},[336],{"type":33,"value":337},"C’est un format plus “externe” et qui en réalité recouvre 2 formats différents. ",{"type":28,"tag":29,"props":339,"children":340},{},[341],{"type":33,"value":342},"Une Malt Academy dure en général 1h, et correspond à une sorte de BBL interne. Elle a pour objectif de vulgariser un sujet au reste de l’entreprise. ",{"type":28,"tag":29,"props":344,"children":345},{},[346],{"type":33,"value":347},"Mais on fait également des Malt Academy externe, sous forme de webinar qui sont annoncés à la communauté freelance de Malt régulièrement.",{"type":28,"tag":29,"props":349,"children":350},{},[351],{"type":33,"value":352},"Il y a des Malters qui participent mais également de super intervenants externes. ",{"type":28,"tag":29,"props":354,"children":355},{},[356],{"type":33,"value":357},"Ces vidéos sont diffusées ensuite sur Youtube alors si vous ne connaissez pas, je vous invite à y jeter un œil !",{"type":28,"tag":29,"props":359,"children":360},{},[361],{"type":28,"tag":36,"props":362,"children":365},{"href":363,"rel":364},"https://www.youtube.com/channel/UCPA9grRuUqVLyrazhIqd8BQ",[40],[366],{"type":33,"value":363},{"type":28,"tag":84,"props":368,"children":370},{"id":369},"le-e-learning",[371],{"type":33,"value":372},"Le e-learning",{"type":28,"tag":29,"props":374,"children":375},{},[376],{"type":33,"value":377},"Le e-learning fait partie des outils qu’on utilise chez Malt. Je pense que tout le monde connaît donc je ne m'appesantirai pas trop dessus. Chaque personne de l’équipe peut utiliser un budget personnel pour aller sur PluralSight, Oreilly, Coursera etc… ",{"type":28,"tag":29,"props":379,"children":380},{},[381],{"type":33,"value":382},"Il y a des formations de très bonnes qualités. ",{"type":28,"tag":29,"props":384,"children":385},{},[386],{"type":33,"value":387},"Pas grand chose à dire de plus, mais je le mentionne. ",{"type":28,"tag":84,"props":389,"children":391},{"id":390},"les-journées-déchanges",[392],{"type":33,"value":393},"Les journées d’échanges ",{"type":28,"tag":29,"props":395,"children":396},{},[397],{"type":33,"value":398},"Plus exotique, nous avons fait des journées d’échange avec d’autres boites. Alors je ne vais pas le cacher, l’organisation est plus complexe donc ça reste rare. C’est arrivé 2 fois ces dernières années. Quand je dis que c’est rare, c’est rare ^^",{"type":28,"tag":29,"props":400,"children":401},{},[402],{"type":33,"value":403},"Mais je le mentionne pour ceux qui seraient prêt à tenter l’expérience. On a toujours tiré de supers infos de ces échanges. ",{"type":28,"tag":29,"props":405,"children":406},{},[407],{"type":33,"value":408},"L’organisation s’est faite à chaque fois de façon similaire : une boîte invite l’autre, sur une soirée ou une demi-journée.",{"type":28,"tag":29,"props":410,"children":411},{},[412],{"type":33,"value":413},"C’est une format “forum ouvert” : on organise une petite introduction où chacun a la possibilité d’inscrire un sujet sur un post it puis tout le monde vote, et on prend les sujets qui ont été votés pour créer des tables rondes sur des créneaux de 20/40min max. Les gens se répartissent sur ces tables rondes et on fait tourner 2/3 tables rondes en parallèle sur quelques heures. On peut parler de toutes nos pratiques, nos problématiques, voir comment on a résolu tel ou tel souci. A chaque fois ça a été assez riche. ",{"type":28,"tag":29,"props":415,"children":416},{},[417],{"type":33,"value":418},"Je ne cite pas les boîtes avec qui nous l’avons fait car je ne sais pas trop dans quelle mesure je peux le faire. Mais c’était un super échange et je remercie tous les participants.",{"type":28,"tag":84,"props":420,"children":422},{"id":421},"lenseignement",[423],{"type":33,"value":424},"L’enseignement",{"type":28,"tag":29,"props":426,"children":427},{},[428],{"type":33,"value":429},"Ce point je le mentionne en tout dernier car il reste très minoritaire. Mais dans l’organisation de Malt, le choix de passer en 4/5eme ne pose aucun souci. Plusieurs personnes sont passé en 4/5em, pour des sides projects, des organisations familiales, ou, de l’enseignement. ",{"type":28,"tag":29,"props":431,"children":432},{},[433],{"type":33,"value":434},"Et nous avons donc quelques personnes dans l’équipe qui ont donné ou donnent encore des cours en externe. ",{"type":28,"tag":29,"props":436,"children":437},{},[438,440,447],{"type":33,"value":439},"Pour la petite anecdote, par pure coïncidence, une des personnes de l’équipe donne des vacations au même endroit où moi-même j’en ai donné en 2011, ce que je décrivais dans ",{"type":28,"tag":36,"props":441,"children":444},{"href":442,"rel":443},"https://eventuallycoding.com/2012/05/01/p-r-o-f-s/",[40],[445],{"type":33,"value":446},"ce vieux billet de blog",{"type":33,"value":448}," :) D’ailleurs j’explique dans ce billet en quoi donner des vacations nous fait progresser également. ",{"type":28,"tag":450,"props":451,"children":452},"hr",{},[],{"type":28,"tag":29,"props":454,"children":455},{},[456],{"type":33,"value":457},"Je crois avoir fait le tour des différents formats que nous avons utilisés au fil des années chez Malt. ",{"type":28,"tag":29,"props":459,"children":460},{},[461],{"type":33,"value":462},"Je n'ai pas évoqué les formations \"traditionnelles\" mais nous en pratiquons également. Ici je souhaitais surtout montrer des formats moins habituels pour partager des idées qui pourraient s'avérer bonnes pour d'autres. ",{"type":28,"tag":29,"props":464,"children":465},{},[466],{"type":33,"value":467},"Je suis fortement convaincu que la curiosité technique doit être encouragé. La curiosité c'est une gymnastique individuelle qu'il faut pratiquer pour que ce soit naturel. Tout ce qu'on découvre de cette façon c'est une nouvelle corde à son arc disponible pour résoudre des problèmes par la suite et ca évite de tomber dans le travers \"quand on n'a qu'un marteau, tout les problèmes ressemblent à des clous\". ",{"type":28,"tag":29,"props":469,"children":470},{},[471],{"type":33,"value":472},"Même si attention, je ne dis pas à l'extrème qu'il faut céder à chaque nouvelle tendance et faire du hype driven development, on pourrait faire un billet uniquement sur ce thème.",{"type":28,"tag":29,"props":474,"children":475},{},[476],{"type":33,"value":477},"That's all folks.",{"title":7,"searchDepth":479,"depth":479,"links":480},2,[481,482,483,484,485,486,487,488,489],{"id":86,"depth":479,"text":89},{"id":166,"depth":479,"text":169},{"id":194,"depth":479,"text":197},{"id":252,"depth":479,"text":255},{"id":288,"depth":479,"text":291},{"id":329,"depth":479,"text":332},{"id":369,"depth":479,"text":372},{"id":390,"depth":479,"text":393},{"id":421,"depth":479,"text":424},"markdown","content:articles:2021:10:20:se-tenir-a-jour-dans-une-equipe-produit.md","content","articles/2021/10/20/se-tenir-a-jour-dans-une-equipe-produit.md","md",1700467036749]