[{"data":1,"prerenderedAt":891},["Reactive",2],{"/articles/2021/07/06/les-salaires-dans-la-tech":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"date":11,"categories":12,"tags":14,"img":17,"cover":18,"readingTime":19,"body":24,"_type":886,"_id":887,"_source":888,"_file":889,"_extension":890},"/articles/2021/07/06/les-salaires-dans-la-tech","06",false,"","Les salaires dans la tech","Parlons d'un sujet qui fait couler beaucoup d’encre, les salaires.\nLe sujet est passionnant car le marché a énormément changé en une dizaine d'années...","1780","2021-07-06",[13],"waza",[15,16],"salaires","tech","Money-1024x791.jpg","money-drawing.jpg",{"text":20,"minutes":21,"time":22,"words":23},"16 min read",15.4,924000,3080,{"type":25,"children":26,"toc":860},"root",[27,35,40,45,50,55,60,68,75,80,85,90,95,100,105,110,115,120,125,130,136,152,158,163,168,180,185,190,203,208,214,219,226,238,243,248,253,258,263,268,273,279,284,289,294,298,303,308,314,319,324,329,333,338,343,349,354,359,364,369,374,379,384,389,395,400,405,411,416,421,426,431,436,441,447,452,464,470,475,480,486,491,496,501,506,511,516,522,527,532,542,548,554,559,564,569,574,579,584,589,595,600,605,610,615,620,626,631,643,648,653,658,663,668,680,685,690,695,700,705,710,715,721,726,738,750,755,764,773,782,791,796,805,814,823,832,841,846,855],{"type":28,"tag":29,"props":30,"children":31},"element","p",{},[32],{"type":33,"value":34},"text","Parlons d'un sujet qui fait couler beaucoup d’encre, les salaires.",{"type":28,"tag":29,"props":36,"children":37},{},[38],{"type":33,"value":39},"Le sujet est passionnant car le marché a énormément changé en une dizaine d'années.",{"type":28,"tag":29,"props":41,"children":42},{},[43],{"type":33,"value":44},"S’il pouvait exister une sorte de plafond de verre autour de 50/55k il y a encore 10 ans, désormais on voit des salaires au-dessus des 100k en France.",{"type":28,"tag":29,"props":46,"children":47},{},[48],{"type":33,"value":49},"Cependant cette réalité ne doit pas en cacher une autre, c'est que cela reste très rare et je lis pas mal d'idées reçues sur le sujet. ",{"type":28,"tag":29,"props":51,"children":52},{},[53],{"type":33,"value":54},"Je vous propose donc de faire le tour de la question. On va aussi pouvoir discuter de l’influence du lieu, de l'équilibre entre pro et perso ou de l’évolution de l’écosystème tech en Europe. ",{"type":28,"tag":29,"props":56,"children":57},{},[58],{"type":33,"value":59},"Vous trouverez plus bas un fichier excel avec quelques informations utiles sur les salaires par type d’entreprises.",{"type":28,"tag":29,"props":61,"children":62},{},[63],{"type":28,"tag":64,"props":65,"children":67},"img",{"alt":7,"src":66},"/images/money-drawing.jpg",[],{"type":28,"tag":69,"props":70,"children":72},"h2",{"id":71},"rien-na-changé",[73],{"type":33,"value":74},"Rien n’a changé",{"type":28,"tag":29,"props":76,"children":77},{},[78],{"type":33,"value":79},"J'aimerai bien partir des chiffres pour commencer ce billet. ",{"type":28,"tag":29,"props":81,"children":82},{},[83],{"type":33,"value":84},"Pour discuter du salaire, je vais prendre l'étude IESF (1) que je trouve assez complète. Elle repose sur une bonne quantité de données et ils affinent leur méthodologie d’analyse depuis une soixante d'années. ",{"type":28,"tag":29,"props":86,"children":87},{},[88],{"type":33,"value":89},"J'aurais pu prendre les études de WeLoveDevs, Urban Linker, Silkhom, AFUP et j’en passe.  Dans tous les cas on retrouve grosso modo les mêmes chiffres mais certains de ces baromètres reposent sur trop peu de données ou avec un fort biais pour être aussi pertinent. ",{"type":28,"tag":29,"props":91,"children":92},{},[93],{"type":33,"value":94},"L'enquête IESF 2020 rappelait que le salaire médian des ingénieurs de moins de 30 ans oscillait entre 32 et 48k en France. ",{"type":28,"tag":29,"props":96,"children":97},{},[98],{"type":33,"value":99},"Un \"senior\" entre 30 et 39 ans est autour de 53k. ",{"type":28,"tag":29,"props":101,"children":102},{},[103],{"type":33,"value":104},"Si on reprend la même étude de 2012, il n'y a quasiment aucune évolution sur la médiane. ",{"type":28,"tag":29,"props":106,"children":107},{},[108],{"type":33,"value":109},"Bref, les chiffres sont têtus et ils ne montrent pas de progression en 10 ans. ",{"type":28,"tag":29,"props":111,"children":112},{},[113],{"type":33,"value":114},"Mais alors pourquoi ce décalage avec ce que j'annonçais plus haut en introduction de ce billet ? ",{"type":28,"tag":29,"props":116,"children":117},{},[118],{"type":33,"value":119},"Pourquoi sur les réseaux sociaux ou channels slacks on voit régulièrement des devs s'indigner de salaire à 45k qui seraient \"largement en dessous du marché\" ?",{"type":28,"tag":29,"props":121,"children":122},{},[123],{"type":33,"value":124},"Saviez-vous que cette apparente déconnexion existe aussi aux US ? Vous avez sans doute vu passer sur Twitter des salaires au-dessus des 300, 400 voire même 700k aux US avec des histoires de jeunes diplômés à 140k chez Google.",{"type":28,"tag":29,"props":126,"children":127},{},[128],{"type":33,"value":129},"C'est exact. Et pourtant le salaire médian aux US est de $107k (90k€) (2)",{"type":28,"tag":69,"props":131,"children":133},{"id":132},"des-career-path-plus-matures",[134],{"type":33,"value":135},"Des career path plus matures",{"type":28,"tag":29,"props":137,"children":138},{},[139,141,150],{"type":33,"value":140},"Je l'évoquais ",{"type":28,"tag":142,"props":143,"children":147},"a",{"href":144,"rel":145},"https://eventuallycoding.com/2021/06/24/senior-avec-6-ans-dexperience-et-apres/",[146],"nofollow",[148],{"type":33,"value":149},"dans un précédent billet",{"type":33,"value":151},", la séniorité ne s'arrête pas après 6 ans d'expérience. Le premier biais que l'on peut évoquer c'est que les salaires les plus élevés concernent en réalité les personnes ayant atteint un certain niveau d'expérience. Or les career path sont plus matures qu'avant et ne s'arrêtent plus à \"senior\". On parle désormais de staff engineer, principal engineer, distinguished et fellow et ça c'est une des principales différences par rapport à il y a 10 ans. Il existait bien sûr des experts mais c'était plus exceptionnel. Aujourd'hui on a gagné en maturité sur le sujet. On sait mieux définir l'impact attendu à chaque niveau et les étapes à franchir.",{"type":28,"tag":69,"props":153,"children":155},{"id":154},"un-marché-segmenté",[156],{"type":33,"value":157},"Un marché segmenté",{"type":28,"tag":29,"props":159,"children":160},{},[161],{"type":33,"value":162},"Ces écarts de salaire sont aussi liés à la segmentation du marché et à un effet loupe important sur les 2 derniers segments. En effet, on peut ranger l’ensemble des entreprises en 4 grands groupes d'entreprises. Et les deux petits groupes qui paient très bien ne représentent qu'une part minuscule du groupe total, ce qui n’influe donc pas sur la médiane.",{"type":28,"tag":29,"props":164,"children":165},{},[166],{"type":33,"value":167},"Sauf que, c'est de ce groupe d'entreprise qu'on parle le plus, produisant un effet loupe qui déforme la vision du marché.",{"type":28,"tag":29,"props":169,"children":170},{},[171],{"type":28,"tag":142,"props":172,"children":175},{"href":173,"rel":174},"https://eventuallycoding.com/wp-content/uploads/2021/07/Illustration_sans_titre-16.jpg",[146],[176],{"type":28,"tag":64,"props":177,"children":179},{"alt":7,"src":178},"/images/Illustration_sans_titre-16-1024x664.jpg",[],{"type":28,"tag":29,"props":181,"children":182},{},[183],{"type":33,"value":184},"Alors on le sait, il faut se méfier des bulles de filtre. On peut vivre dans un écosystème, qu’il soit géographique, social, sectoriel ou autre et être entouré de personnes dans une situation assez similaire. Malgré tout, il est facile de se faire avoir et d’autant plus si cela paraît séduisant. ",{"type":28,"tag":29,"props":186,"children":187},{},[188],{"type":33,"value":189},"Je vous propose de voir le marché avec une segmentation que je vais décrire plus bas. Ensuite j'aborderais les critères que j'ai pris en compte pour mettre en avant leurs différences.",{"type":28,"tag":29,"props":191,"children":192},{},[193,195,201],{"type":33,"value":194},"Pour les impatients, vous pouvez directement sauter ",{"type":28,"tag":196,"props":197,"children":198},"strong",{},[199],{"type":33,"value":200},"vers le fichier récapitulatif",{"type":33,"value":202}," qui montre ces segments et leurs différences.",{"type":28,"tag":29,"props":204,"children":205},{},[206],{"type":33,"value":207},"Mais vous ne devriez pas quitter ce billet, car l'idée est aussi ici d'analyser comment tout cela va évoluer dans un futur proche.",{"type":28,"tag":69,"props":209,"children":211},{"id":210},"les-4-grands-groupes-dentreprises",[212],{"type":33,"value":213},"Les 4 grands groupes d'entreprises ",{"type":28,"tag":29,"props":215,"children":216},{},[217],{"type":33,"value":218},"Je suis parti de 4 grandes catégories d'entreprises pour cette segmentation. Comme toute segmentation, vous trouverez des contres exemples j'en suis certain. J'ai cependant cherché des caractéristiques fortes qui rassemblent ces entreprises. ",{"type":28,"tag":220,"props":221,"children":223},"h3",{"id":222},"les-entreprises-locales",[224],{"type":33,"value":225},"les entreprises locales ",{"type":28,"tag":29,"props":227,"children":228},{},[229,231,236],{"type":33,"value":230},"C'est le groupe le plus large, et de loin. ",{"type":28,"tag":196,"props":232,"children":233},{},[234],{"type":33,"value":235},"La majorité des benchmarks de salaires sont faits sur ces entreprises",{"type":33,"value":237},". ",{"type":28,"tag":29,"props":239,"children":240},{},[241],{"type":33,"value":242},"Dans ce segment, on va considérer l'ensemble des sociétés qui sont en compétition sur un marché géographique limité (ville ou région).",{"type":28,"tag":29,"props":244,"children":245},{},[246],{"type":33,"value":247},"Ces sociétés peuvent être nationales mais avec des antennes locales indépendantes. ",{"type":28,"tag":29,"props":249,"children":250},{},[251],{"type":33,"value":252},"Les clients sont eux aussi locaux dans la plupart des cas. ",{"type":28,"tag":29,"props":254,"children":255},{},[256],{"type":33,"value":257},"On retrouvera également toutes les sociétés pour lesquelles la tech n'est pas une valeur ajoutée forte. La tech peut être nécessaire pour maintenir des applications, des sites de e-commerce mais ce n'est pas le cœur de l'entreprise.",{"type":28,"tag":29,"props":259,"children":260},{},[261],{"type":33,"value":262},"C’est dans ce groupe d’entreprise que le lieu a une importance. Elles sont en compétition sur un bassin d’emploi donné donc on peut trouver des écarts entre régions traduisant la tension offre/demande localement.",{"type":28,"tag":29,"props":264,"children":265},{},[266],{"type":33,"value":267},"Exemple :",{"type":28,"tag":29,"props":269,"children":270},{},[271],{"type":33,"value":272},"la très grande majorité des ESN, les industries locales, les éditeurs de logiciels avec une audience locale, parfois nationale (mais pas internationale), les startups jusqu'à une certaine taille",{"type":28,"tag":220,"props":274,"children":276},{"id":275},"les-entreprises-glocales-globales-mais-représentées-localement",[277],{"type":33,"value":278},"les entreprises glocales (globales mais représentées localement)",{"type":28,"tag":29,"props":280,"children":281},{},[282],{"type":33,"value":283},"Ce second groupe est parfois confondu avec le premier car les niveaux de salaires peuvent paraître similaires au premier coup d'œil.",{"type":28,"tag":29,"props":285,"children":286},{},[287],{"type":33,"value":288},"On verra dans le tableau récapitulatif qu'il n'en est rien car la rémunération globale doit prendre en compte tous les avantages et ces entreprises sont bien souvent assez intéressantes à ce sujet. ",{"type":28,"tag":29,"props":290,"children":291},{},[292],{"type":33,"value":293},"Les sociétés sont plus établies, avec des capitaux importants.",{"type":28,"tag":29,"props":295,"children":296},{},[297],{"type":33,"value":267},{"type":28,"tag":29,"props":299,"children":300},{},[301],{"type":33,"value":302},"Les grands groupes industriels, les banques, les acteurs télécoms, le CAC 40 ",{"type":28,"tag":29,"props":304,"children":305},{},[306],{"type":33,"value":307},"EDF, Siemens, CIC, etc.",{"type":28,"tag":220,"props":309,"children":311},{"id":310},"les-entreprises-tech",[312],{"type":33,"value":313},"Les entreprises tech",{"type":28,"tag":29,"props":315,"children":316},{},[317],{"type":33,"value":318},"Vous retrouverez dans cette catégorie toutes les entreprises revendiquant un produit propulsé par la tech, les fameuses HRTech, FinTech, AgriTech etc… ",{"type":28,"tag":29,"props":320,"children":321},{},[322],{"type":33,"value":323},"Elles sont bien souvent internationales mais avec une présence encore limitée. La différence avec les startups qui peuvent se retrouver dans le groupe 1 c’est qu’elles ont passées un certain stade de croissance et ont reçu un financement significatif qui leur permet d’investir lourdement dans les salaires et le recrutement.",{"type":28,"tag":29,"props":325,"children":326},{},[327],{"type":33,"value":328},"Ces entreprises sont souvent assez visibles, on parle d’elles dans la presse spécialisée mais leur nombre est en réalité assez faible. ",{"type":28,"tag":29,"props":330,"children":331},{},[332],{"type":33,"value":267},{"type":28,"tag":29,"props":334,"children":335},{},[336],{"type":33,"value":337},"Les scale-ups, les éditeurs de logiciels avec une portée internationale",{"type":28,"tag":29,"props":339,"children":340},{},[341],{"type":33,"value":342},"Malt, Doctolib, Payfit, ContentSquare, 360learnings, etc.",{"type":28,"tag":220,"props":344,"children":346},{"id":345},"les-big-tech",[347],{"type":33,"value":348},"Les Big tech ",{"type":28,"tag":29,"props":350,"children":351},{},[352],{"type":33,"value":353},"Il faut une catégorie à part pour parler de ceux-là. Il s'agit des grands leaders d'industrie de la tech à l'échelle mondiale. La tech est cruciale chez eux. Les rémunérations sont très largement au dessus des moyennes et les process de recrutement sont élitistes. ",{"type":28,"tag":29,"props":355,"children":356},{},[357],{"type":33,"value":358},"L'Europe bénéficiait déjà de certaines entreprises qui ont ouvert des bureaux ces dernières années chez nous (Google, Facebook par exemple) mais aussi des entreprises full remote (Github, Pivotal, Gitlab) ou des géants nés en Europe (Booking, Spotify). ",{"type":28,"tag":29,"props":360,"children":361},{},[362],{"type":33,"value":363},"Ces dernières années, les pénuries de main d'œuvre aux US et la crise du COVID semblent accélérer des mutations fortes avec l'essor du remote et/ou des implantations de plus en plus nombreuses en Europe, ce qui commence à peser de façon significative sur le niveau des salaires. ",{"type":28,"tag":29,"props":365,"children":366},{},[367],{"type":33,"value":368},"Exemple : ",{"type":28,"tag":29,"props":370,"children":371},{},[372],{"type":33,"value":373},"Uber, Booking, Spotify, Facebook, Google, Datadog, Github ",{"type":28,"tag":29,"props":375,"children":376},{},[377],{"type":33,"value":378},"Avant d'aller plus loin, le but de ce billet n'est pas de faire un classement et il n'est pas question de dire que tel ou tel type d'entreprise est plus intéressant qu'un autre. ",{"type":28,"tag":29,"props":380,"children":381},{},[382],{"type":33,"value":383},"Chacun peut correspondre à des choix de vie personnels. On peut comprendre que le niveau de rémunération est aussi lié à un niveau de stress et un équilibre pro/perso, ou à un niveau d’autonomie plus ou moins fort. ",{"type":28,"tag":29,"props":385,"children":386},{},[387],{"type":33,"value":388},"On a tous des motivations personnelles différentes. Si certains ne seront pas gênés par un niveau de stress plus important et seront excités par l'impact qu'ils peuvent avoir, d'autres préféreront avoir un meilleur équilibre avec leur vie de famille et d'autres chercheront un cadre plus structuré, moins bordélique, même s’il y a moins d’autonomie. ",{"type":28,"tag":69,"props":390,"children":392},{"id":391},"les-critères-de-comparaison",[393],{"type":33,"value":394},"Les critères de comparaison ",{"type":28,"tag":29,"props":396,"children":397},{},[398],{"type":33,"value":399},"Parlons un peu des critères que j'ai utilisés pour illustrer les différences entre ces segments. ",{"type":28,"tag":29,"props":401,"children":402},{},[403],{"type":33,"value":404},"J’ai essayé de prendre des critères qui me paraissaient importants du point de vue de la personne qui chercherait à comparer les avantages et inconvénients d’être dans telle ou telle entreprise.",{"type":28,"tag":220,"props":406,"children":408},{"id":407},"la-politique-de-rémunération",[409],{"type":33,"value":410},"La politique de rémunération",{"type":28,"tag":29,"props":412,"children":413},{},[414],{"type":33,"value":415},"Je vais parler de rémunération et non de salaire. Car si on compare souvent les salaires cela n'a en réalité pas de sens. Lorsqu'une entreprise propose le double de congés, des semaines de 4 jours, des congés illimités, de l'intéressement, de l'abondement sur des achats d'actions ou des avantages spécifiques (voyages moins cher, électricité moins chère etc...), on ne peut pas comparer uniquement le salaire. ",{"type":28,"tag":29,"props":417,"children":418},{},[419],{"type":33,"value":420},"J'évoquerais aussi les stocks options (actions de la société) dans les politiques de rémunération même s'il est plus dur d'en établir un équivalent salaire.",{"type":28,"tag":29,"props":422,"children":423},{},[424],{"type":33,"value":425},"Les stocks sont bien souvent mal compris parmi les métiers tech. Et pourtant, avec l'explosion des montants actuellement dans les startups, je peux vous assurer que la plus value est loin d'être négligeable. Je serais curieux de connaitre la valeur des stocks/BSPCE pour les personnes ayant vécu l'IPO de Datadog ou les levées de ContentSquare, Miro, Klarna etc... Mais lorsque vous rejoignez des startups ou scale ups, vous devriez regarder cet aspect là dans le package. ",{"type":28,"tag":29,"props":427,"children":428},{},[429],{"type":33,"value":430},"Vous noterez une ligne à part dans le tableau pour les avantages (perks) que l’on peut retrouver. ",{"type":28,"tag":29,"props":432,"children":433},{},[434],{"type":33,"value":435},"En France toute entreprise doit fournir certains avantages, comme des tickets repas, une participation au transport ou une prime de vacances (convention syntec).",{"type":28,"tag":29,"props":437,"children":438},{},[439],{"type":33,"value":440},"Mais désormais il y a de nombreux autres avantages qui sont mis en avant pour attirer et fidéliser les employés. Entre le télétravail, le matériel, les vacances illimitées, des CE très généreux, des conférences internes, le financement des participations aux conférences, tous ces avantages font qu'il peut être parfois difficile de comparer deux rémunérations. ",{"type":28,"tag":220,"props":442,"children":444},{"id":443},"le-niveau-de-salaire-moyen-pour-une-senior-dev",[445],{"type":33,"value":446},"Le niveau de salaire moyen pour un(e) senior dev",{"type":28,"tag":29,"props":448,"children":449},{},[450],{"type":33,"value":451},"Pour le tableau ci-dessous, je parle du salaire moyen d'une personne senior. Dans senior je vais inclure toutes les personnes de Senior à Principal Engineer donc au moins 6 ans d'expérience (senior 1). Certaines tranches de salaire sont faciles à trouver sur le net, d'autres et notamment dans les groupes 3 et 4 sont très dures à trouver et vous allez devoir me faire confiance. J'ai beaucoup discuté avec de nombreuses boîtes pour avoir des benchmarks. Je vais les simplifier ici au maximum pour ne prendre que les seniors et plus.",{"type":28,"tag":29,"props":453,"children":454},{},[455,457,462],{"type":33,"value":456},"Cependant je suis prêt à parier que ",{"type":28,"tag":196,"props":458,"children":459},{},[460],{"type":33,"value":461},"ce tableau ne sera déjà plus d'actualité dans un ou deux ans",{"type":33,"value":463}," au vu de l'évolution des salaires et on va parler de ça plus bas. ",{"type":28,"tag":220,"props":465,"children":467},{"id":466},"la-politique-de-recrutement",[468],{"type":33,"value":469},"La politique de recrutement",{"type":28,"tag":29,"props":471,"children":472},{},[473],{"type":33,"value":474},"La difficulté à rejoindre chacun des groupes n'est clairement pas la même et il est bon de le savoir. Vous passerez parfois des heures, voire des jours en process de recrutement avec une compétition plus ou moins importante. Sur certains groupes d'entreprises, votre cursus académique vous fermera carrément des portes ou vous bloquera dans votre progression et enfin dans certains cas à l'inverse les process seront potentiellement beaucoup plus légers. ",{"type":28,"tag":29,"props":476,"children":477},{},[478],{"type":33,"value":479},"Tout est question d'offres et de demandes. Une entreprise qui ne fait pas de remote, dans une petite ville de région, avec peu de visibilité et avec moins de candidats devra se montrer moins exigeante sur ces process. A l'inverse les big tech qui investissent massivement dans la tech, même s'ils ont des besoins gigantesques en terme de recrutement ont aussi beaucoup de candidats et vont se permettre d’être très sélectifs. ",{"type":28,"tag":220,"props":481,"children":483},{"id":482},"léquilibre-properso",[484],{"type":33,"value":485},"L'équilibre pro/perso ",{"type":28,"tag":29,"props":487,"children":488},{},[489],{"type":33,"value":490},"C’est un critère complexe car nous ne sommes pas tous sensibles aux mêmes choses.",{"type":28,"tag":29,"props":492,"children":493},{},[494],{"type":33,"value":495},"Je vais essayer de l'illustrer par des exemples concrets. ",{"type":28,"tag":29,"props":497,"children":498},{},[499],{"type":33,"value":500},"Prenons des exemples de sujets qui peuvent diviser :",{"type":28,"tag":29,"props":502,"children":503},{},[504],{"type":33,"value":505},"- le télétravail. J’en suis très fan. Mais on peut aussi argumenter que cela brouille la différence entre son espace de vie perso et pro et permet plus facilement de faire des horaires plus élastiques dans sa journée. ",{"type":28,"tag":29,"props":507,"children":508},{},[509],{"type":33,"value":510},"- le travail sur plusieurs fuseaux horaires. On peut apprécier la diversité des échanges, l’émulation de travailler dans un environnement international. Mais on peut aussi devoir faire des horaires exotiques pour discuter avec son collègue US.",{"type":28,"tag":29,"props":512,"children":513},{},[514],{"type":33,"value":515},"Sur ces critères, c’est impossible de donner une note et juste dire que 0 c’est nul et 10 c’est très bien. Personnellement je préfère le remote, les horaires flexibles, l’autonomie (donc le stress d’être responsable) mais chacun son équilibre sur ces sujets. ",{"type":28,"tag":220,"props":517,"children":519},{"id":518},"limpact-attendu-lautonomie-et-la-progression",[520],{"type":33,"value":521},"L'impact attendu, l'autonomie et la progression ",{"type":28,"tag":29,"props":523,"children":524},{},[525],{"type":33,"value":526},"Là encore, c’est une question très personnelle et je vais essayer d'être le plus factuel possible. On parlera de l'impact que l'on peut espérer avoir dans une entreprise, lié aussi à ce fameux équilibre pro/perso, de l'autonomie que l'on peut espérer ou de l'émulation de son environnement.",{"type":28,"tag":29,"props":528,"children":529},{},[530],{"type":33,"value":531},"Et sans plus attendre, le fameux fichier de comparaison :",{"type":28,"tag":29,"props":533,"children":534},{},[535],{"type":28,"tag":142,"props":536,"children":539},{"href":537,"rel":538},"https://docs.google.com/spreadsheets/d/1kDu_qsXV-aDLUv5vXvU-jyfZ7G_up-wOH9jUiTOioKU/edit#gid=0",[146],[540],{"type":33,"value":541},"Le fichier comparatif des segments d’entreprises",{"type":28,"tag":69,"props":543,"children":545},{"id":544},"lévolution-de-la-tech-et-des-salaires",[546],{"type":33,"value":547},"L’évolution de la tech et des salaires",{"type":28,"tag":220,"props":549,"children":551},{"id":550},"une-pénurie-qui-saccentue-mondialement",[552],{"type":33,"value":553},"Une pénurie qui s’accentue mondialement",{"type":28,"tag":29,"props":555,"children":556},{},[557],{"type":33,"value":558},"À ce stade du billet vous avez sans doute lu le tableau. Et si vous l’avez fait vous aurez noté une fourchette de rémunération qui va de 40 à 300k en prenant les extrêmes, mais déjà 50-90 pour une fourchette plus raisonnable. ",{"type":28,"tag":29,"props":560,"children":561},{},[562],{"type":33,"value":563},"Bien sûr, si on parle de salaire médian, il y a de fortes chances qu’on soit plutôt vers 50 car la part de personnes dans la fourchette haute est très faible.",{"type":28,"tag":29,"props":565,"children":566},{},[567],{"type":33,"value":568},"Mais, tout change, et vite. Dans 2 ans, ce billet risque d’être obsolète.",{"type":28,"tag":29,"props":570,"children":571},{},[572],{"type":33,"value":573},"J’ai discuté avec des personnes en Inde, en Ukraine, aux US (et pas que dans la Silicon Valley). La préoccupation principale pour chacun, c’est le recrutement qui devient de plus en plus dur et chacun explore de nouvelles solutions.",{"type":28,"tag":29,"props":575,"children":576},{},[577],{"type":33,"value":578},"Les boites US ouvrent de plus en plus de pôles de dev ailleurs, et notamment en Europe.",{"type":28,"tag":29,"props":580,"children":581},{},[582],{"type":33,"value":583},"De nombreuses entreprises ont ouvert les vannes en termes de remote avec le COVID. Alors ce n’est pas encore un full remote généralisé. Si vous regardez les sites d’emploi spécialisés en remote (3), une large majorité parle de remote “US-Only”, “Europe-Only”, “Canada-Only”, “France-Only” mais ça évolue. En période de fortes tensions sur le recrutement, ne pas évoluer coûtera des opportunités d’embauche. Et la tension augmente.",{"type":28,"tag":29,"props":585,"children":586},{},[587],{"type":33,"value":588},"À ce sujet, cela veut aussi dire que les écarts entre régions vont diminuer, même si là encore, le faible nombre d'entreprises dans les catégories 3 et 4 ET qui font du remote ne vont pas tout changer d’un coup non plus..",{"type":28,"tag":220,"props":590,"children":592},{"id":591},"une-pression-qui-vient-du-haut",[593],{"type":33,"value":594},"Une pression qui vient du haut",{"type":28,"tag":29,"props":596,"children":597},{},[598],{"type":33,"value":599},"Chaque segment d’entreprise met de plus en plus de pression sur les autres. ",{"type":28,"tag":29,"props":601,"children":602},{},[603],{"type":33,"value":604},"Les Big Tech prennent des très bons ingénieurs à des niveaux de rémunération incroyables et en visant de préférence des employés ayant déjà bossé dans des contextes proches, donc les entreprises tech (le groupe 3). ",{"type":28,"tag":29,"props":606,"children":607},{},[608],{"type":33,"value":609},"Les entreprises tech tentent de récupérer les salariés des Big Tech pour bénéficier de leur expérience et font monter leur propre grille salariale. En parallèle, elles chassent dans les entreprises locales et glocales, ce qui fait monter les prix également dans ces deux segments. ",{"type":28,"tag":29,"props":611,"children":612},{},[613],{"type":33,"value":614},"Vous avez sans doute entendu la petite phrase : “on vise à être dans le 80eme percentile en terme de salaire pour être très attractif et pouvoir être sélectif”.",{"type":28,"tag":29,"props":616,"children":617},{},[618],{"type":33,"value":619},"Sauf que plus il y a d’entreprises avec des moyens, plus ce 80eme percentile évolue à la hausse. Et justement, les moyens sont là.",{"type":28,"tag":220,"props":621,"children":623},{"id":622},"un-écosystème-très-fortement-valorisé",[624],{"type":33,"value":625},"Un écosystème très fortement valorisé",{"type":28,"tag":29,"props":627,"children":628},{},[629],{"type":33,"value":630},"Saviez-vous que le montant d’investissement dans les startups pourrait atteindre 94 Milliards en Europe d’ici fin d’année ? C’est presque 2.5 fois l’argent investi l’année dernière.",{"type":28,"tag":29,"props":632,"children":633},{},[634],{"type":28,"tag":142,"props":635,"children":638},{"href":636,"rel":637},"https://eventuallycoding.com/wp-content/uploads/2021/07/fundings.png",[146],[639],{"type":28,"tag":64,"props":640,"children":642},{"alt":7,"src":641},"/images/fundings.png",[],{"type":28,"tag":29,"props":644,"children":645},{},[646],{"type":33,"value":647},"En France, le nombre de licornes a été multiplié par 5 depuis 2015 dont 7 juste cette année. Et cet argent est investi massivement dans les recrutements, notamment dans le produit. ",{"type":28,"tag":29,"props":649,"children":650},{},[651],{"type":33,"value":652},"Car figurez-vous que c’est le produit qui détermine la valorisation de ces boîtes.",{"type":28,"tag":29,"props":654,"children":655},{},[656],{"type":33,"value":657},"Sans rentrer dans des détails trop techniques, ce qui fait que les boîtes tech arrivent à être valorisées entre 2 et 5 fois leur volume d’affaires, c’est leurs assets technologiques. ",{"type":28,"tag":29,"props":659,"children":660},{},[661],{"type":33,"value":662},"Si vous prenez deux boites avec le même volume d’affaires (GMV en anglais), celle qui n’a pas de produit sera valorisée à la hauteur de sa GMV. Celle qui a un produit et qui démontre un investissement fort peut être valorisée plusieurs fois la valeur de son volume d’affaires.",{"type":28,"tag":29,"props":664,"children":665},{},[666],{"type":33,"value":667},"S’il y a des années, on prenait en compte les usines, les brevets, les moyens de production dans la valeur d’une société, désormais on prend aussi en compte un actif immatériel : le nombre de personnes qui travaillent sur le produit. Et, selon le marché boursier, ça vaut cher :",{"type":28,"tag":29,"props":669,"children":670},{},[671],{"type":28,"tag":142,"props":672,"children":675},{"href":673,"rel":674},"https://eventuallycoding.com/wp-content/uploads/2021/07/biggestValuations.png",[146],[676],{"type":28,"tag":64,"props":677,"children":679},{"alt":7,"src":678},"/images/biggestValuations-539x1024.png",[],{"type":28,"tag":29,"props":681,"children":682},{},[683],{"type":33,"value":684},"Bref, 5 fois plus de licornes en France, 3 fois plus d’investissement en Europe, c’est beaucoup de boîtes qui cherchent à recruter et dont la croissance en dépend, donc la montée des rémunérations n’est pas prête de s’arrêter. ",{"type":28,"tag":29,"props":686,"children":687},{},[688],{"type":33,"value":689},"Si vous faites partie des entreprises locales, des startups pré série C, des ESN, votre situation risque d’être compliquée. Vous le savez sans doute déjà, les personnes les plus seniors ont tendance à devenir freelance ou à aller dans les entreprises de catégorie 2, 3 et 4. ",{"type":28,"tag":29,"props":691,"children":692},{},[693],{"type":33,"value":694},"Mais est-ce une bulle qui pourrait exploser ? Difficile à dire. Certes les valorisations tech semblent parfois incroyables au vu des chiffres d’affaires de ces boîtes. Il y a très clairement des valorisations qui paraissent abusives, mais qui peut nier que le software a envahi votre vie courante dans ses moindres détails ? La révolution en cours c’est la Data (4), et le Software continue d’en faire partie. Ce serait un thème pour un billet entier donc je vais laisser ce sujet de côté pour l’instant.",{"type":28,"tag":29,"props":696,"children":697},{},[698],{"type":33,"value":699},"-------------------------------",{"type":28,"tag":29,"props":701,"children":702},{},[703],{"type":33,"value":704},"C’est terminé pour ce billet. Comme vous avez pu le lire, lorsqu’on réalise un benchmark sur les salaires il faut être bien conscient du type d’entreprise que l’on compare. Les sociétés où la tech et le produit sont très valorisés sont de plus en plus présentes dans l’écosystème Européen avec un impact qui, s’il était encore faible jusqu’ici, va être de plus en plus significatif dans les années qui viennent. ",{"type":28,"tag":29,"props":706,"children":707},{},[708],{"type":33,"value":709},"Certains rappellent le spectre des années 2000 avec un taux de chômage pour les ingénieurs faible (\u003C 4%), des formations en reconversion qui explosent (5) et une explosion des investissements. Pour autant je trouve le parallèle limité, et même s’il y a des corrections à prévoir, je sens qu’une tendance lourde nous attend encore pour quelques années.",{"type":28,"tag":29,"props":711,"children":712},{},[713],{"type":33,"value":714},"Que vous soyez recruteurs ou recrutés, c’est le moment d’y réfléchir.",{"type":28,"tag":69,"props":716,"children":718},{"id":717},"sources",[719],{"type":33,"value":720},"Sources :",{"type":28,"tag":29,"props":722,"children":723},{},[724],{"type":33,"value":725},"(1) Etudes IESF :",{"type":28,"tag":29,"props":727,"children":728},{},[729,731],{"type":33,"value":730},"2020 : ",{"type":28,"tag":142,"props":732,"children":735},{"href":733,"rel":734},"https://www.iesf.fr/752%5C_p%5C_50488/enquete-nationale.html",[146],[736],{"type":33,"value":737},"https://www.iesf.fr/752\\_p\\_50488/enquete-nationale.html",{"type":28,"tag":29,"props":739,"children":740},{},[741,743],{"type":33,"value":742},"edition 2012 : ",{"type":28,"tag":142,"props":744,"children":747},{"href":745,"rel":746},"https://www.iesf.fr/offres/file%5C_inline%5C_src/752/752%5C_pj%5C_100820%5C_110116.pdf",[146],[748],{"type":33,"value":749},"https://www.iesf.fr/offres/file\\_inline\\_src/752/752\\_pj\\_100820\\_110116.pdf",{"type":28,"tag":29,"props":751,"children":752},{},[753],{"type":33,"value":754},"(2) salaire médian aux US : ",{"type":28,"tag":29,"props":756,"children":757},{},[758],{"type":28,"tag":142,"props":759,"children":762},{"href":760,"rel":761},"https://money.usnews.com/careers/best-jobs/software-developer/salary",[146],[763],{"type":33,"value":760},{"type":28,"tag":29,"props":765,"children":766},{},[767],{"type":28,"tag":142,"props":768,"children":771},{"href":769,"rel":770},"https://www.salary.com/tools/salary-calculator/software-engineer-iii?yrs=8",[146],[772],{"type":33,"value":769},{"type":28,"tag":29,"props":774,"children":775},{},[776],{"type":28,"tag":142,"props":777,"children":780},{"href":778,"rel":779},"http://www.salaryexplorer.com/salary-survey.php?loc=229&loctype=1&job=836&jobtype=3",[146],[781],{"type":33,"value":778},{"type":28,"tag":29,"props":783,"children":784},{},[785],{"type":28,"tag":142,"props":786,"children":789},{"href":787,"rel":788},"https://www.daxx.com/blog/development-trends/it-salaries-software-developer-trends",[146],[790],{"type":33,"value":787},{"type":28,"tag":29,"props":792,"children":793},{},[794],{"type":33,"value":795},"(3) sites d’emplois remote :",{"type":28,"tag":29,"props":797,"children":798},{},[799],{"type":28,"tag":142,"props":800,"children":803},{"href":801,"rel":802},"https://weworkremotely.com/",[146],[804],{"type":33,"value":801},{"type":28,"tag":29,"props":806,"children":807},{},[808],{"type":28,"tag":142,"props":809,"children":812},{"href":810,"rel":811},"https://remoteok.io/",[146],[813],{"type":33,"value":810},{"type":28,"tag":29,"props":815,"children":816},{},[817],{"type":28,"tag":142,"props":818,"children":821},{"href":819,"rel":820},"https://remotive.io/",[146],[822],{"type":33,"value":819},{"type":28,"tag":29,"props":824,"children":825},{},[826],{"type":28,"tag":142,"props":827,"children":830},{"href":828,"rel":829},"https://jeremote.com/",[146],[831],{"type":33,"value":828},{"type":28,"tag":29,"props":833,"children":834},{},[835],{"type":28,"tag":142,"props":836,"children":839},{"href":837,"rel":838},"https://remote.co/remote-jobs/",[146],[840],{"type":33,"value":837},{"type":28,"tag":29,"props":842,"children":843},{},[844],{"type":33,"value":845},"(4) Sur ce thème, je vous invite à lire ce livre. Vous en ressortirez différent (mais un peu flippé)",{"type":28,"tag":29,"props":847,"children":848},{},[849],{"type":28,"tag":142,"props":850,"children":853},{"href":851,"rel":852},"https://www.amazon.fr/I-Plus-Grande-Mutation-lhistoire/dp/271120152X",[146],[854],{"type":33,"value":851},{"type":28,"tag":29,"props":856,"children":857},{},[858],{"type":33,"value":859},"(5) Pour l’anecdote, mon second stage d’école d’ingénieurs, j’étais dans une équipe avec une ex DEA en géologie, une personne avec une maîtrise d’électronique et un ex agent immobilier. La bulle des années 2000 a permis à beaucoup de gens d’entrer dans le secteur informatique qui embauchait à fond. Avant d’exploser…",{"title":7,"searchDepth":861,"depth":861,"links":862},2,[863,864,865,866,873,880,885],{"id":71,"depth":861,"text":74},{"id":132,"depth":861,"text":135},{"id":154,"depth":861,"text":157},{"id":210,"depth":861,"text":213,"children":867},[868,870,871,872],{"id":222,"depth":869,"text":225},3,{"id":275,"depth":869,"text":278},{"id":310,"depth":869,"text":313},{"id":345,"depth":869,"text":348},{"id":391,"depth":861,"text":394,"children":874},[875,876,877,878,879],{"id":407,"depth":869,"text":410},{"id":443,"depth":869,"text":446},{"id":466,"depth":869,"text":469},{"id":482,"depth":869,"text":485},{"id":518,"depth":869,"text":521},{"id":544,"depth":861,"text":547,"children":881},[882,883,884],{"id":550,"depth":869,"text":553},{"id":591,"depth":869,"text":594},{"id":622,"depth":869,"text":625},{"id":717,"depth":861,"text":720},"markdown","content:articles:2021:07:06:les-salaires-dans-la-tech.md","content","articles/2021/07/06/les-salaires-dans-la-tech.md","md",1699796109578]