[{"data":1,"prerenderedAt":136},["Reactive",2],{"/articles/2016/12/16/hopwork-is-coming":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"date":11,"categories":12,"tags":14,"img":18,"cover":19,"readingTime":20,"body":25,"_type":131,"_id":132,"_source":133,"_file":134,"_extension":135},"/articles/2016/12/16/hopwork-is-coming","16",false,"","Hopwork is coming","Peut être que vous l'avez déjà lu sur Twitter, Hopwork vient de passer un nouveau cap. En effet je suis plutôt heureux d'annoncer que nous venons de f...","1301","2016-12-16",[13],"waza",[15,16,17],"malt","levee-de-fonds","startup","27417-1_e2xgczrsmihdhiq-sq82qg1.jpeg","cover4.jpg",{"text":21,"minutes":22,"time":23,"words":24},"4 min read",3.295,197700,659,{"type":26,"children":27,"toc":128},"root",[28,47,56,61,76,81,86,100,105,114],{"type":29,"tag":30,"props":31,"children":32},"element","p",{},[33,36,45],{"type":34,"value":35},"text","Peut être que vous l'avez déjà lu sur Twitter, Hopwork vient de passer un nouveau cap. En effet je suis plutôt heureux d'annoncer que nous venons de finir ",{"type":29,"tag":37,"props":38,"children":42},"a",{"href":39,"rel":40},"https://www.maddyness.com/finance/2016/12/15/rh-hopwork-leve-5-millions-euros/",[41],"nofollow",[43],{"type":34,"value":44},"une levée de fonds de 5M d'€",{"type":34,"value":46}," pour financer nos futurs investissements. (*)",{"type":29,"tag":30,"props":48,"children":49},{},[50],{"type":29,"tag":51,"props":52,"children":55},"img",{"alt":53,"src":54},"1_e2xgczrsmihdhiq-sq82qg1","/images/27417-1_e2xgczrsmihdhiq-sq82qg1.jpeg",[],{"type":29,"tag":30,"props":57,"children":58},{},[59],{"type":34,"value":60},"Hopwork c'est pas mal d'histoires amusantes. Tout d'abord, ca ressemble un peu à une blague. Vous savez le type qui vient vous proposer de construire Facebook/Airbnb/Google en peu de temps sur votre temps libre en échanges de parts. Le genre de projet que jamais personne ne prend. Mais pour JB et moi cette fois là ca ressemblait à ça :",{"type":29,"tag":30,"props":62,"children":63},{},[64,74],{"type":29,"tag":37,"props":65,"children":68},{"href":66,"rel":67},"http://eventuallycoding.com/wp-content/uploads/2016/12/16eac-20040102193808_271.jpg",[41],[69],{"type":29,"tag":51,"props":70,"children":73},{"alt":71,"src":72},"20040102193808_271","/images/16eac-20040102193808_271.jpg",[],{"type":34,"value":75}," Pour le coup, on peut vraiment dire que Hopwork c'est une question de timing et d'opportunité. Quelques mois plus tôt ou plus tard, dans d'autres conditions, Hopwork se serait peut être fait mais d'une autre façon. C'était le bon moment, le bon lieu. Et il y en a eu d'autres des rencontres et des lieux, Paris, Barcelone, Montpellier, Bordeaux, Porto, Lyon, les Arcs et j'en passe, vraiment...",{"type":29,"tag":30,"props":77,"children":78},{},[79],{"type":34,"value":80},"Cette première rencontre c'était en 2012. Quatre ans plus tard la société c'est 30 personnes, plusieurs investisseurs qui croient en nous, des dizaines de milliers d'inscrits et de sacrés défis à relever pour 2017.",{"type":29,"tag":30,"props":82,"children":83},{},[84],{"type":34,"value":85},"Au tout début d'Hopwork j'étais loin de me douter du temps et de l'énergie que cela me prendrait par la suite. Je ne dois pas être le seul, on m'a déjà posé la question \"Mais une fois que le site est fait, ça doit rouler tout seul non ? Pourquoi tu continues pas des missions en freelance ?\" Eh bien Hopwork c'est une dizaine de personnes qui ne s'occupent que du produit tout les jours et l'équipe va encore grandir en 2017 (**).",{"type":29,"tag":30,"props":87,"children":88},{},[89,91,98],{"type":34,"value":90},"Si on reste très terre à terre, Hopwork c'est de multiples briques techniques, du paiement, de la recherche, de belles interfaces, de la sécurité, de la performance, un back office, de la BI, des apis externes etc... En 2017 c'est des changements sans doute important pour s'installer sur des marchés étrangers, l'Espagne et le Bénélux. Mais ce serait réducteur de s'arrêter à cela. C'est aussi un métier à changer. Tout n'est pas neuf mais il y a beaucoup à réinventer. En tant qu'ex freelance je connais les éceuils à éviter, les barrières à faire tomber et l'effort que cela représente. Apporter de la transparence, accompagner une société qui change vis à vis de sa relation au travail, aider des freelances de plus en plus nombreux, et le faire de façon vertueuse en s'efforcant d'aider chaque partie. C'est difficile mais super intéressant. Vincent (celui qui savait pas que c'était impossible) ",{"type":29,"tag":37,"props":92,"children":95},{"href":93,"rel":94},"https://medium.com/@vhuguet/hopwork-raises-5m-future-of-work-is-here-and-its-beautiful-efc817e81607#.yg38bpt8z",[41],[96],{"type":34,"value":97},"en parle mieux que moi",{"type":34,"value":99},", donc je ne vais pas m'attarder là dessus. C'est aussi des supers défis humains pour aider à constituer une équipe et faire en sorte que tout le monde bosse ensemble dans de bonnes conditions. Accessoirement c'est être capable de décoder le morse quand on discute via hangout entre Lyon et Paris en passant par le wifi.",{"type":29,"tag":30,"props":101,"children":102},{},[103],{"type":34,"value":104},"Bref, tout cela m'occupe beaucoup, c'est la raison qui me fait moins écrire sur mon blog, le dernier billet remonte à 5 mois. Les défis de 2017 ne manquent pas donc pas sûr que cela s'améliore. Je suis très content de bosser avec les gens qui constituent l'équipe et on a encore tellement de choses à améliorer. Ca va être fun. On n'imagine pas toujours le fossé entre l'idéal tel qu'on peut le lire dans un billet de blog et l'effort nécessaire pour y arriver. Et je peux vous dire qu'on a encore du chemin. Mais ça ce serait moins drôle s'il y avait rien à faire.",{"type":29,"tag":30,"props":106,"children":107},{},[108],{"type":29,"tag":109,"props":110,"children":111},"strong",{},[112],{"type":34,"value":113},"Vivement la suite.",{"type":29,"tag":30,"props":115,"children":116},{},[117,119,126],{"type":34,"value":118},"(*) Besoin de comprendre comment fonctionne une levée de fonds ? ",{"type":29,"tag":37,"props":120,"children":123},{"href":121,"rel":122},"http://www.eventuallycoding.com/index.php/les-levees-de-fond-en-startup/",[41],[124],{"type":34,"value":125},"C'est ici",{"type":34,"value":127},". (**) Ce décalage entre la perception que l'on a du travail que cela devrait prendre et l'énergie que cela prend réellement est un sujet très vaste et très intéressant. Pas impossible que je développe ce point sur un autre billet, voire lors d'une rencontre physique (conf) si cela intéresse.",{"title":7,"searchDepth":129,"depth":129,"links":130},2,[],"markdown","content:articles:2016:12:16:hopwork-is-coming.md","content","articles/2016/12/16/hopwork-is-coming.md","md",1699949904264]