{"_path":"/articles/2020/09/21/les-metiers-de-lingenierie-informatique-vont-ils-disparaitre","_dir":"21","_draft":false,"_partial":false,"_locale":"","_empty":false,"title":"les métiers de l'ingénierie informatique vont-ils disparaitre ?","description":"Ok le titre est un peu putaclick :)   Mais je ne lance pas ce sujet par hasard.   J'ai lu récemment plusieurs très bons articles sur ce thème   [Je fa...","id":"1606","date":"2020-09-21","categories":["waza"],"tags":["nocode"],"img":"Strip-Les-specs-cest-du-code-650-final.jpg","cover":"cover3.jpg","readingTime":{"text":"9 min read","minutes":8.15,"time":489000,"words":1630},"body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ok le titre est un peu putaclick :)"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nMais je ne lance pas ce sujet par hasard."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nJ'ai lu récemment plusieurs très bons articles sur ce thème"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"element","tag":"a","props":{"href":"https://www.emaxilde.net/posts/2020/07/18/je-fais-partie-d-une-espece-menacee-d-extinction.html","rel":["nofollow"]},"children":[{"type":"text","value":"Je fais partie d'une espèce en voie d'extinction"}]},{"type":"element","tag":"br","props":{},"children":[]},{"type":"element","tag":"a","props":{"href":"https://blog.zwindler.fr/2020/07/29/au-secours-le-metier-dops-va-disparaitre/","rel":["nofollow"]},"children":[{"type":"text","value":"Au secours le métier d'ops va disparaitre"}]},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\net celui que j'ai sans doute préféré : "},{"type":"element","tag":"a","props":{"href":"https://www.emaxilde.net/posts/2020/08/01/l-alignement-de-l-esprit-importe-plus-que-celui-du-code.html","rel":["nofollow"]},"children":[{"type":"text","value":"l'alignement de l'esprit importe plus que celui du code"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Or c'est un sujet qui me parle car je suis arrivé sur le marché au même moment que l'approche "},{"type":"element","tag":"a","props":{"href":"https://fr.wikipedia.org/wiki/Model_driven_architecture","rel":["nofollow"]},"children":[{"type":"text","value":"MDA"}]},{"type":"text","value":" (2001)"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nCette approche faisait le buzz à ce moment là, enfin pour autant que ce soit possible sans réseaux sociaux, blogs etc…"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nPour simplifier, cette méthode avait pour objectif de modéliser entièrement des applications à base de schémas UML, schémas qui permettent ensuite de générer le code de l'application."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nSur le papier, c'était convaincant pour un jeune diplômé et j'avais été tenté de regarder en détail à l'époque."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nMais les outils donnés et leurs limitations n'ont jamais permis à cette approche de décoller."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En 2016 (donc bien longtemps après) commitstrip sortait cette image qui résumait plutôt bien MDA :"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"Strip-Les-specs-c'est-du-code-(650-final)","src":"/images/Strip-Les-specs-cest-du-code-650-final.jpg"},"children":[]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://www.commitstrip.com/fr/2016/08/25/a-very-comprehensive-and-precise-spec","rel":["nofollow"]},"children":[{"type":"text","value":"https://www.commitstrip.com/fr/2016/08/25/a-very-comprehensive-and-precise-spec"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Bref, pas d'inquiétude pour le métier de développeur ?"}]},{"type":"element","tag":"h2","props":{"id":"simplification-ou-complexification"},"children":[{"type":"text","value":"Simplification ou complexification ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"C'est une question loin d'être répondue. De très nombreuses tâches d'ingénierie sont désormais bien plus simples qu'avant."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nEst-ce qu'on se plaindra de ne plus développer sur cartes perforées ? Ou d'attendre des listings de compilation sur MVS ?"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nCombien utilise des générateurs de code pour des formulaires de back office, des schémas SQL etc… ?"},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nCombien ont utilisé des frameworks \"haute productivité\" ? Si l'expression n'est plus trop utilisée, rappelez vous des Grails, Play Framework, Spring Roo, tous des adaptations de ce qui existait déjà avec Rails et Django."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Le ticket d'entrée a grandement chuté pour réaliser des applications. Que ce soit via les outils actuels (IDE, frameworks), les plateformes de run (PAAS, DBAAS, SAAS), les pratiques qui sont plus matures (CI, CD) ou tout simplement l'open source qui a permis de mettre en commun des trésors d'ingénierie."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Paradoxalement il y a donc deux sentiments dans ce métier qui semblent s'opposer :"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"nous sommes tous globalement plus productifs qu'avant pour réaliser les mêmes tâches"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"un fort sentiment de \"fatigue\" (cf javascript fatigue) où malgré une veille constante et poussée il est devenu impossible de suivre toutes les évolutions technologiques"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ce paradoxe s'explique, si en effet nous sommes plus productifs et que l'industrie du logiciel est plus efficace, cela a aussi renforcé la demande en programmes informatiques et la complexité générale qui en résulte pour répondre à des problèmes toujours plus variés."}]},{"type":"element","tag":"h2","props":{"id":"luddisme-et-sophisme-luddite"},"children":[{"type":"text","value":"Luddisme et sophisme luddite"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"C'est une des thèses défendu par ce que nous pourrons appeler les techno-optimistes : "},{"type":"element","tag":"a","props":{"href":"https://fr.wikipedia.org/wiki/Ch%C3%B4mage_technologique#Sophisme_Luddite","rel":["nofollow"]},"children":[{"type":"text","value":"le sophisme luddite"}]},{"type":"text","value":" qui dit globalement que si le progrès technologique à court terme peut provoquer des pertes d'emploi, sur le long terme il ne faut pas négliger les "},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"effets de compensation"}]},{"type":"text","value":" qui résulte des "},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"opportunités"}]},{"type":"text","value":" créées par ces progrès."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mais tout le monde ne partage pas ce point de vue. Je vais paraphraser Wikipedia sur le même chapitre pour exposer leur raisonnement :"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"les machines (programmes) peuvent effectuer des tâches faciles."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Le périmètre de ce qui est considéré comme facile évolue à mesure que nos connaissances s'améliorent et évolue vite"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"le travail humain qui dépasse le \"facile\" nécessite de plus en plus des compétences cognitives fortes réservant le travail à une minorité de personnes"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Lorsque l'automatisation des tâches simples va plus vite que la détection de nouvelles opportunités (2 va plus vite que 3) alors on détruit de l'emploi."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Faisons un petit exercice et effectuons le parallèle avec l'automobile."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nL'automobile est au départ (avant 1910) réalisé par des artisans très qualifiés, en petite série."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nLes méthodes de travail évoluent et permettent des productions en grande série grace à un morcellement du travail en petites tâches simples."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nLes tâches simples vont finir par progressivement être automatisé."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Si je grossissais le trait, on est passé d'une petite population d'artisans, à une grosse population d'ouvriers, progressivement remplacé par des machines conçus par une petite poignée d'ingénieurs."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nSur le long terme, l'industrie automobile, et celle du transport en général, va créer de nombreux autres métier et révolutionner l'activité humaine, créant donc de nombreux emplois mais pas dans le secteur de la production automobile lui-même."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"Avertissement : C'est un exercice purement théorique et je n'ai pas vérifié ces assertions avec des chiffres. Il est possible que la forte demande en voiture notamment dans les pays émergents, les ruptures technologiques (voiture thermique vs voiture hybride vs voiture électrique, voiture autonome), les multiples incitations à renouveler le parc automobile fasse que nous soyons toujours dans une phase où les effets de compensation entrainent toujours une hausse de l'emploi dans le secteur. Cf "},{"type":"element","tag":"a","props":{"href":"https://www.bilan.ch/economie/lindustrie-automobile-mondiale-en-7-chiffre","rel":["nofollow"]},"children":[{"type":"text","value":"cet article"}]},{"type":"text","value":" qui semble montrer que l'industrie se porte bien."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En bref, l'innovation a créé des emplois, en a remplacé et créé d'autres indirectement par effets d'opportunités."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nEst ce que la somme des emplois créés est supérieur et/ou sera supérieure dans le futur, la question est plus difficile."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nCa vous rappellerait pas la "},{"type":"element","tag":"a","props":{"href":"https://fr.wikipedia.org/wiki/Destruction_cr%C3%A9atrice","rel":["nofollow"]},"children":[{"type":"text","value":"théorie de la destruction créatrice de Schumpeter"}]},{"type":"text","value":" ?"}]},{"type":"element","tag":"h2","props":{"id":"linformatique-au-coeur-dune-destruction-créatrice"},"children":[{"type":"text","value":"L'informatique au coeur d'une destruction créatrice ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Si on revient à l'informatique on peut observer les mêmes phénomènes. D'une informatique réservé à quelques personnes dans les années 60/80, on est arrivé à une production massive de logiciels."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nNotre maitrise du domaine a permis de remplacer progressivement des tâches et menace probablement quelques métiers. Mais les effets d'opportunités compensent toujours."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Le point marquant de la numérisation (la dématérialisation comme on l'appelait avant) c'est qu'elle touche aux emplois de nombreuses autres professions. De fait elle accélère significativement le déséquilibre entre créations d'opportunités et destructions d'emplois."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La période qui s'ouvre avec l'essor de l'IA va encore plus accentuer ce déséquilibre, dans tous les métiers, y compris les plus qualifiés. Et ce qui est assez différent des révolutions technologiques précédentes c'est la vitesse de destruction (la fameuse "},{"type":"element","tag":"a","props":{"href":"https://fr.wikipedia.org/wiki/Singularit%C3%A9_technologique","rel":["nofollow"]},"children":[{"type":"text","value":"singularité technologique"}]},{"type":"text","value":")."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nSur ce point je paraphrase "},{"type":"element","tag":"a","props":{"href":"https://www.emaxilde.net/posts/2020/08/01/l-alignement-de-l-esprit-importe-plus-que-celui-du-code.html","rel":["nofollow"]},"children":[{"type":"text","value":"le billet d'Olivier Poncet"}]},{"type":"text","value":" et je m'en excuse. Mais n'hésitez pas à aller le lire."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Bref, \"les métiers de l'ingénierie informatique vont-ils disparaitre ?\", eh bien sur leurs formes actuelles, je ne serais pas surpris. De la même façon qu'un informaticien des années 80 ou 90 serait bien dépaysé aujourd'hui. Ce n'est pas tant des disparitions que des évolutions."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Je serais bien en peine de savoir à quoi ressemblera ces métiers ou les nouveaux métiers qui seront créés d'ici 2040."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Il existe plein de possibilités, certaines plus réjouissantes que d'autres."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nSi on considérait par exemple que notre capacité à créer de nouveaux usages, de nouvelles opportunités devait aller significativement moins vite que notre capacité à automatiser les tâches simples (Cf plus haut le chapitre sur le luddisme), alors nous pourrions atteindre un effet de seuil sur les créations d'emplois et avoir une petite portion d'experts qui travaillerait sur des outils massivement utilisés par de nombreuses personnes. Personnes qui se focaliseront d'avantage sur le métier que la technique. En gros, une petite population d'experts au service d'une grande population d'intégrateurs (des assembleurs de briques lego)."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Attention, ne lisez pas de travers. Ce ne serait pas forcément négatif. Il y aurait toujours une expertise à avoir, il faudrait comprendre son métier, comprendre s'il existe des briques sur étagères qui peuvent vous aider, comprendre leurs limitations, proposer des palliatifs. Il y a des enjeux de conception de systèmes, de flux d'informations. L'ingénierie a encore de beaux jours devant elle. Mais elle pourrait avoir une forme différente."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"A l'inverse si on considère que nous sommes très loin d'avoir atteint un pic sur nos capacités d'innovations, alors toutes les simplifications/automatisations actuelles vont conduire pendant encore longtemps à créer de nouveaux types d'emplois et de spécialités."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nVoyons cela comme de multiples branches qui vont partir des mêmes racines. On commence déjà à parler de certains nouveaux métiers : search engineer, dataops, machine learning engineer, développeur VR etc… Ce sera cependant de plus en plus complexe de maitriser tout les aspects de création d'un logiciel (le fameux mythe du fullstack), de faire les bons choix en début de carrière ou de pivoter en cours de carrière."}]},{"type":"element","tag":"h2","props":{"id":"cest-un-peu-lhistoire-du-nocode-non"},"children":[{"type":"text","value":"C'est un peu l'histoire du nocode non ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Si vous ne savez pas ce que c'est que le nocode, c'est exactement cela, des logiciels créés par une poignée d'experts qui permettent de donner des outils simples à une majorité de gens."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nPour avoir une intro plus complète : "},{"type":"element","tag":"a","props":{"href":"https://blog.hosakka-stud.io/cest-quoi-le-nocode/","rel":["nofollow"]},"children":[{"type":"text","value":"lire ce billet"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Aujourd'hui les outils nocode permettent de lancer de très nombreux services sans savoir coder."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nJe vous invite à regarder ce site qui recense quelques outils nocode: "},{"type":"element","tag":"a","props":{"href":"https://quels-outils-nocode.fr/","rel":["nofollow"]},"children":[{"type":"text","value":"Quels outils no code ?"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Pour beaucoup de développeurs je suis sûr que le nocode est vu avec méfiance ou arrogance. Mais si c'est votre cas, je vous invite à plus d'humilité et de curiosité."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nVous mêmes vous utilisez des services de plus en plus évolués qui vous ont évité de devoir devenir expert en cartographie (google maps), moteur de recherche pour du e-commerce (Algolia) etc… Alors ne soyez pas surpris qu'il en soit de même pour créer une landing page, automatiser le traitement d'un formulaire pour alimenter une base de contacts et j'en passe."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nEt c'est une bonne nouvelle. Cela permet a de nombreux entrepreneurs de lancer des services plus simplement. Cela permet à des services marketing ou commerciaux d'être plus autonomes."}]},{"type":"element","tag":"h2","props":{"id":"evolution-de-nos-rôles-de-leaders-techniques"},"children":[{"type":"text","value":"Evolution de nos rôles de leaders techniques"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En tant que leader technique mon métier évolue. J'ai une obligation de veille constante pour comprendre le panorama technologique et les opportunités exploitables pour le métier de mon entreprise."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nJe dois constamment chercher le bon curseur entre simplicité et besoin de personnalisation et de savoir quand cette personnalisation va être un vrai facteur différentiant au point de justifier un développement maison. Bref, je dois éviter de faire de l'ingénierie pour faire de l'ingénierie mais je dois rechercher la valeur que cela peut créer. Et le nocode dans son ensemble doit faire partie de notre scope de veille et de notre gamme d'outils à disposition."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Sur le fameux make or buy je vous recommande chaudement cette présentation de Julien Lemoine CTO d'Algolia :"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://www.youtube.com/watch?v=fm%5C_tMvOMXb8","rel":["nofollow"]},"children":[{"type":"text","value":"https://www.youtube.com/watch?v=fm\\_tMvOMXb8"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Bon et puisqu'il faut conclure. Gardez toujours la tête hors de l'eau, demandez-vous ce que vous pouvez apporter en dehors de votre expertise technique spécifique et soyez ouvert au changement."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"a+"}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"simplification-ou-complexification","depth":2,"text":"Simplification ou complexification ?"},{"id":"luddisme-et-sophisme-luddite","depth":2,"text":"Luddisme et sophisme luddite"},{"id":"linformatique-au-coeur-dune-destruction-créatrice","depth":2,"text":"L'informatique au coeur d'une destruction créatrice ?"},{"id":"cest-un-peu-lhistoire-du-nocode-non","depth":2,"text":"C'est un peu l'histoire du nocode non ?"},{"id":"evolution-de-nos-rôles-de-leaders-techniques","depth":2,"text":"Evolution de nos rôles de leaders techniques"}]}},"_type":"markdown","_id":"content:articles:2020:09:21:les-metiers-de-lingenierie-informatique-vont-ils-disparaitre.md","_source":"content","_file":"articles/2020/09/21/les-metiers-de-lingenierie-informatique-vont-ils-disparaitre.md","_extension":"md"}