{"_path":"/articles/2020/08/07/bataille-autour-des-donnees-et-du-cloud","_dir":"07","_draft":false,"_partial":false,"_locale":"","_empty":false,"title":"Bataille autour des données et du Cloud","description":"![](/images/Ligne_maginot-1024x838.jpg)\nCe billet fait partie d’une série dont vous pourrez lire [l’introduction ici](https://eventuallycoding.com/20...","id":"1571","date":"2020-08-07","categories":["waza"],"tags":["startup","tech","ecosysteme","RGPD"],"img":"Ligne_maginot-1024x838.jpg","cover":"cover2.jpg","readingTime":{"text":"16 min read","minutes":15.73,"time":943800,"words":3146},"body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"","src":"/images/Ligne_maginot-1024x838.jpg"},"children":[]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ce billet fait partie d’une série dont vous pourrez lire "},{"type":"element","tag":"a","props":{"href":"https://eventuallycoding.com/2020/08/03/leurope-entre-le-marteau-chinois-et-lenclume-us/","rel":["nofollow"]},"children":[{"type":"text","value":"l’introduction ici"}]},{"type":"text","value":"."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Le fil rouge global de cette série tourne autour du livre "},{"type":"element","tag":"a","props":{"href":"https://livre.fnac.com/a13452637/Kai-Fu-Lee-I-A-La-Plus-Grande-Mutation-de-l-histoire","rel":["nofollow"]},"children":[{"type":"text","value":"\"IA La plus grande mutation de l'histoire\" de Kai-Fu Lee"}]},{"type":"text","value":", livre très bien écrit que je vous résume dans ce premier billet."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"L’auteur aborde beaucoup la question des données, c’est le point central à l’origine de la révolution de l’IA et dans ce second billet je souhaitais aborder le sujet de la bataille autour des données mais aussi autour du Cloud, ce fameux cloud souverain."}]},{"type":"element","tag":"h2","props":{"id":"la-rgpd"},"children":[{"type":"text","value":"la RGPD "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La RGPD est apparu en 2016 et a eu pour vocation d'harmoniser les réglementations Européennes sur le sujet de la protection des données personnelles. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"L'avantage pour une entreprise Française est donc d'avoir, pour une fois, un cadre législatif identique au sein de la communauté lui permettant d'éviter de devoir réadapter son produit pour chaque pays membres."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et de protection des données à protectionnisme il n’y a qu’un pas. La RGPD est aussi une arme législative, qui se veut un peu subtile, brandie pour gêner les géants Américains et Chinois. "}]},{"type":"element","tag":"h3","props":{"id":"la-rgpd-sous-langle-des-utilisateurs"},"children":[{"type":"text","value":"La RGPD sous l’angle des utilisateurs"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En tant qu'utilisateur, la RGPD ne m'a pas facilité la vie. Je suis passé du bandeau d'acceptation des cookies, un peu pénible, à des bandeaux encore plus complexes me demandant de sélectionner les cookies un par un, à chaque visite. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Cela a globalement dégradé mon expérience utilisateur, "},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"surtout sur mobile"}]},{"type":"text","value":" !"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En fin de compte, j'utilise Ghostery et Adblock Plus qui sont bien plus efficaces pour bloquer le tracking en ligne. Selon moi depuis le début il aurait fallu généraliser des solutions logicielles sur le navigateur pour que l'utilisateur choisisse globalement ce qu'il accepte ou non plutôt que de "},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"pourrir"}]},{"type":"text","value":" la navigation de l'internaute sur chaque site. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"C'était un peu l'esprit de "},{"type":"element","tag":"a","props":{"href":"https://fr.wikipedia.org/wiki/Do_Not_Track","rel":["nofollow"]},"children":[{"type":"text","value":"Do Not Track"}]},{"type":"text","value":", aujourd'hui obsolète. Mais dans les faits les sites n'ont pas suivi en terme d'implémentation. Le plugin a l'avantage de ne pas laisser le choix aux sites."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et surtout, malgré toutes mes protections, je suis tout autant spammé qu'avant de démarchage téléphonique et de spams emails. Toutes les boîtes se prévalent de l'intérêt légitime pour m'envoyer leurs pubs. Par exemple les entreprises de pose de fenêtre se cachent derrière des dispositifs d'information gouvernemental. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Autrement dit, pas sûr malgré un processus très intrusif et gênant qu'on y ait gagné quelque chose de ce côté là. Bref, je n'ai rien gagné en tant qu'internaute et consommateur. Je caricature, on est censé y avoir gagné une meilleure compréhension de l'usage de nos données. En pratique ca reste très complexe et sujet à interprétation."}]},{"type":"element","tag":"h3","props":{"id":"la-rgpd-sous-langle-du-cto"},"children":[{"type":"text","value":"La RGPD sous l’angle du CTO"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En tant que CTO, j'y vois par contre des points positifs. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mon plus grand bémol c'est la grande possibilité d'interprétation des règles de la RGPD et ces très régulières mises à jour. Il y a presque autant de DPO que d'interprétation. Et les changements fréquents, comme par exemple "},{"type":"element","tag":"a","props":{"href":"https://trends.levif.be/economie/entreprises/le-privacy-shield-est-mort-ce-que-ca-change-pour-votre-entreprise/article-opinion-1315113.html?cookie_check=1596033691","rel":["nofollow"]},"children":[{"type":"text","value":"la remise en cause récente du privacy shield"}]},{"type":"text","value":" (et du Safe Harbor avant lui), entraîne un certain flou préjudiciable pour les entreprises qui doivent s'adapter à ces changements avec des conséquences très importantes pour ce cas précis."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mais comme je le disais, c'est un standard Européen, donc cela baisse le coût à l'entrée pour faire du commerce entre états membres. Et on l’a vu dans le premier billet, la fragmentation de notre marché Européen est un sacré souci. Avoir au moins un standard commun est plutôt une bonne chose."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Au delà de ça, cette norme en terme de sécurité a fait avancer les choses dans les entreprises en posant un cadre. On pourrait dire que majoritairement ce cadre relève du bon sens : faire la liste de ces fournisseurs, de ces transferts de données ou juste d'avoir des règles d'accès et un meilleur contrôle des accès aux données. Mais le bon sens n’est pas toujours bien partagé. Et surtout c'était avant un sujet purement IT et il fallait un peu prêcher dans le vent pour ca. La RGPD a permis aux DSI d’avoir un argument d’autorité pour se faire entendre plus facilement sur le sujet sécuritaire. "}]},{"type":"element","tag":"h3","props":{"id":"une-protection-qui-se-veut-protectionniste"},"children":[{"type":"text","value":"Une protection qui se veut protectionniste"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Si je suis donc plutôt satisfait de cette réglementation pour les entreprises, et très insatisfait en tant que consommateur, je ne peux qu'inviter le régulateur à une certaine prudence sur ces moyens d’actions et ces intentions. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La RGPD est aussi une arme économique. Si on regarde au delà de son intention première, l’Europe avec cette législation introduit une barrière pour les pays qui veulent opérer sur son territoire avec cette loi qui se veut extraterritoriale. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Donc, est-ce qu'on peut voir la RGPD comme une forme de protection d'une richesse nationale ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Eh bien, pas loin. Bien sûr avant tout c'est une forme de protection des données personnelles, de vous, de moi. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mais rappelons le, et c’est le sujet du livre de Kai-Fu Lee, les données sont le pétrole du 21eme siècle. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Pour l’Europe la RGPD est tout autant une directive forte sur la façon dont on souhaite imposer notre vision sur les usages autour de la donnée, qu’une arme économique pour gêner cette collecte ou la réserver aux entreprises Européennes. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Je re cite ce que j’indiquais dans le billet précédent, les données vont permettre d'améliorer encore et encore les algorithmes de recommandation, de calcul d'attribution de prêt bancaire, de ciblage publicitaire, de conduite de véhicules autonomes, de prédiction de trafic, de traduction temps réel etc... "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Plus une entreprise a de données, plus elle gagne d’argent. Avec cet argent elle investit en R&D, ce qui améliore la qualité de ses services et lui permet de creuser son avantage concurrentiel. Cet avantage concurrentiel se traduit par plus d’utilisateurs, et donc plus de données et le cercle vertueux continue. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La création de barrière devant les données est une forme de protectionnisme économique aussi, voire même de souveraineté dans certains cas (Cf l’affaire "},{"type":"element","tag":"a","props":{"href":"https://fr.wikipedia.org/wiki/Cambridge_Analytica","rel":["nofollow"]},"children":[{"type":"text","value":"Cambridge Analytica"}]},{"type":"text","value":")"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Si on reprend notre fil rouge, le livre “IA la plus grande mutation de l’histoire”, tous les enjeux tourne autour de la collecte des données et de la capacité à les utiliser pour créer de nouveaux usages ou améliorer des usages existants. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ce protectionnisme non assumé officiellement est cependant une arme à double tranchant."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ces dernières années on a beaucoup parlé d’amendes record sur "},{"type":"element","tag":"a","props":{"href":"https://www.cnil.fr/fr/la-formation-restreinte-de-la-cnil-prononce-une-sanction-de-50-millions-deuros-lencontre-de-la","rel":["nofollow"]},"children":[{"type":"text","value":"Google"}]},{"type":"text","value":" ou "},{"type":"element","tag":"a","props":{"href":"https://www.lefigaro.fr/secteur/high-tech/2017/05/16/32001-20170516ARTFIG00118-la-cnil-condamne-facebook-a-150000-euros-d-amende.php","rel":["nofollow"]},"children":[{"type":"text","value":"Facebook"}]},{"type":"text","value":". Il faut relativiser. Je n’ai pas trouvé de chiffres mais par définition les contrôles sur place de la CNIL se font majoritairement en France. Le risque étant qu’on aille d’abord pénaliser des acteurs Français/Européens, laissant le champ libre aux concurrents US qui n’avaient pas forcément besoin de cet avantage supplémentaire. Rappelons-nous par exemple des startups Teemo, Vectaury et Fidzup dont les mises en demeure publique ont radicalement freiné leur développement. Et une de ces boites "},{"type":"element","tag":"a","props":{"href":"https://www.lebigdata.fr/fidzup-faillite-rgpd","rel":["nofollow"]},"children":[{"type":"text","value":"a même dû fermer ces portes"}]},{"type":"text","value":". Ces dossiers auraient peut être gagné à être traité plus discrètement. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En filigrane, également, il y a la question des moyens à mettre en oeuvre. Le marché Européens est globalement moins bien financé que le marché US. Cela se traduit par des ressources moindres à allouer sur le sujet de la conformité réglementaire. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"A chaque fois que la RGPD évolue (comme par exemple avec l’affaire récente sur le privacy shield) et qu’elle se complexifie, les impacts sur les entreprises Françaises sont plus importantes que sur les entreprises US en ratio de leurs ressources financières."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dit autrement, un Google ou un Alibaba qui a passé ces 20/30 dernières années à créer des boîtes solides et massivement internationales peuvent plus facilement investir des ressources pour s’adapter à ces législations. Si on ajoute à cela une possibilité de contrôle plus grande et des sanctions, comme la mise en demeure publique, qui n’ont d’impact que sur notre marché local, le risque est grand de se mettre des balles dans le pied très fréquemment."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et le pire, c’est que comme ce protectionnisme n’est pas assumé, en pratique l’administration continue à utiliser massivement des outils US et Chinois. Par exemple "},{"type":"element","tag":"a","props":{"href":"https://itsocial.fr/actualites/partenariat/lorganisation-des-jeux-olympiques-de-paris-2024-opte-pour-le-cloud-dali-baba/","rel":["nofollow"]},"children":[{"type":"text","value":"Paris 2024 vient de décider d’utiliser AliBaba pour les futurs jeux"}]},{"type":"text","value":"."}]},{"type":"element","tag":"h2","props":{"id":"et-dans-les-autres-pays"},"children":[{"type":"text","value":"Et dans les autres pays ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Pour la Chine, le protectionnisme se traduit autrement, il y a des règles d’implantation assez contraignantes pour qu’une entreprise opère en Chine, et bien sûr une localisation et une adaptation à un marché culturellement très différent. Ce protectionnisme qui a bien d'autres visages (corruption, dumping etc...) fait que la Chine n'est toujours pas considéré comme une économie de marché par l'OMC."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Côté US, on cite souvent le Patriot Act. Cette loi parle aussi des données mais dans un contexte uniquement de lutte anti terroriste à l’origine. Il n’y a aucune référence à la protection des données. La grande particularité de cette loi (et du Cloud Act), comme pour le RGPD, c’est son extra territorialité, c’est à dire que cette loi s’applique, à toute entreprise américaine même au delà de ses frontières et quelque soit la réglementation locale. Le Patriot act inquiète car il permet en théorie un accès et "},{"type":"element","tag":"a","props":{"href":"https://www.challenges.fr/tribunes/comment-le-patriot-act-permet-d-espionner-les-entreprises-francaises_111724","rel":["nofollow"]},"children":[{"type":"text","value":"une lecture de documents industriels"}]},{"type":"text","value":" d’entreprises Françaises sans demande préalables et sans notifications et sans tenir compte de nos propres protections. Entre ça "},{"type":"element","tag":"a","props":{"href":"https://www.carnetsdubusiness.com/Souverainete-du-dollar-et-violation-d-embargos-134-milliard-d-amende-pour-la-Societe-generale_a1965.html","rel":["nofollow"]},"children":[{"type":"text","value":"et la souveraineté du dollar"}]},{"type":"text","value":" qui permet aux US d'interférer dans les transactions financières des autres pays, on peut dire qu'ils ont les outils pour assoir leur domination."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mais les récentes affaires nous donnent d’autres éclairages très intéressants sur le protectionnisme américain."}]},{"type":"element","tag":"h3","props":{"id":"huawei"},"children":[{"type":"text","value":"Huawei"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ce qu’on voit aujourd’hui autour de de l’affaire "},{"type":"element","tag":"a","props":{"href":"https://www.numerama.com/politique/624110-donald-trump-prive-huawei-de-google-play-sur-ses-smartphones-jusquen-2021.html","rel":["nofollow"]},"children":[{"type":"text","value":"Huawei"}]},{"type":"text","value":" c’est l’illustration de ces sujets autour des données. Les USA soupçonnent un espionnage lié aux infrastructures télécom et notamment 5G en cours de mise en place par Huawei et ont donc placé l’entreprise sur liste noire."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Est-ce fondé ? Difficile à dire. C’est sans doute aussi un sujet de souveraineté nationale pour un pays qui voit son infrastructure tourner pavillon Chinois."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ne soyons pas naïf, l’espionnage n’est pas un mythe, chaque état à ses propres fers de lance dans ce domaine, même auprès de ces partenaires, "},{"type":"element","tag":"a","props":{"href":"https://www.lemondeinformatique.fr/actualites/lire-scandale-de-la-nsa-le-patron-de-cisco-fait-la-lecon-a-obama-57508.html","rel":["nofollow"]},"children":[{"type":"text","value":"CISCO"}]},{"type":"text","value":" et "},{"type":"element","tag":"a","props":{"href":"https://www.numerama.com/magazine/29353-nsa-routeurs-serveurs-backdoor.html","rel":["nofollow"]},"children":[{"type":"text","value":"Dell"}]},{"type":"text","value":" par exemple pour les US. D’ailleurs Berlin également "},{"type":"element","tag":"a","props":{"href":"https://www.lefigaro.fr/flash-actu/berlin-a-la-preuve-que-huawei-a-travaille-avec-les-services-chinois-20200129","rel":["nofollow"]},"children":[{"type":"text","value":"aurait confirmé des liens"}]},{"type":"text","value":" entre Huawei et le renseignement Chinois."}]},{"type":"element","tag":"h3","props":{"id":"tiktok"},"children":[{"type":"text","value":"TikTok"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Le conflit TikTok est très intéressant également. De loin, c'est \"juste\" un réseau social de plus. Alors pourquoi Trump s'y intéresse. Qu'est ce que ca peut bien faire pour les US que ce réseau social attire des américains ? "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et bien cela illustre parfaitement à quel point le contrôle sur les données mondiales est un enjeu d'état et les USA l'ont bien compris. C'est une question de protectionnisme autour des intérêts américains. Et le contrôle des données en fait partie, c'est l'un des enjeux majeurs des prochaines années."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Autre fait intéressant, c'est Microsoft qui se porte volontaire au rachat qui pourrait être imposé. Microsoft qui a déjà racheté Linkedin et Github. A ne pas se tromper, il s'agit surtout pour Microsoft de consolider sa position sur le terrain de la connaissance et des données."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La remarque la plus intéressante dans cette histoire, c’est ce tweet :"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"","src":"/images/twitterDHH.png"},"children":[]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"A DHH (David Heinemeier Hansson) je pourrais répondre que l’Europe n’a pas l’unité nécessaire pour se faire entendre aussi fort. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mettons que l’Europe en soit capable, vous allez me dire qu’on créérait des internets par régions économiques ? En réalité c’est déjà le cas, il existe un internet Russe, un internet Chinois, un internet Américain avec des applications et des sociétés qui sont de pures copies. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Sur le fond et de mon opinion c’est dérangeant et très en opposition avec l’idée originale de Tim Berners Lee. C’est bien sûr très idéaliste mais j’aurais espéré que des outils de communication universelles permettent de rapprocher les gens. Il n’empêche qu’on y va tout droit. "}]},{"type":"element","tag":"h2","props":{"id":"le-dilemme-des-entreprises-européennes"},"children":[{"type":"text","value":"Le dilemme des entreprises Européennes"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Reprenons, la RGPD peut contraindre et empêcher des entreprises étrangères de s’implanter sur le marché Européen, elle remplit en partie son rôle politique."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Sauf que l’Europe est un gros consommateur de nombreux services US encadré par le Patriot Act, bien plus que l’inverse. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dans ce contexte, les entreprises Européennes au milieu de tout cela ont du souci à se faire car les deux alternatives proposées sont plutôt handicapantes :"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"choisir sciemment des produits, soit US, soit Chinois en sachant qu'on handicape notre propre développement de super champions d’une part, et on se met en risque de fuite de données vers des concurrents US d’autre part"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"imposer aux sociétés Françaises de ne pas utiliser de service étrangers, au risque de ne pas bénéficier de services aussi perfectionné et donc de creuser un retard sur la concurrence internationale. "}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Suicide économique ou suicide économique ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Non je ne dirais pas que la question est vite répondue."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"C’est exactement à quoi se résume la question autour de "},{"type":"element","tag":"a","props":{"href":"https://www.usine-digitale.fr/article/l-annulation-du-privacy-shield-doit-s-appliquer-immediatement-tranche-la-cnil-europeenne.N989069","rel":["nofollow"]},"children":[{"type":"text","value":"la remise en cause du Privacy Shield"}]},{"type":"text","value":" et des débats autour du Cloud Act. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"On vient de parler de souveraineté dans le cadre de Huawei puis de Cloud, la transition est idéale pour parler de Cloud souverain :). "}]},{"type":"element","tag":"h2","props":{"id":"le-cloud-souverain"},"children":[{"type":"text","value":"Le cloud souverain "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La Chine et les US ont développé des super géants dans de nombreux domaines du numérique. Je vais surtout parler des US car, pour l'instant, c'est surtout ces produits qui prévalent en France. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"N'importe quelle entreprise, privée ou publique, est très rapidement confrontée à des produits US, que ce soit pour les OS des machines personnelles et des serveurs, les services de Cloud, et les très nombreux SAAS qu'elle utilise. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Le Cloud et les SAAS ont été un accélérateur majeur ces dernières années pour les entreprises qui ont pu se focaliser sur leur coeur de métier et déléguer le reste à des spécialistes de l’infrastructure, des services de gestion RH, de learning management, d'envoi de SMS, d'envoi de newsletter, de segmentation marketing, de CRM etc..."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Cette prédominance US a de quoi inquiéter bien sûr et surtout sur le socle de base : OS et Cloud. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Si Trump découvre aujourd’hui ce concept de souverainisme sur les infrastructures de bases avec Huawei, l’Europe elle y est confrontée depuis de nombreuses années."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"C'est pourquoi on entend régulièrement des politiques prôner des programmes d'OS souverains ou cloud souverains. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Cela a donné lieu à des échecs relativements importants comme "},{"type":"element","tag":"a","props":{"href":"https://www.usinenouvelle.com/article/sfr-se-donne-un-nouveau-depart-dans-le-cloud-sans-son-cloud-souverain-numergy.N673834","rel":["nofollow"]},"children":[{"type":"text","value":"Numergy"}]},{"type":"text","value":" et "},{"type":"element","tag":"a","props":{"href":"https://www.usinenouvelle.com/article/adieu-le-cloud-souverain-orange-ferme-aujourd-hui-cloudwatt.N925104","rel":["nofollow"]},"children":[{"type":"text","value":"Cloudwatt"}]},{"type":"text","value":", échecs d’autant plus rageant qu’ils étaient prévisibles et que ces financements ont volontairement négligé des acteurs déjà présents comme OVH et Clever Cloud à l’époque. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Malheureusement sur ce dossier comme dans beaucoup d’autres, on a vu à l’oeuvre les mêmes usual suspects que l’on retrouve bien souvent et qui trustent les marchés publics."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Plus récemment, "},{"type":"element","tag":"a","props":{"href":"https://www.latribune.fr/opinions/tribunes/ne-laissons-plus-les-gafa-s-emparer-des-donnees-europeennes-853782.html","rel":["nofollow"]},"children":[{"type":"text","value":"une tribune a été signée"}]},{"type":"text","value":" pour relancer l'idée d'un label de Cloud Français"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"On peut déjà se demander pourquoi Cloud Français et pas Européen. Je ne pense pas qu’il faille raisonner uniquement national sur le sujet. Mais passons. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"On voit également des injonctions régulières sur Twitter à utiliser des services Français déjà existants, et sinon la personne passerait soit pour un incompétent (car il ne sait pas reconnaître la qualité à la Française), soit un traître à la patrie. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Il est forcément difficile de répondre à ces tweets, si tant est que ca ait une quelconque utilité de toute façon, au risque de devoir défendre des services US alors même qu’au contraire, on apprécie les initiatives Européennes et on veut les voir réussir.."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Il y a "},{"type":"element","tag":"a","props":{"href":"https://www.iphon.fr/post/depenses-innovation-rd-apple-google-microsoft-depasse-par-amazon-901015","rel":["nofollow"]},"children":[{"type":"text","value":"des chiffres cependant"}]},{"type":"text","value":" qui sont assez révélateurs, Amazon par exemple dépense 22 milliards pour sa R&D chaque année, Alphabet (Google) 16 milliards. "},{"type":"element","tag":"a","props":{"href":"https://www.latribune.fr/technos-medias/internet/e-commerce-le-chinois-alibaba-va-investir-15-milliards-de-dollars-en-r-d-753807.html","rel":["nofollow"]},"children":[{"type":"text","value":"Alibaba"}]},{"type":"text","value":" c’est 15 milliards."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En comparaison, "},{"type":"element","tag":"a","props":{"href":"https://www.journaldunet.com/solutions/cloud-computing/1438443-apres-deux-ans-a-marche-forcee-ovh-leve-le-pied/","rel":["nofollow"]},"children":[{"type":"text","value":"OVH c’était 1.5 milliards d’investissement au total"}]},{"type":"text","value":" (pas uniquement de R&D) sur 5 ans. Je n’ai pas les budgets de Scaleway mais on doit être dans les mêmes eaux. En moins grand public vous avez également outscale par Dassault Système qui joue à fond la carte cloud souverain pour l’IAAS. Ils déclaraient dans "},{"type":"element","tag":"a","props":{"href":"https://fr.outscale.com/communiques-presse/celine-bousquet-rejoint-outscale-poste-de-directrice-recherche-developpement/","rel":["nofollow"]},"children":[{"type":"text","value":"un communiqué de presse"}]},{"type":"text","value":" dépenser 15% de leur CA en R&D, CA qui "},{"type":"element","tag":"a","props":{"href":"https://fr.wikipedia.org/wiki/Outscale","rel":["nofollow"]},"children":[{"type":"text","value":"selon Wikipedia"}]},{"type":"text","value":" est de l’ordre de 7.5M d’euros. On est loin d’OVH en la matière."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Alors entendons nous bien, ce qui fait le succès d’un "},{"type":"element","tag":"a","props":{"href":"https://eventuallycoding.com/2019/12/19/quest-ce-quun-ecosysteme-tech/","rel":["nofollow"]},"children":[{"type":"text","value":"écosystème tech"}]},{"type":"text","value":" c’est la concentration en un même lieu de sociétés tech, d’universités, d’investisseurs bien pourvus qui collaborent et se consomment leurs services mutuellement. Nous avons tout à gagner que des super champions se développent chez nous. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mais les sociétés du cloud, notamment sur le IAAS restent en retard, peut être seulement de quelques années, mais ces années comptent triple dans ce domaine. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et l’écart se creuse."}]},{"type":"element","tag":"h2","props":{"id":"alors-cest-tout-on-plie-bagage"},"children":[{"type":"text","value":"Alors, c’est tout, on plie bagage ? "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"J’ai personnellement beaucoup apprécié le discours de Octave Klaba lors de tech.rocks 2019. Il insistait sur le fait qu’OVH ne devait pas emprunter la route des GCP et Amazon mais devait trouver une route intermédiaire et s’appuyer sur l’expertise d’acteurs du PaaS comme Clevercloud (et peut être d’autres comme platform.sh ou Qovery ?) pour étoffer la gamme de service."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Attendre qu’une entreprise devienne aussi pointue sur tous les domaines, le IaaS, le PaaS, qu’elle développe une marketplace de services, une plateforme data en SAAS etc… je pense que le pari de rattraper GCP et Amazon serait risqué."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"A l’inverse, si OVH se concentre sur son savoir faire et rattrape son retard uniquement sur la partie Data center, et collabore avec d’autres acteurs pour constituer une offre complète de service plus larges qu’aujourd’hui au dessus de ça, il y a une porte de sortie. Evidemment la qualité de cette intégration (coucou la console d’admin OVH Cloud...) jouera également et la façon dont on saura le vendre va jouer énormément. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Bref de sacrés défis et enjeux en perspective. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Au moment où j’écris ce billet je découvre le consortium "},{"type":"element","tag":"a","props":{"href":"https://www.lesnumeriques.com/vie-du-net/qu-est-ce-que-gaia-x-le-meta-cloud-europeen-n151195.html","rel":["nofollow"]},"children":[{"type":"text","value":"Gaia-X"}]},{"type":"text","value":" qui se veut comme un regroupement de plusieurs grosses entreprises Européennes pour définir un fonctionnement, des spécifications interopérables et un standard commun pour bâtir des services dessus. Ce n’est pas un Cloud mais une forme de coopération pour définir ce qui devrait tourner sur un Cloud Européen."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Alors c’est un peu tôt pour l’instant, cela date de juin 2020 et je préfère éviter de commenter sur le fond parce que pour l’instant c’est encore assez peu concret dans mon esprit mais j'avoue rester sceptique sur l'approche consistant à vouloir créer un standard d'interop sur des services alors qu'on est plutôt dans une problématique de R&D que de stabilisation des standards en ce moment."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Sur la forme, il est très intéressant de lire le discours qui accompagne cette création :"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"“L'autre grand sujet discuté par la CE est la création d'un espace européen des données, un "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"“véritable marché unique des données”"}]},{"type":"text","value":", résume le document. Les données étant "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"“"}]},{"type":"element","tag":"strong","props":{},"children":[{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"le carburant de l'intelligence artificielle"}]}]},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"”"}]},{"type":"text","value":", il est nécessaire de créer une sorte de nuage européen au sein duquel "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"“les données à caractère personnel et non personnel, y compris les données industrielles sensibles, soient en sécurité et dans lequel"}]},{"type":"text","value":" "},{"type":"element","tag":"strong","props":{},"children":[{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"les entreprises aient facilement accès à une quantité quasi infinie de données industrielles de haute qualité"}]}]},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":", stimulant la croissance et créant de la valeur tout en minimisant l’empreinte carbone et environnemental humain”."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"Source"}]},{"type":"text","value":" "},{"type":"element","tag":"a","props":{"href":"https://www.lesnumeriques.com/vie-du-net/qu-est-ce-que-gaia-x-le-meta-cloud-europeen-n151195.html","rel":["nofollow"]},"children":[{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"lesnumériques"}]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Pour en revenir au Cloud, c’est le socle. Mais le jeu n’est pas fini. Le Cloud a été un énorme changement ces dernières années. Il a permis une accélération de développement de nombreuses boites qui ont pu profiter d’infrastructure plus riche malgré leur taille. C’est encore un enjeu fort mais c’est “presque terminé” si on lis entre les lignes du livre de Kai-Fu Lee. Les prochains défis vont porter autour de l’IA et ces usages. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Il faudra que nous ayons des alternatives européennes mais il faut aussi regarder vers l’avenir et ne pas rater cette marche là. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ce sera le sujet du prochain billet : l’économie des TIC (technologie de l’information et des communications) et nos investissements en la matière."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"la-rgpd","depth":2,"text":"la RGPD ","children":[{"id":"la-rgpd-sous-langle-des-utilisateurs","depth":3,"text":"La RGPD sous l’angle des utilisateurs"},{"id":"la-rgpd-sous-langle-du-cto","depth":3,"text":"La RGPD sous l’angle du CTO"},{"id":"une-protection-qui-se-veut-protectionniste","depth":3,"text":"Une protection qui se veut protectionniste"}]},{"id":"et-dans-les-autres-pays","depth":2,"text":"Et dans les autres pays ?","children":[{"id":"huawei","depth":3,"text":"Huawei"},{"id":"tiktok","depth":3,"text":"TikTok"}]},{"id":"le-dilemme-des-entreprises-européennes","depth":2,"text":"Le dilemme des entreprises Européennes"},{"id":"le-cloud-souverain","depth":2,"text":"Le cloud souverain "},{"id":"alors-cest-tout-on-plie-bagage","depth":2,"text":"Alors, c’est tout, on plie bagage ? "}]}},"_type":"markdown","_id":"content:articles:2020:08:07:bataille-autour-des-donnees-et-du-cloud.md","_source":"content","_file":"articles/2020/08/07/bataille-autour-des-donnees-et-du-cloud.md","_extension":"md"}