{"_path":"/articles/2021/05/03/cto-de-startup-a-scaleup","_dir":"03","_draft":false,"_partial":false,"_locale":"en","_empty":false,"title":"CTO de startup à scaleup","description":"Il y a un moment que je pensais faire un billet sur le rôle d'un CTO dans une startup. Cependant je me disais toujours que ce n’était pas intéressant,...","excerpt":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Il y a un moment que je pensais faire un billet sur le rôle d'un CTO dans une startup. Cependant je me disais toujours que ce n’était pas intéressant, qu’il faudrait en parler quand la boîte serait bien plus grande, quand nous serions une licorne etc..."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et c'est ainsi que j'ai fait patienter ce billet pendant des mois, puis des années... "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Cependant au fil des années je me suis rendu compte que le chemin parcouru pouvait déjà servir à d'autres. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"J'ai profité moi-même et je profite encore des retours d'expériences de nombreux autres tech leaders et entrepreneurs qui sont à des stades plus avancés. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mais si je lis et je suis très inspiré par des entrepreneurs ou des product leaders à succès comme Jean Baptiste Rudelle, Reid Hoffman, Marissa Mayer, Marty Cagan, je sais également que lorsqu'on démarre une boîte, ces personnes ne peuvent pas nous aider. Leur quotidien n'a aucun rapport avec le mien."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"De plus, s'il existe bien sûr des centaines de milliers de tech leaders qui sont CTO d'ESN, directeurs de développement etc... avec des équipes d'ingénierie plus grandes que la taille de Malt en entier, je pense que le métier de CTO dans un contexte de startup en croissance a quelques spécificités. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et c'est ainsi que je me suis décidé à parler du rôle de CTO, de la création d'une startup à son passage à Scale-up."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Pour situer le contexte, je suis donc CTO et co-fondateur de Malt, une place de marché permettant à des freelances de travailler avec des entreprises de toutes tailles, des PME jusqu'aux grands groupes du CAC40 et désormais dans plusieurs pays Européens avec des bureaux en France, Espagne et Allemagne."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La société a doublé de taille quasiment chaque année (sauf 2020...), passant de 3 personnes en 2013 à 200 en 2021. L'équipe produit fait actuellement 50 personnes. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Sur les 18 prochains mois nous prévoyons de doubler la taille de l’équipe produit à une centaine de personnes et d’accélérer notre expansion en Europe, nous faisant entrer dans le statut des Scale-up."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Reprenons depuis le début."}]},{"type":"element","tag":"h2","props":{"id":"cto-chef-de-soi-même-dans-une-équipe-de-1-2013-2014"},"children":[{"type":"text","value":"CTO, chef de soi-même, dans une équipe de 1 (2013-2014)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://eventuallycoding.com/wp-content/uploads/2021/05/Illustration_sans_titre-10-1.jpg","rel":["nofollow"]},"children":[{"type":"element","tag":"img","props":{"alt":"","src":"/images/Illustration_sans_titre-10-1.jpg"},"children":[]}]}]},{"type":"element","tag":"h3","props":{"id":"il-faut-vraiment-un-cto-pour-démarrer-une-startup-"},"children":[{"type":"text","value":"Il faut vraiment un CTO pour démarrer une startup ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Malt a démarré par une rencontre en 2012. A ce moment-là, nous sommes 3 : Jean Baptiste Lemée, Vincent Huguet et moi-même. L'association va donc compter 2 \"CTO\" et un CEO."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"J'ai souvent des discussions sur les meilleures équipes pour démarrer une startup. Est-ce qu'on peut démarrer seul ? Et si non, quelle est la meilleure composition d'équipe ? Comment doit-on répartir les rôles etc... "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ce serait un article beaucoup trop long si j'essayais de répondre à tous ces sujets mais je vais me concentrer sur le rôle de CTO. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Je ne vais pas y aller par quatre chemins : de mon point de vue, le rôle de CTO est crucial pour une boite qui veut construire un produit."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Je ne connais aucune startup qui a passé le cap des 3/5 ans sans CTO. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Entendu de la part d'investisseurs, c'est même un sérieux signal d’alerte dans un dossier de startup de venir sans un associé technique. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"On peut bien sûr démarrer une idée sans CTO. On peut faire des premières versions, et même faire un premier tour de financement, avec un produit réalisé par une agence, ou fait avec des outils no code. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mais à un moment, le CTO est nécessaire pour que la boite se développe. Le CTO va apporter la vision et la gouvernance technologique nécessaire pour la suite. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Par contre, et c'est ce que je vais essayer de décrire dans ce billet, le portrait type du CTO à ce stade n'est pas le même que le CTO dans une boite de 500 personnes et plus. "}]},{"type":"element","tag":"h3","props":{"id":"cto-cest-avant-tout-être-le-premier-développeur"},"children":[{"type":"text","value":"CTO c’est avant tout être le premier développeur"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En tant que co-CTO dans les premiers mois j'étais surtout chef de moi-même. J'étais avant tout développeur et ma principale activité avec Jean-Baptiste c'était de coder le site de Malt. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La définition du produit se faisait entre les 3 fondateurs. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"C'était un mélange de dev, de choix entre acheter et construire (le fameux buy or build) mais avec des bouts de ficelle. Il n'y a pas de plus gros enjeu que la rapidité à ce moment-là."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Alors bien sûr je ne voulais pas construire un château de cartes branlant mais il fallait être pragmatique et assurer une très bonne vitesse d'exécution. "}]},{"type":"element","tag":"h3","props":{"id":"full-stack-cto"},"children":[{"type":"text","value":"Full stack CTO"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"A ce stade on est au four et au moulin sur plein de sujets qu'on ne connaît pas : SEO, data analyse, data engineering (du pauvre), data science (encore plus du pauvre), admin sys, QA, PM, UX Designer, front, back etc... Vous définissez le produit et vous l’écrivez dans la foulée."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mais cela ne s’arrête pas au produit, c’est aussi le support IT, le support client, la finance etc..."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Bien sûr que je n'étais pas bon en tout. Et aujourd'hui on me chambre encore sur des captures d'écran de mes anciens forfaits en UX. De toute façon le CTO c'est la personne sur qui on peut ensuite coller toutes les casseroles de \"l'Historique\", avec un grand H et il faut vivre avec :)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En prenant la casquette d'entrepreneur, il faut se rappeler une phrase : \"Si vous n’avez pas honte de votre produit, c’est que vous l’avez sorti trop tard\". (Reid Hoffman, co-fondateur de Linkedin)."}]},{"type":"element","tag":"h3","props":{"id":"le-profil-type"},"children":[{"type":"text","value":"Le profil type"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Le profil type à cette phase, c'est une personne qui met les mains dans le cambouis et qui va vite. C'est également une personne qui aime apprendre des nouvelles choses et est ok pour être constamment hors de sa zone de confort. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Par nature un bon ingénieur est rationnel, rigoureux, méthodique. Mais attention, le dogmatisme est un ennemi à cette étape. Il faut accepter une dose de naïveté créative et les très nombreux compromis avec ce que l'on aurait pu faire dans des équipes bien plus grandes. A cette étape, vous ne devez pas chercher à être une personne qui va structurer une équipe. Il ne faut pas passer de temps sur l’optimisation des process ou l’orga. "}]},{"type":"element","tag":"h3","props":{"id":"la-rémunération"},"children":[{"type":"text","value":"La rémunération"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Côté salaire, le CTO à cette phase ne doit pas s'attendre à une rémunération de nabab ^^ Vous gagneriez mieux ailleurs."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"C'est la difficulté majeure pour trouver un CTO lorsque vous n'en êtes pas un vous-même. Si j'exclus les jeunes CTO, toute personne expérimentée serait mieux payée ailleurs qu'en étant CTO de votre startup. Personnellement je gagnais bien mieux en étant freelance à ce moment là (>50%) et en travaillant moins.  "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Associer le CTO au capital est important pour l'engager sur la durée. Le CTO qui joint au démarrage s'attend à 30/45% des parts. Je ne m'apesentirais pas sur les critères de comment on détermine ça mais il existe "},{"type":"element","tag":"a","props":{"href":"http://foundrs.com/","rel":["nofollow"]},"children":[{"type":"text","value":"des sources sur internet"}]},{"type":"text","value":" pour vous aider. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Pour ma part, être associé était nécessaire mais à aucun moment je me suis dit que cela compenserait ce que je perdais. Bien sûr, quand on démarre on cherche à ce que la boite marche, mais de là à être sûr à 100% que la société sera un jour une réussite complète, on sait à quel point c'est un pari et que très peu de gens y arrivent. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"De mon côté, j'acceptais de gagner moins car je trouvais ça très enrichissant. J'ai toujours adoré créer mon propre produit, le faire grandir, apprendre des nouveaux métiers et être mon propre boss. La liberté que j'avais et l'impact que j'apportais m'ont motivé dans cette aventure au-delà de l'aspect financier. "}]},{"type":"element","tag":"h2","props":{"id":"cto-leader-de-squads-dans-une-startup-de-1-à-20--2014-2016"},"children":[{"type":"text","value":"CTO, leader de squads dans une startup de 1 à 20 :  (2014-2016)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"(équipe produit de 1 à 10)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ça y est, vous y êtes, les premières embauches dans l’équipe produit. Votre rôle de CPTO (Chief product and technology officer) grandit. La définition produit se fait toujours entre les fondateurs et vous êtes encore majoritairement les mains dans le cambouis à plus de 90% mais vous avez une autre responsabilité : créer une équipe. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"C'est une phase qui est en réalité pivot à plus d'un titre, mais je ne le savais pas encore."}]},{"type":"element","tag":"h3","props":{"id":"apprendre-à-se-virer-soi-même"},"children":[{"type":"text","value":"Apprendre à \"se virer soi-même\" "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ce sera l’un de vos mantras par la suite, comment se virer soi-même sans arrêt ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Désormais, il faut embaucher des collègues pour faire certains jobs et le faire mieux que vous. Fini les rôles de PM, UX, Front etc... "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"J'ai l'impression que certains CTO bloquent à cette étape, car ils n'arrivent pas à embaucher meilleurs qu'eux. Est-ce que c'est lié à un sentiment d’'insécurité ? Une façon de vouloir garder la main ? Aucune idée. Mais ce sera très dur pour la suite…"}]},{"type":"element","tag":"h3","props":{"id":"le-cto-toujours-développeur"},"children":[{"type":"text","value":"Le CTO, toujours développeur"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"A cette époque j’étais à 90% développeur. 2015 correspond à mon pic d’activité en termes de commits sur Github (voir plus bas). L’équipe produit faisait une dizaine de personnes à la fin de cette période. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dans une équipe de cette taille, l’autonomie est grande, les méthodes utilisées sont très légères et le fameux “time to market” (la capacité à passer rapidement de l’idée aux utilisateurs) doit rester très court. Il n’y a pas d’estimation, pas de sprint, de scrum master, de QA, d’OKR et j’en passe. Les décisions étaient rapides avec peu de personnes à convaincre à chaque fois. La gestion du changement était “simple” (et pourtant on s’est parfois pris les pieds dans le tapis quand même)."}]},{"type":"element","tag":"h3","props":{"id":"une-carrière-de-recruteur-qui-démarre"},"children":[{"type":"text","value":"Une carrière de recruteur qui démarre "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Le recrutement c'est 90% du succès de la boîte et c’est pourquoi j'y ai passé un temps phénoménal. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En cumulé j'ai dû voir presque 1 milliers de CV. J'ai fait passer 300 premiers entretiens en visio, entre 100 et 150 entretiens physiques (en comptant aussi pour les autres rôles dans l'entreprise même si je n'étais pas le recruteur principal dans ces cas là). "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Le recrutement c'est aussi faire des choix sur l'organisation de l'équipe, la culture que vous allez créer, les valeurs fondamentales que vous allez insuffler. Cela va se traduire par la séniorité, l’autonomie, l’adaptabilité, l’esprit entrepreneurial des personnes recherchées.  "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"J'ai fait un choix structurant à l'époque, j'ai choisi lors du recrutement de ne prendre que des seniors, des personnes totalement autonomes. Je ne voulais pas faire de management et gérer des juniors ou coacher des intermédiaires. L'organisation est restée légère, la communication simple, l'autonomie grande. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Cette philosophie m'a permis de continuer à développer pendant un bon moment sur Malt mais au-delà de ça, il me semble que c'est un facteur de réussite et de notre croissance. "}]},{"type":"element","tag":"h3","props":{"id":"votre-rôle-de-cpoctofondateur-nécessite-plus-de-temps"},"children":[{"type":"text","value":"Votre rôle de CPO/CTO/fondateur nécessite plus de temps."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Au-delà de votre rôle dans l'équipe produit, votre rôle dans l'entreprise prend un peu plus d'importance aussi. Vous avez plus d'interactions avec plus de gens en dehors de vos compétences, des métiers apparaissent comme le support, la fonction commerciale, le marketing et vous avez un rôle de business enabler (désolé je n'ai pas trouvé de traductions satisfaisantes en français). Vous portez la “voix de la technologie et du produit”, c’est à vous d’identifier quand elle peut servir aux besoins de la société, quand elle peut apporter des réponses à vos clients mais aussi quand il faut savoir faire des choix (et dire non)."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Je précise bien sûr que ce rôle ne se faisait pas en solo. Comme depuis la création, c’est le trio de fondateurs qui joue le rôle de fullstack entrepreneur à tous les niveaux."}]},{"type":"element","tag":"h2","props":{"id":"cto-leader-de-guilde-dans-une-entreprise-de-20-à-50-2017-2018"},"children":[{"type":"text","value":"CTO, leader de guilde dans une entreprise de 20 à 50 (2017-2018)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"(equipe produit de 10 à 30)"}]},{"type":"element","tag":"h3","props":{"id":"des-interactions-plus-complexes"},"children":[{"type":"text","value":"Des interactions plus complexes"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Sur l’année 2017-2018 j’ai passé une grande partie de mon temps en recrutement. Et en faisant cela, j’ai passé le seuil fatidique des 10 personnes dans l’équipe produit."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ce seuil de 10 commence à changer le fonctionnement d’une équipe. Les interactions sont plus nombreuses, la communication devient plus complexe et des petits groupes commencent à se former pour rester efficaces. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La loi de Brooks illustre parfaitement cette complexité croissante dans les interactions d’un groupe passé un certain seuil :"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://eventuallycoding.com/wp-content/uploads/2021/05/pasted-image-0.png","rel":["nofollow"]},"children":[{"type":"element","tag":"img","props":{"alt":"","src":"/images/pasted-image-0.png"},"children":[]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"C’est à ce moment là que j’étais ravi de l’équipe déjà en place, sur laquelle j’ai pu m’appuyer. Le fait d’avoir recruté beaucoup de seniors a limité le besoin en management humain. Certains leaders ont naturellement émergé et l’équipe a pu continuer à fonctionner sans management lourd pendant encore un moment. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mon modèle était celui de la précédente boîte que j’avais cofondée, Lateral-Thoughts : la sociocratie et la gouvernance par cercle."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Le rôle de CTO à cette étape est très centré sur l’équipe, très présent à tous les niveaux, le CTO est là pour pallier l’absence de structure formelle. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et ce n’est pas anormal, il était encore trop tôt pour apporter plus de structure, et en même temps il fallait commencer à travailler sur des sujets comme l’alignement et la vision long terme."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Sans être un pur manager de personnes, j’ai dû améliorer fortement le processus de recrutement et travailler sur des sujets comme le career path ou les grilles de salaires. Je n’ai par contre pas mis en place de processus formel pour voir chaque personne dans l’équipe. Je comptais à ce moment-là sur le fait que la discussion devait se faire naturellement et que chacun était assez grand et assez proche de moi pour me parler des sujets qui le tracassaient. Spoiler, ça a marché, en partie. A cette étape c’était encore possible, on se voyait beaucoup et la communication était très ouverte. Par contre lors de la phase d’après ce principe ne fonctionnait plus et d’autant plus dans le contexte de la crise du COVID.  "}]},{"type":"element","tag":"h3","props":{"id":"un-rôle-de-développeur-qui-diminue"},"children":[{"type":"text","value":"Un rôle de développeur qui diminue"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En tant que CTO je dirais que ma part de temps passé en développement a dû baisser. Je dirais naïvement aux alentours de 60%."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Le rôle d’organisateur a pris plus de place. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"C’est à ce moment que j’ai commencé à me définir comme le GO (Gentil organisateur) de l’équipe. La personne chargée de mettre de l’huile dans les rouages. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"C’était toujours un rôle schizophrénique : développeur, coach, manager, scrum master. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Si le développement pur a diminué, il est resté important et clé sur les orientations et choix technologiques. L’activité a changé de nature mais je dirais que ce rôle de développeur restait majeur pour la réussite de la société. A ce stade j’étais en mesure d’apporter encore des changements significatifs sur l’application en quelques jours."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Pour illustrer avec des chiffres, voici un graphe représentant mon activité Github sur la période 2012 jusqu'à aujourd’hui et qui illustre bien la baisse d’activité sur 2017-2018 (et le pic de 2015) :"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://eventuallycoding.com/wp-content/uploads/2021/05/pasted-image-0-1.png","rel":["nofollow"]},"children":[{"type":"element","tag":"img","props":{"alt":"","src":"/images/pasted-image-0-1.png"},"children":[]}]}]},{"type":"element","tag":"h3","props":{"id":"une-ambiguïté-permanente"},"children":[{"type":"text","value":"Une ambiguïté permanente"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Comme dit plus haut, en tant que CTO (et fondateur), vous changez sans arrêt de casquettes, plusieurs fois dans le même meeting. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Vous êtes toujours un “full stack CTO” mais entre-temps vous avez recruté et ces changements de casquettes permanents peuvent amener un peu de confusion pour des membres de l’entreprise qui arrivent.  "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Il peut être difficile pour tout le monde de savoir quand le fondateur s’exprime sur un sujet en tant que “participant”, par exemple dans une session de brainstorming, et quand le CTO s’exprime en tant que leader technique, pour exprimer une direction à prendre ou en tant que CPO pour établir la stratégie produit. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"J’ai eu de nombreuses discussions avec des membres de Malt pour clarifier mes positions, assumer ce rôle de CTO qui était jusqu’alors surtout une étiquette que je ne revendiquais pas, améliorer ma communication. Et je remercie grandement toutes les personnes qui à cette époque m’ont bousculé, fait réfléchir et grandir. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"C’était nécessaire juste avant la phase d’après car j’allais devoir faire des choix plus forts sur ce que je voulais faire ou non."}]},{"type":"element","tag":"h2","props":{"id":"cto-leader-de-tribe-dans-une-startup-de-50-à-200-2018-2021"},"children":[{"type":"text","value":"CTO, leader de tribe dans une startup de 50 à 200 (2018-2021)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"(équipe produit de 30 à 50)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La période 2018-2021 est spéciale à plus d’un titre. Entre 2018 et 2020 la société a doublé de taille chaque année. 2020 a été marqué par le COVID avec une gestion différente à mettre en place et un turnover qui a décollé. Dans la même période, la société a progressé de plusieurs crans à tous les niveaux. "}]},{"type":"element","tag":"h3","props":{"id":"une-équipe-quil-faut-commencer-à-structurer"},"children":[{"type":"text","value":"Une équipe qu’il faut commencer à structurer"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Je l’évoquais plus haut, la complexité de la communication quand on augmente le nombre de personnes impliquées croît de façon exponentielle et c’est lors de cette période qu’il a fallu passer de nombreux caps."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En tant que CTO, il était temps d’apporter une structure de façon à ne pas dégrader la vitesse d'exécution. Si une structuration trop forte aurait pu ralentir Malt au début, cela devenait nécessaire pour passer ensuite à l’échelle. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"C’est le moment de prendre conscience qu’une équipe produit nécessite une coordination et une animation impeccable. Dans une startup tech comme Malt, à ce stade de développement, la taille de l’équipe produit devrait prendre en ratio entre 25 et 50% de l’effectif total (ratio qui diminue avec la croissance par la suite). C’est donc l’une des équipes les plus grandes. Chaque squad/feature team/impact team/tribe, appelez les comme vous voulez, correspond à des collaborations de plusieurs métiers différents. Ce ne sont pas juste des mercenaires qui bossent chacun de leur côté. Chaque personne, chaque décision a une influence sur une autre personne du groupe à court ou moyen terme. D’ailleurs la quasi-totalité des personnes dans la société repose sur le produit ou des outils réalisés par cette équipe."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La dette technique ou métier est collective. Mais si on le voit aussi de façon positive, chaque amélioration, chaque bonne pratique améliore de façon substantielle toute l’équipe et l’entreprise. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Bref, c’est une mécanique complexe et, heureusement, il existe beaucoup d’entreprises qui partagent leurs meilleures pratiques. En tant que CTO il va falloir appliquer une veille constante sur ces sujets, de la même façon que vous aviez l’habitude d’en faire sur des sujets plus techniques. Je vous propose d’ailleurs une liste de ressources en bas de ce billet."}]},{"type":"element","tag":"h3","props":{"id":"lheure-des-choix"},"children":[{"type":"text","value":"L’heure des choix"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Je l’évoquais au tout début, le but du CTO est de “se virer soi-même” avec la croissance de la startup. Et le passage à 100 dans l’entreprise a accéléré le mouvement. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"A cette étape, ça a été l’heure des choix. En tant que CTO je ne pouvais plus développer, organiser, établir la stratégie, recruter, coacher etc… Ou alors en faisant tout mal."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dans la suite de ce paragraphe je vais évoquer les choix personnels que j’ai fait. Chaque CTO (et c’est d’autant plus vrai pour un fondateur) fera des choix différents. Il n’y a pas de bonne ou mauvaise solution, il faut aussi faire avec ces forces, faiblesses, et centres d’intérêt."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Première décision, j’ai presque stoppé tout développement. Ok parfois ça me reprend mais c’est anecdotique. J’ai toujours besoin de comprendre ce qui se fait mais c’est surtout par curiosité. Je ne dois jamais être dans le chemin bloquant pour un développement."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ensuite, je me suis toujours considéré comme un contributeur individuel, pas un manager. Donc par la suite j’ai fait venir un VP engineering pour s’occuper de la partie management et process. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Nous avons fait venir un CPO sur la stratégie produit en 2018. Cependant ce rôle a disparu en 2020 et j’ai un rôle qui de facto est redevenu celui de CPTO mais avec une équipe de leads produit hyper costauds pour m’aider et avec qui je suis ravi de travailler quotidiennement."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Grâce à ces leads, je reste très impliqué au niveau gouvernance sur des sujets qui sont et vont rester cruciaux pour le passage à l’échelle de Malt. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ils m’accompagnent dans tous les domaines clés : sécurité, architecture, data, cloudops, stratégie produit, design etc... Je passe beaucoup de temps avec eux sur la définition de la stratégie et des objectifs, les problèmes à résoudre mais ensuite c’est eux qui sont autonomes sur la façon de faire et j’apporte de l’aide pour mettre de l’huile dans les rouages quand c’est nécessaire. "}]},{"type":"element","tag":"h2","props":{"id":"et-la-suite--le-passage-en-scale-up"},"children":[{"type":"text","value":"Et la suite ? Le passage en Scale-up"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Comme je l’indiquais dans l’introduction, Malt commence à entrer dans le monde restreint des Scale-up. Le prochain objectif pour répondre à la croissance de Malt et son expansion va être de continuer à investir dans l’équipe produit. Elle pourrait doubler dans les 18 mois qui viennent et passer à une centaine de personnes. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La mise à l’échelle de cette équipe va demander un travail énorme. Une grande partie de ce travail repose sur le CPTO et l’équipe de leads produits que je citais précédemment. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Les enjeux sont grands, vitesse de recrutement, qualité de la formation des nouveaux arrivants, autonomie des équipes, vitesse d'exécution, stratégie produit, user research, OKR, mise à l’échelle des technologies."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Le rôle de CPTO sera sans doute très stratégique. Je vais travailler sur la déclinaison des OKR à chaque niveau et sur le suivi et le coaching de l’équipe des leads produits pour répondre à ces sujets. Tout du moins c’est ce que j’imagine mais le passé m’a montré que le plus important sera l’adaptabilité."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ce sera peut être le sujet d’un nouveau billet dans 18 mois."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et si vous voulez faire partie de l'aventure, nous recrutons constamment sur France entière. Contactez-nous."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ressources intéressantes en tant que CPTO :"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://www.amazon.com/INSPIRED-Create-Tech-Products-Customers-ebook/dp/B077NRB36N","rel":["nofollow"]},"children":[{"type":"text","value":"Inspired"}]},{"type":"text","value":" et "},{"type":"element","tag":"a","props":{"href":"https://www.amazon.com/EMPOWERED-Ordinary-Extraordinary-Products-Silicon-ebook/dp/B08LPKRD5L/","rel":["nofollow"]},"children":[{"type":"text","value":"Empowered"}]},{"type":"text","value":" de Marty Cagan, les deux livres que je regrette tellement de pas avoir lu il y a plusieurs années. Vous devez le lire :)"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://www.amazon.com/Turn-Ship-Around-Turning-Followers-ebook/dp/B00AFPVP0Y/","rel":["nofollow"]},"children":[{"type":"text","value":"Turn the ship around"}]},{"type":"text","value":" de David Marquet, sur le leadership et la façon de créer des relations leader/leader"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://www.amazon.com/Future-Management-Gary-Hamel-ebook/dp/B004OC07OE/","rel":["nofollow"]},"children":[{"type":"text","value":"The future of management"}]},{"type":"text","value":" de Gary Hamel, un must read sur l’innovation et les structures managériales"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://www.amazon.com/Measure-What-Matters-Google-Foundation-ebook/dp/B078FZ9SYB/","rel":["nofollow"]},"children":[{"type":"text","value":"Measure what matters"}]},{"type":"text","value":" de John Doerr sur l’utilisation des OKR"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://www.amazon.fr/dp/B015ZGAAUI/","rel":["nofollow"]},"children":[{"type":"text","value":"On m’avait dit que c’était impossible"}]},{"type":"text","value":" de Jean Baptiste Rudelle sur l’esprit entrepreneurial"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://www.tech.rocks/","rel":["nofollow"]},"children":[{"type":"text","value":"https://www.tech.rocks/"}]},{"type":"text","value":" pour les tech leaders en France, super communauté permettant d’échanger sur nos bonnes pratiques"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://randsinrepose.com/welcome-to-rands-leadership-slack/","rel":["nofollow"]},"children":[{"type":"text","value":"https://randsinrepose.com/welcome-to-rands-leadership-slack/"}]},{"type":"text","value":" pour les tech leaders partout dans le monde (14k inscrits)"}]}]}]},"id":"1727","date":"2021-05-03","categories":["waza"],"tags":["cto","scale","startup"],"img":"Illustration_sans_titre-10-1.jpg","cover":"cover3.jpg","readingTime":{"text":"18 min read","minutes":17.39,"time":1043400,"words":3478},"body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Il y a un moment que je pensais faire un billet sur le rôle d'un CTO dans une startup. Cependant je me disais toujours que ce n’était pas intéressant, qu’il faudrait en parler quand la boîte serait bien plus grande, quand nous serions une licorne etc..."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et c'est ainsi que j'ai fait patienter ce billet pendant des mois, puis des années... "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Cependant au fil des années je me suis rendu compte que le chemin parcouru pouvait déjà servir à d'autres. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"J'ai profité moi-même et je profite encore des retours d'expériences de nombreux autres tech leaders et entrepreneurs qui sont à des stades plus avancés. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mais si je lis et je suis très inspiré par des entrepreneurs ou des product leaders à succès comme Jean Baptiste Rudelle, Reid Hoffman, Marissa Mayer, Marty Cagan, je sais également que lorsqu'on démarre une boîte, ces personnes ne peuvent pas nous aider. Leur quotidien n'a aucun rapport avec le mien."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"De plus, s'il existe bien sûr des centaines de milliers de tech leaders qui sont CTO d'ESN, directeurs de développement etc... avec des équipes d'ingénierie plus grandes que la taille de Malt en entier, je pense que le métier de CTO dans un contexte de startup en croissance a quelques spécificités. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et c'est ainsi que je me suis décidé à parler du rôle de CTO, de la création d'une startup à son passage à Scale-up."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Pour situer le contexte, je suis donc CTO et co-fondateur de Malt, une place de marché permettant à des freelances de travailler avec des entreprises de toutes tailles, des PME jusqu'aux grands groupes du CAC40 et désormais dans plusieurs pays Européens avec des bureaux en France, Espagne et Allemagne."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La société a doublé de taille quasiment chaque année (sauf 2020...), passant de 3 personnes en 2013 à 200 en 2021. L'équipe produit fait actuellement 50 personnes. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Sur les 18 prochains mois nous prévoyons de doubler la taille de l’équipe produit à une centaine de personnes et d’accélérer notre expansion en Europe, nous faisant entrer dans le statut des Scale-up."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Reprenons depuis le début."}]},{"type":"element","tag":"h2","props":{"id":"cto-chef-de-soi-même-dans-une-équipe-de-1-2013-2014"},"children":[{"type":"text","value":"CTO, chef de soi-même, dans une équipe de 1 (2013-2014)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://eventuallycoding.com/wp-content/uploads/2021/05/Illustration_sans_titre-10-1.jpg","rel":["nofollow"]},"children":[{"type":"element","tag":"img","props":{"alt":"","src":"/images/Illustration_sans_titre-10-1.jpg"},"children":[]}]}]},{"type":"element","tag":"h3","props":{"id":"il-faut-vraiment-un-cto-pour-démarrer-une-startup-"},"children":[{"type":"text","value":"Il faut vraiment un CTO pour démarrer une startup ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Malt a démarré par une rencontre en 2012. A ce moment-là, nous sommes 3 : Jean Baptiste Lemée, Vincent Huguet et moi-même. L'association va donc compter 2 \"CTO\" et un CEO."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"J'ai souvent des discussions sur les meilleures équipes pour démarrer une startup. Est-ce qu'on peut démarrer seul ? Et si non, quelle est la meilleure composition d'équipe ? Comment doit-on répartir les rôles etc... "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ce serait un article beaucoup trop long si j'essayais de répondre à tous ces sujets mais je vais me concentrer sur le rôle de CTO. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Je ne vais pas y aller par quatre chemins : de mon point de vue, le rôle de CTO est crucial pour une boite qui veut construire un produit."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Je ne connais aucune startup qui a passé le cap des 3/5 ans sans CTO. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Entendu de la part d'investisseurs, c'est même un sérieux signal d’alerte dans un dossier de startup de venir sans un associé technique. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"On peut bien sûr démarrer une idée sans CTO. On peut faire des premières versions, et même faire un premier tour de financement, avec un produit réalisé par une agence, ou fait avec des outils no code. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mais à un moment, le CTO est nécessaire pour que la boite se développe. Le CTO va apporter la vision et la gouvernance technologique nécessaire pour la suite. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Par contre, et c'est ce que je vais essayer de décrire dans ce billet, le portrait type du CTO à ce stade n'est pas le même que le CTO dans une boite de 500 personnes et plus. "}]},{"type":"element","tag":"h3","props":{"id":"cto-cest-avant-tout-être-le-premier-développeur"},"children":[{"type":"text","value":"CTO c’est avant tout être le premier développeur"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En tant que co-CTO dans les premiers mois j'étais surtout chef de moi-même. J'étais avant tout développeur et ma principale activité avec Jean-Baptiste c'était de coder le site de Malt. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La définition du produit se faisait entre les 3 fondateurs. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"C'était un mélange de dev, de choix entre acheter et construire (le fameux buy or build) mais avec des bouts de ficelle. Il n'y a pas de plus gros enjeu que la rapidité à ce moment-là."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Alors bien sûr je ne voulais pas construire un château de cartes branlant mais il fallait être pragmatique et assurer une très bonne vitesse d'exécution. "}]},{"type":"element","tag":"h3","props":{"id":"full-stack-cto"},"children":[{"type":"text","value":"Full stack CTO"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"A ce stade on est au four et au moulin sur plein de sujets qu'on ne connaît pas : SEO, data analyse, data engineering (du pauvre), data science (encore plus du pauvre), admin sys, QA, PM, UX Designer, front, back etc... Vous définissez le produit et vous l’écrivez dans la foulée."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mais cela ne s’arrête pas au produit, c’est aussi le support IT, le support client, la finance etc..."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Bien sûr que je n'étais pas bon en tout. Et aujourd'hui on me chambre encore sur des captures d'écran de mes anciens forfaits en UX. De toute façon le CTO c'est la personne sur qui on peut ensuite coller toutes les casseroles de \"l'Historique\", avec un grand H et il faut vivre avec :)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En prenant la casquette d'entrepreneur, il faut se rappeler une phrase : \"Si vous n’avez pas honte de votre produit, c’est que vous l’avez sorti trop tard\". (Reid Hoffman, co-fondateur de Linkedin)."}]},{"type":"element","tag":"h3","props":{"id":"le-profil-type"},"children":[{"type":"text","value":"Le profil type"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Le profil type à cette phase, c'est une personne qui met les mains dans le cambouis et qui va vite. C'est également une personne qui aime apprendre des nouvelles choses et est ok pour être constamment hors de sa zone de confort. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Par nature un bon ingénieur est rationnel, rigoureux, méthodique. Mais attention, le dogmatisme est un ennemi à cette étape. Il faut accepter une dose de naïveté créative et les très nombreux compromis avec ce que l'on aurait pu faire dans des équipes bien plus grandes. A cette étape, vous ne devez pas chercher à être une personne qui va structurer une équipe. Il ne faut pas passer de temps sur l’optimisation des process ou l’orga. "}]},{"type":"element","tag":"h3","props":{"id":"la-rémunération"},"children":[{"type":"text","value":"La rémunération"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Côté salaire, le CTO à cette phase ne doit pas s'attendre à une rémunération de nabab ^^ Vous gagneriez mieux ailleurs."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"C'est la difficulté majeure pour trouver un CTO lorsque vous n'en êtes pas un vous-même. Si j'exclus les jeunes CTO, toute personne expérimentée serait mieux payée ailleurs qu'en étant CTO de votre startup. Personnellement je gagnais bien mieux en étant freelance à ce moment là (>50%) et en travaillant moins.  "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Associer le CTO au capital est important pour l'engager sur la durée. Le CTO qui joint au démarrage s'attend à 30/45% des parts. Je ne m'apesentirais pas sur les critères de comment on détermine ça mais il existe "},{"type":"element","tag":"a","props":{"href":"http://foundrs.com/","rel":["nofollow"]},"children":[{"type":"text","value":"des sources sur internet"}]},{"type":"text","value":" pour vous aider. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Pour ma part, être associé était nécessaire mais à aucun moment je me suis dit que cela compenserait ce que je perdais. Bien sûr, quand on démarre on cherche à ce que la boite marche, mais de là à être sûr à 100% que la société sera un jour une réussite complète, on sait à quel point c'est un pari et que très peu de gens y arrivent. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"De mon côté, j'acceptais de gagner moins car je trouvais ça très enrichissant. J'ai toujours adoré créer mon propre produit, le faire grandir, apprendre des nouveaux métiers et être mon propre boss. La liberté que j'avais et l'impact que j'apportais m'ont motivé dans cette aventure au-delà de l'aspect financier. "}]},{"type":"element","tag":"h2","props":{"id":"cto-leader-de-squads-dans-une-startup-de-1-à-20--2014-2016"},"children":[{"type":"text","value":"CTO, leader de squads dans une startup de 1 à 20 :  (2014-2016)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"(équipe produit de 1 à 10)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ça y est, vous y êtes, les premières embauches dans l’équipe produit. Votre rôle de CPTO (Chief product and technology officer) grandit. La définition produit se fait toujours entre les fondateurs et vous êtes encore majoritairement les mains dans le cambouis à plus de 90% mais vous avez une autre responsabilité : créer une équipe. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"C'est une phase qui est en réalité pivot à plus d'un titre, mais je ne le savais pas encore."}]},{"type":"element","tag":"h3","props":{"id":"apprendre-à-se-virer-soi-même"},"children":[{"type":"text","value":"Apprendre à \"se virer soi-même\" "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ce sera l’un de vos mantras par la suite, comment se virer soi-même sans arrêt ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Désormais, il faut embaucher des collègues pour faire certains jobs et le faire mieux que vous. Fini les rôles de PM, UX, Front etc... "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"J'ai l'impression que certains CTO bloquent à cette étape, car ils n'arrivent pas à embaucher meilleurs qu'eux. Est-ce que c'est lié à un sentiment d’'insécurité ? Une façon de vouloir garder la main ? Aucune idée. Mais ce sera très dur pour la suite…"}]},{"type":"element","tag":"h3","props":{"id":"le-cto-toujours-développeur"},"children":[{"type":"text","value":"Le CTO, toujours développeur"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"A cette époque j’étais à 90% développeur. 2015 correspond à mon pic d’activité en termes de commits sur Github (voir plus bas). L’équipe produit faisait une dizaine de personnes à la fin de cette période. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dans une équipe de cette taille, l’autonomie est grande, les méthodes utilisées sont très légères et le fameux “time to market” (la capacité à passer rapidement de l’idée aux utilisateurs) doit rester très court. Il n’y a pas d’estimation, pas de sprint, de scrum master, de QA, d’OKR et j’en passe. Les décisions étaient rapides avec peu de personnes à convaincre à chaque fois. La gestion du changement était “simple” (et pourtant on s’est parfois pris les pieds dans le tapis quand même)."}]},{"type":"element","tag":"h3","props":{"id":"une-carrière-de-recruteur-qui-démarre"},"children":[{"type":"text","value":"Une carrière de recruteur qui démarre "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Le recrutement c'est 90% du succès de la boîte et c’est pourquoi j'y ai passé un temps phénoménal. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En cumulé j'ai dû voir presque 1 milliers de CV. J'ai fait passer 300 premiers entretiens en visio, entre 100 et 150 entretiens physiques (en comptant aussi pour les autres rôles dans l'entreprise même si je n'étais pas le recruteur principal dans ces cas là). "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Le recrutement c'est aussi faire des choix sur l'organisation de l'équipe, la culture que vous allez créer, les valeurs fondamentales que vous allez insuffler. Cela va se traduire par la séniorité, l’autonomie, l’adaptabilité, l’esprit entrepreneurial des personnes recherchées.  "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"J'ai fait un choix structurant à l'époque, j'ai choisi lors du recrutement de ne prendre que des seniors, des personnes totalement autonomes. Je ne voulais pas faire de management et gérer des juniors ou coacher des intermédiaires. L'organisation est restée légère, la communication simple, l'autonomie grande. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Cette philosophie m'a permis de continuer à développer pendant un bon moment sur Malt mais au-delà de ça, il me semble que c'est un facteur de réussite et de notre croissance. "}]},{"type":"element","tag":"h3","props":{"id":"votre-rôle-de-cpoctofondateur-nécessite-plus-de-temps"},"children":[{"type":"text","value":"Votre rôle de CPO/CTO/fondateur nécessite plus de temps."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Au-delà de votre rôle dans l'équipe produit, votre rôle dans l'entreprise prend un peu plus d'importance aussi. Vous avez plus d'interactions avec plus de gens en dehors de vos compétences, des métiers apparaissent comme le support, la fonction commerciale, le marketing et vous avez un rôle de business enabler (désolé je n'ai pas trouvé de traductions satisfaisantes en français). Vous portez la “voix de la technologie et du produit”, c’est à vous d’identifier quand elle peut servir aux besoins de la société, quand elle peut apporter des réponses à vos clients mais aussi quand il faut savoir faire des choix (et dire non)."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Je précise bien sûr que ce rôle ne se faisait pas en solo. Comme depuis la création, c’est le trio de fondateurs qui joue le rôle de fullstack entrepreneur à tous les niveaux."}]},{"type":"element","tag":"h2","props":{"id":"cto-leader-de-guilde-dans-une-entreprise-de-20-à-50-2017-2018"},"children":[{"type":"text","value":"CTO, leader de guilde dans une entreprise de 20 à 50 (2017-2018)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"(equipe produit de 10 à 30)"}]},{"type":"element","tag":"h3","props":{"id":"des-interactions-plus-complexes"},"children":[{"type":"text","value":"Des interactions plus complexes"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Sur l’année 2017-2018 j’ai passé une grande partie de mon temps en recrutement. Et en faisant cela, j’ai passé le seuil fatidique des 10 personnes dans l’équipe produit."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ce seuil de 10 commence à changer le fonctionnement d’une équipe. Les interactions sont plus nombreuses, la communication devient plus complexe et des petits groupes commencent à se former pour rester efficaces. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La loi de Brooks illustre parfaitement cette complexité croissante dans les interactions d’un groupe passé un certain seuil :"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://eventuallycoding.com/wp-content/uploads/2021/05/pasted-image-0.png","rel":["nofollow"]},"children":[{"type":"element","tag":"img","props":{"alt":"","src":"/images/pasted-image-0.png"},"children":[]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"C’est à ce moment là que j’étais ravi de l’équipe déjà en place, sur laquelle j’ai pu m’appuyer. Le fait d’avoir recruté beaucoup de seniors a limité le besoin en management humain. Certains leaders ont naturellement émergé et l’équipe a pu continuer à fonctionner sans management lourd pendant encore un moment. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mon modèle était celui de la précédente boîte que j’avais cofondée, Lateral-Thoughts : la sociocratie et la gouvernance par cercle."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Le rôle de CTO à cette étape est très centré sur l’équipe, très présent à tous les niveaux, le CTO est là pour pallier l’absence de structure formelle. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et ce n’est pas anormal, il était encore trop tôt pour apporter plus de structure, et en même temps il fallait commencer à travailler sur des sujets comme l’alignement et la vision long terme."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Sans être un pur manager de personnes, j’ai dû améliorer fortement le processus de recrutement et travailler sur des sujets comme le career path ou les grilles de salaires. Je n’ai par contre pas mis en place de processus formel pour voir chaque personne dans l’équipe. Je comptais à ce moment-là sur le fait que la discussion devait se faire naturellement et que chacun était assez grand et assez proche de moi pour me parler des sujets qui le tracassaient. Spoiler, ça a marché, en partie. A cette étape c’était encore possible, on se voyait beaucoup et la communication était très ouverte. Par contre lors de la phase d’après ce principe ne fonctionnait plus et d’autant plus dans le contexte de la crise du COVID.  "}]},{"type":"element","tag":"h3","props":{"id":"un-rôle-de-développeur-qui-diminue"},"children":[{"type":"text","value":"Un rôle de développeur qui diminue"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En tant que CTO je dirais que ma part de temps passé en développement a dû baisser. Je dirais naïvement aux alentours de 60%."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Le rôle d’organisateur a pris plus de place. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"C’est à ce moment que j’ai commencé à me définir comme le GO (Gentil organisateur) de l’équipe. La personne chargée de mettre de l’huile dans les rouages. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"C’était toujours un rôle schizophrénique : développeur, coach, manager, scrum master. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Si le développement pur a diminué, il est resté important et clé sur les orientations et choix technologiques. L’activité a changé de nature mais je dirais que ce rôle de développeur restait majeur pour la réussite de la société. A ce stade j’étais en mesure d’apporter encore des changements significatifs sur l’application en quelques jours."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Pour illustrer avec des chiffres, voici un graphe représentant mon activité Github sur la période 2012 jusqu'à aujourd’hui et qui illustre bien la baisse d’activité sur 2017-2018 (et le pic de 2015) :"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://eventuallycoding.com/wp-content/uploads/2021/05/pasted-image-0-1.png","rel":["nofollow"]},"children":[{"type":"element","tag":"img","props":{"alt":"","src":"/images/pasted-image-0-1.png"},"children":[]}]}]},{"type":"element","tag":"h3","props":{"id":"une-ambiguïté-permanente"},"children":[{"type":"text","value":"Une ambiguïté permanente"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Comme dit plus haut, en tant que CTO (et fondateur), vous changez sans arrêt de casquettes, plusieurs fois dans le même meeting. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Vous êtes toujours un “full stack CTO” mais entre-temps vous avez recruté et ces changements de casquettes permanents peuvent amener un peu de confusion pour des membres de l’entreprise qui arrivent.  "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Il peut être difficile pour tout le monde de savoir quand le fondateur s’exprime sur un sujet en tant que “participant”, par exemple dans une session de brainstorming, et quand le CTO s’exprime en tant que leader technique, pour exprimer une direction à prendre ou en tant que CPO pour établir la stratégie produit. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"J’ai eu de nombreuses discussions avec des membres de Malt pour clarifier mes positions, assumer ce rôle de CTO qui était jusqu’alors surtout une étiquette que je ne revendiquais pas, améliorer ma communication. Et je remercie grandement toutes les personnes qui à cette époque m’ont bousculé, fait réfléchir et grandir. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"C’était nécessaire juste avant la phase d’après car j’allais devoir faire des choix plus forts sur ce que je voulais faire ou non."}]},{"type":"element","tag":"h2","props":{"id":"cto-leader-de-tribe-dans-une-startup-de-50-à-200-2018-2021"},"children":[{"type":"text","value":"CTO, leader de tribe dans une startup de 50 à 200 (2018-2021)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"(équipe produit de 30 à 50)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La période 2018-2021 est spéciale à plus d’un titre. Entre 2018 et 2020 la société a doublé de taille chaque année. 2020 a été marqué par le COVID avec une gestion différente à mettre en place et un turnover qui a décollé. Dans la même période, la société a progressé de plusieurs crans à tous les niveaux. "}]},{"type":"element","tag":"h3","props":{"id":"une-équipe-quil-faut-commencer-à-structurer"},"children":[{"type":"text","value":"Une équipe qu’il faut commencer à structurer"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Je l’évoquais plus haut, la complexité de la communication quand on augmente le nombre de personnes impliquées croît de façon exponentielle et c’est lors de cette période qu’il a fallu passer de nombreux caps."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En tant que CTO, il était temps d’apporter une structure de façon à ne pas dégrader la vitesse d'exécution. Si une structuration trop forte aurait pu ralentir Malt au début, cela devenait nécessaire pour passer ensuite à l’échelle. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"C’est le moment de prendre conscience qu’une équipe produit nécessite une coordination et une animation impeccable. Dans une startup tech comme Malt, à ce stade de développement, la taille de l’équipe produit devrait prendre en ratio entre 25 et 50% de l’effectif total (ratio qui diminue avec la croissance par la suite). C’est donc l’une des équipes les plus grandes. Chaque squad/feature team/impact team/tribe, appelez les comme vous voulez, correspond à des collaborations de plusieurs métiers différents. Ce ne sont pas juste des mercenaires qui bossent chacun de leur côté. Chaque personne, chaque décision a une influence sur une autre personne du groupe à court ou moyen terme. D’ailleurs la quasi-totalité des personnes dans la société repose sur le produit ou des outils réalisés par cette équipe."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La dette technique ou métier est collective. Mais si on le voit aussi de façon positive, chaque amélioration, chaque bonne pratique améliore de façon substantielle toute l’équipe et l’entreprise. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Bref, c’est une mécanique complexe et, heureusement, il existe beaucoup d’entreprises qui partagent leurs meilleures pratiques. En tant que CTO il va falloir appliquer une veille constante sur ces sujets, de la même façon que vous aviez l’habitude d’en faire sur des sujets plus techniques. Je vous propose d’ailleurs une liste de ressources en bas de ce billet."}]},{"type":"element","tag":"h3","props":{"id":"lheure-des-choix"},"children":[{"type":"text","value":"L’heure des choix"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Je l’évoquais au tout début, le but du CTO est de “se virer soi-même” avec la croissance de la startup. Et le passage à 100 dans l’entreprise a accéléré le mouvement. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"A cette étape, ça a été l’heure des choix. En tant que CTO je ne pouvais plus développer, organiser, établir la stratégie, recruter, coacher etc… Ou alors en faisant tout mal."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dans la suite de ce paragraphe je vais évoquer les choix personnels que j’ai fait. Chaque CTO (et c’est d’autant plus vrai pour un fondateur) fera des choix différents. Il n’y a pas de bonne ou mauvaise solution, il faut aussi faire avec ces forces, faiblesses, et centres d’intérêt."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Première décision, j’ai presque stoppé tout développement. Ok parfois ça me reprend mais c’est anecdotique. J’ai toujours besoin de comprendre ce qui se fait mais c’est surtout par curiosité. Je ne dois jamais être dans le chemin bloquant pour un développement."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ensuite, je me suis toujours considéré comme un contributeur individuel, pas un manager. Donc par la suite j’ai fait venir un VP engineering pour s’occuper de la partie management et process. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Nous avons fait venir un CPO sur la stratégie produit en 2018. Cependant ce rôle a disparu en 2020 et j’ai un rôle qui de facto est redevenu celui de CPTO mais avec une équipe de leads produit hyper costauds pour m’aider et avec qui je suis ravi de travailler quotidiennement."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Grâce à ces leads, je reste très impliqué au niveau gouvernance sur des sujets qui sont et vont rester cruciaux pour le passage à l’échelle de Malt. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ils m’accompagnent dans tous les domaines clés : sécurité, architecture, data, cloudops, stratégie produit, design etc... Je passe beaucoup de temps avec eux sur la définition de la stratégie et des objectifs, les problèmes à résoudre mais ensuite c’est eux qui sont autonomes sur la façon de faire et j’apporte de l’aide pour mettre de l’huile dans les rouages quand c’est nécessaire. "}]},{"type":"element","tag":"h2","props":{"id":"et-la-suite--le-passage-en-scale-up"},"children":[{"type":"text","value":"Et la suite ? Le passage en Scale-up"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Comme je l’indiquais dans l’introduction, Malt commence à entrer dans le monde restreint des Scale-up. Le prochain objectif pour répondre à la croissance de Malt et son expansion va être de continuer à investir dans l’équipe produit. Elle pourrait doubler dans les 18 mois qui viennent et passer à une centaine de personnes. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La mise à l’échelle de cette équipe va demander un travail énorme. Une grande partie de ce travail repose sur le CPTO et l’équipe de leads produits que je citais précédemment. "}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Les enjeux sont grands, vitesse de recrutement, qualité de la formation des nouveaux arrivants, autonomie des équipes, vitesse d'exécution, stratégie produit, user research, OKR, mise à l’échelle des technologies."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Le rôle de CPTO sera sans doute très stratégique. Je vais travailler sur la déclinaison des OKR à chaque niveau et sur le suivi et le coaching de l’équipe des leads produits pour répondre à ces sujets. Tout du moins c’est ce que j’imagine mais le passé m’a montré que le plus important sera l’adaptabilité."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ce sera peut être le sujet d’un nouveau billet dans 18 mois."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et si vous voulez faire partie de l'aventure, nous recrutons constamment sur France entière. Contactez-nous."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ressources intéressantes en tant que CPTO :"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://www.amazon.com/INSPIRED-Create-Tech-Products-Customers-ebook/dp/B077NRB36N","rel":["nofollow"]},"children":[{"type":"text","value":"Inspired"}]},{"type":"text","value":" et "},{"type":"element","tag":"a","props":{"href":"https://www.amazon.com/EMPOWERED-Ordinary-Extraordinary-Products-Silicon-ebook/dp/B08LPKRD5L/","rel":["nofollow"]},"children":[{"type":"text","value":"Empowered"}]},{"type":"text","value":" de Marty Cagan, les deux livres que je regrette tellement de pas avoir lu il y a plusieurs années. Vous devez le lire :)"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://www.amazon.com/Turn-Ship-Around-Turning-Followers-ebook/dp/B00AFPVP0Y/","rel":["nofollow"]},"children":[{"type":"text","value":"Turn the ship around"}]},{"type":"text","value":" de David Marquet, sur le leadership et la façon de créer des relations leader/leader"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://www.amazon.com/Future-Management-Gary-Hamel-ebook/dp/B004OC07OE/","rel":["nofollow"]},"children":[{"type":"text","value":"The future of management"}]},{"type":"text","value":" de Gary Hamel, un must read sur l’innovation et les structures managériales"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://www.amazon.com/Measure-What-Matters-Google-Foundation-ebook/dp/B078FZ9SYB/","rel":["nofollow"]},"children":[{"type":"text","value":"Measure what matters"}]},{"type":"text","value":" de John Doerr sur l’utilisation des OKR"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://www.amazon.fr/dp/B015ZGAAUI/","rel":["nofollow"]},"children":[{"type":"text","value":"On m’avait dit que c’était impossible"}]},{"type":"text","value":" de Jean Baptiste Rudelle sur l’esprit entrepreneurial"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://www.tech.rocks/","rel":["nofollow"]},"children":[{"type":"text","value":"https://www.tech.rocks/"}]},{"type":"text","value":" pour les tech leaders en France, super communauté permettant d’échanger sur nos bonnes pratiques"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://randsinrepose.com/welcome-to-rands-leadership-slack/","rel":["nofollow"]},"children":[{"type":"text","value":"https://randsinrepose.com/welcome-to-rands-leadership-slack/"}]},{"type":"text","value":" pour les tech leaders partout dans le monde (14k inscrits)"}]}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"cto-chef-de-soi-même-dans-une-équipe-de-1-2013-2014","depth":2,"text":"CTO, chef de soi-même, dans une équipe de 1 (2013-2014)","children":[{"id":"il-faut-vraiment-un-cto-pour-démarrer-une-startup-","depth":3,"text":"Il faut vraiment un CTO pour démarrer une startup ?"},{"id":"cto-cest-avant-tout-être-le-premier-développeur","depth":3,"text":"CTO c’est avant tout être le premier développeur"},{"id":"full-stack-cto","depth":3,"text":"Full stack CTO"},{"id":"le-profil-type","depth":3,"text":"Le profil type"},{"id":"la-rémunération","depth":3,"text":"La rémunération"}]},{"id":"cto-leader-de-squads-dans-une-startup-de-1-à-20--2014-2016","depth":2,"text":"CTO, leader de squads dans une startup de 1 à 20 :  (2014-2016)","children":[{"id":"apprendre-à-se-virer-soi-même","depth":3,"text":"Apprendre à \"se virer soi-même\" "},{"id":"le-cto-toujours-développeur","depth":3,"text":"Le CTO, toujours développeur"},{"id":"une-carrière-de-recruteur-qui-démarre","depth":3,"text":"Une carrière de recruteur qui démarre "},{"id":"votre-rôle-de-cpoctofondateur-nécessite-plus-de-temps","depth":3,"text":"Votre rôle de CPO/CTO/fondateur nécessite plus de temps."}]},{"id":"cto-leader-de-guilde-dans-une-entreprise-de-20-à-50-2017-2018","depth":2,"text":"CTO, leader de guilde dans une entreprise de 20 à 50 (2017-2018)","children":[{"id":"des-interactions-plus-complexes","depth":3,"text":"Des interactions plus complexes"},{"id":"un-rôle-de-développeur-qui-diminue","depth":3,"text":"Un rôle de développeur qui diminue"},{"id":"une-ambiguïté-permanente","depth":3,"text":"Une ambiguïté permanente"}]},{"id":"cto-leader-de-tribe-dans-une-startup-de-50-à-200-2018-2021","depth":2,"text":"CTO, leader de tribe dans une startup de 50 à 200 (2018-2021)","children":[{"id":"une-équipe-quil-faut-commencer-à-structurer","depth":3,"text":"Une équipe qu’il faut commencer à structurer"},{"id":"lheure-des-choix","depth":3,"text":"L’heure des choix"}]},{"id":"et-la-suite--le-passage-en-scale-up","depth":2,"text":"Et la suite ? Le passage en Scale-up"}]}},"_type":"markdown","_id":"content:articles:2021:05:03:cto-de-startup-a-scaleup.md","_source":"content","_file":"articles/2021/05/03/cto-de-startup-a-scaleup.md","_extension":"md"}