{"_path":"/articles/2023/01/faut-il-reecrire-de-zero","_dir":"01","_draft":false,"_partial":false,"_locale":"en","_empty":false,"title":"Et s'il était temps de tout réécrire ?","description":"Une réécriture, c'est souvent l'aboutissement d'une dette technique trop lourde à rembourser, un aveu d'échec par rapport à une application qu'on ne parvient plus à faire évoluer, le cout et les risques étant trop importants. Mais si les évènements qui amènent à tout réécrire sont déjà en soit un problème, la réécriture elle-même est un piège qui peut tuer un produit.","excerpt":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ce titre sonne comme un message d'avertissement n'est-ce pas ? Je suis plutôt très frileux quand il s'agit de tout réécrire en partant de zéro et je rejoins l'avis de Joel Spolsky qui en parlait comme "},{"type":"element","tag":"a","props":{"href":"https://www.joelonsoftware.com/2000/04/06/things-you-should-never-do-part-i/","rel":["nofollow"]},"children":[{"type":"text","value":"l'une des plus grosses erreurs à faire"}]},{"type":"text","value":"."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Une réécriture, c'est souvent l'aboutissement d'une dette technique trop lourde à rembourser, un aveu d'échec par rapport à une application qu'on ne parvient plus à faire évoluer, le coût et les risques étant trop importants. Mais si les évènements qui amènent à tout réécrire sont déjà en soit un problème, la réécriture elle-même est un piège qui peut tuer un produit."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nLes exemples sont légions. De nombreuse entreprise ont perdu des années à réécrire un produit puis mis la clé sous la porte quand le marché ne les a pas attendus."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mais pourquoi je vous parle de tout ça ? Est-ce que Malt est dans une situation aussi catastrophique qu'il est nécessaire de tout refaire ?\nEh bien, c'est ce que je vous propose de voir dans ce billet. On va parler de l'évolution de la stack technique de Malt depuis 2012, de gestion de la dette et de comment nous envisageons de rembourser notre dette de façon itérative par composants."}]},{"type":"element","tag":"h2","props":{"id":"un-petit-peu-dhistoire"},"children":[{"type":"text","value":"Un petit peu d'histoire"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La première version de Malt date de 2012. C'était à ce moment-là une application monolithique Java/Spring boot, qui tournait sur un PAAS (Heroku) avec une base de données mongo et un moteur de recherche Elasticsearch.\nLe frontend était majoritairement en vanilla JS avec quelques touches de AngularJS.\nOn utilisait des JSP comme moteur de templating, choix plutôt bon à ce moment précis."}]},{"type":"element","tag":"image","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"Stack 2012","src":"/images/stack-2012.jpg"},"children":[]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En 2014 l'application s'est étoffé. J'ai pu passer à temps plein suite à une levée de fonds. Nous sommes 2 cofondateurs sur 3 à avoir une casquette technique et travailler sur le site.\nEntre temps on a introduit Redis pour la gestion des sessions et du cache et RabbitMQ pour introduire du découplage entre certaines parties fonctionnelles via un pattern observer."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"On se marche un tout petit peu dessus de temps en temps et on conclut que ce serait intéressant de pouvoir sortir des parties du site indépendamment. Cela permettait par exemple de sortir le moteur de recherche tandis qu'on continuerait à avoir le moteur de paiement en brouillon.\nEn plus de cela, le cout du service Heroku et de ces addons (mongo et Redis), la robustesse de certains services en SAAS (Elastic notamment) font que l'alternative SAAS/PAAS commence à être moins pertinente."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"On décide donc de séparer l'application en plusieurs petites applications, de rajouter un reverse proxy Nginx devant et de tout faire tourner sur des serveurs dédiés OVH."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Même rétrospectivement, il est difficile de juger l'ensemble de ces décisions.\nLa séparation en plusieurs applications était discutable à ce stade. D'autant que nous utilisions déjà une stratégie de feature flipping pour désactiver des parties de code.\nMais la migration sur OVH, notamment pour des raisons de coût des addons était plutôt pragmatique et nous a apporté beaucoup de souplesse pour la suite."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Si cette partie vous intéresse, "},{"type":"element","tag":"a","props":{"href":"https://eventuallycoding.com/2014/05/09/paas-or-not-paas-that-is-the-question/","rel":["nofollow"]},"children":[{"type":"text","value":"un billet de blog sur la migration vers OVH avait été écrit à l'époque"}]},{"type":"text","value":"."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Pour l'anecdote, l'ensemble de l'application et des bases de données tournait sur une seule machine !"}]},{"type":"element","tag":"image","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"Stack 2014","src":"/images/stack-2014.jpg"},"children":[]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Entre 2014 et 2018, l'équipe Produit s'est étoffée jusqu'à 30 personnes. L'architecture s'est complexifiée pour répondre à des besoins plus forts en termes de résilience, sécurité, scalabilité.\nNous sommes notamment passés en partie sur OVH Cloud. Ça a été l'occasion d'introduire Terraform. Consul a été introduit pour la découvrabilité des services.\nVault a été ajouté pour la gestion des clés privée. Postgresql a été introduit en 2019 suite à de nombreuses déconvenues avec Mongo."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Côté frontend on a introduit Vue.js et supprimé AngularJs (EDIT : en fait, apparemment pas partout). Nos modules en Vanilla JS se sont structurés pour donner lieu à un petit framework maison assez léger. Handlebars nous a permis de partager des templates de pages entre client et serveurs et donc résoudre quelques soucis de SEO."}]},{"type":"element","tag":"image","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"Stack 2019","src":"/images/stack-2018.jpg"},"children":[]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Suite à 2018, nous avons rencontré de nombreuses limitations sur le cloud OVH. A l'époque leur implémentation de l'api OpenStack n'était pas stable et nous rencontrions de nombreuses erreurs 500. Le manque de services inclus nous imposait de reconstruire des solutions, sans que ce soit notre cœur de métier (la gestion des clés privée, la gestion des logs, la réplication mongo vers PG ou la création d'un datawarehouse par exemple).\nNous avons donc décidé d'aller sur GCP en 2019 pour bénéficier de services plus packagés. Plus exactement nous tournons désormais sur GKE (Kubernetes managé). Traefik a définitivement remplacé Nginx en tant que reverse proxy grâce à son intégration native avec Docker/Kube."}]},{"type":"element","tag":"image","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"Stack 2019","src":"/images/stack-2019.jpg"},"children":[]}]}]},{"type":"element","tag":"h2","props":{"id":"quest-ce-que-la-dette-technique-"},"children":[{"type":"text","value":"Qu'est ce que la dette technique ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mis bout à bout, chaque décision décrite précédemment s'explique. Elles ont toutes permis de construire la plateforme Malt que l'on connaît aujourd'hui et je les valide donc à posteriori. Refaire l'histoire ne préjuge pas que nous serions arrivés au même résultat."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nMais si ces décisions sont bonnes, pourquoi parler de dette technique ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Eh bien parce que la dette, ce n'est pas uniquement lié au code de mauvaise qualité."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Déjà posons une définition simple, la dette technique, c'est la somme des choix visant à gagner du temps mais qui vont induire des couts futurs à rembourser.\nPour simplifier, la dette permet d'acheter du temps qu'il faudra rembourser par la suite."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"J'aime beaucoup l'analogie avec la dette financière car :"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"la dette n'est pas toujours négative, elle peut servir à aller vite à un instant T, c'est de l'investissement. Dans le cas idéal, on peut le rembourser quand on a obtenu les moyens pour le faire."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"une dette se rembourse avec des intérêts, ces intérêts se cumulent dans le temps, c'est le principe des intérêts composés"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"lorsqu'on ne peut plus rembourser, on fait défaut sur une dette. Ce défaut se traduit par une réécriture complète de l'application avec le cout associé. Dans le pire des cas, c'est la fin du produit et de l'entreprise."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"la dette technique est soumise à l'inflation et la déflation. Des évènements extérieurs peuvent la faire exploser (ou annuler). Elle n'est donc pas totalement prédictible"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Concernant le dernier point, la dette peut évoluer pour des raisons externes or c'est justement un point important pour répondre à la question initiale.\nLes choix effectués sur Malt ont tous été fait en fonction d'un contexte donné."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mais :"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"les contraintes ayant mené à certains choix ont évolué. Par exemple des technologies inexistantes en 2012 sont désormais standard (la gestion du SSR par exemple)"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"la taille de l'équipe entraine des contraintes supplémentaires sur les standards de développement"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"la taille de l'entreprise et de la base utilisateur entraine des contraintes supplémentaires sur les technologies à mettre en œuvre (Exemple, un batch qui prend 10minutes sur une faible volumétrie et qui prend 2h aujourd'hui)"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"etc..."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Bref, certains choix qui ne sont pas vus initialement comme de la dette peuvent en devenir par la suite."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Attention, je ne suis pas en train de dire qu'il faut anticiper les contraintes futures. Pour beaucoup d'entre elles je préconise d'attendre jusqu'au dernier moment car leur résolution induit souvent une complexité supplémentaire qui a aussi un cout et qui grève la vélocité d'équipe."}]},{"type":"element","tag":"h2","props":{"id":"constat-sur-malt"},"children":[{"type":"text","value":"Constat sur Malt"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Sur Malt nous avons toujours eu un principe fort d'autonomie.\nChaque personne est encouragée à avoir un regard critique, pour proposer et améliorer la stack technologique. Ces choix sont discutés, adoptés ou rejetés collégialement."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Cette approche participative nous a été très utile. Les choix ont toujours été très efficaces, innovants tout en restant pragmatiques."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Par exemple nous avons :"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://eventuallycoding.com/2019/07/03/mongodb-vers-postgresql","rel":["nofollow"]},"children":[{"type":"text","value":"introduit PGSQL pour remplacer progressivement Mongo"}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"basculé progressivement de Java à Kotlin"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"basculé progressivement de Javascript à Typescript"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mais, dans notre approche, nous avons aussi souvent décidé de faire ces ajouts de façon progressive sur le nouveau code, sans effectuer de migration complète de l'ancien code.\nC'était un choix logique à ce moment-là, mais qui a creusé notre dette technique."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ce choix a une conséquence forte : l'explosion des dépendances."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nEt ces dépendances ont des impacts importants"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"sur la charge cognitive de chaque développeur qui tombe régulièrement sur des façons différentes de travailler"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"sur les temps de démarrage des applications qui chargent de nombreuses dépendances"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"sur les stations de travail qui sont doivent faire tourner une stack de plus en plus complexe"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"sur intellij qui galère de façon significative. Pas uniquement parce que la base de code est importante, mais aussi parce qu'il a de nombreuses librairies et langages à analyser. Et chaque plugin coute !"},{"type":"element","tag":"sup","props":{},"children":[{"type":"element","tag":"a","props":{"href":"#user-content-fn-1","ariaDescribedBy":"footnote-label","dataFootnoteRef":true,"id":"user-content-fnref-1"},"children":[{"type":"text","value":"1"}]}]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Nous avons de nombreuses métriques que l'on regarde constamment, sur nos temps de builds, taux de disponibilité et j'en passe. Mais pour certaines, l'évolution s'est faite progressivement dans le temps, ce qui n'attire pas l'attention."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nPar exemple"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"le temps de démarrage d'une appli est désormais supérieur à 50secondes sur certains postes de travail"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"les stations de dev nécessitent une configuration très lourde pour faire tourner l'ensemble de la stack (imaginez docker avec des containers ES, Redis, Mongo, PgSQL, Traefik etc...)."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"les indexations intellij qui peuvent durer des heures avec une empreinte mémoire > 8Go dans les dernières versions"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et tout cela entraîne une augmentation importante des temps de cycle de développement."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Malgré tout, jusqu'ici tout va encore bien."}]},{"type":"element","tag":"image","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"This is fine","src":"/images/thisisfine.jpg"},"children":[]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mais nous savons par expérience que nous sommes arrivés au moment où, si nous ne prenons pas d'actions fortes, dans un an nous devrons faire un défaut partiel de notre dette, qui se traduirait par un freeze code de plusieurs mois pour rembourser."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et ça, c'est ce qu'il faut éviter à tout prix."}]},{"type":"element","tag":"h2","props":{"id":"kiss"},"children":[{"type":"text","value":"KISS"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En 2022, parmi nos 5 OKR d'entreprise, nous avions un OKR un peu particulier : KISS, Keep it simple stupid."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Cet enjeu de simplification rejoint totalement le sujet développé dans le chapitre précédent. Il faut simplifier pour diminuer la "},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"charge cognitive par développeur"}]},{"type":"text","value":" et "},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"la charge induite sur nos outils"}]},{"type":"text","value":"."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Pour faire le lien avec l'introduction de ce billet, nous n'allons pas réécrire tout Malt de zéro bien évidemment. Mais nous allons travailler à simplifier Malt à travers plusieurs projets."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et c'est l'un de ces projets dont je souhaite parler prochainement, la modernisation complète de notre stack frontend, comment passer de 6 technos frontend à uniquement une seule, et comment se débarrasser totalement de Java côté frontend (les fameuses JSP)."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nDe façon un peu poétique, ce projet s'intitule Singapore car c'est l'histoire d'un voyage en dehors de l'île de Java."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Restez à l'écoute, ce sera le sujet du prochain billet."}]},{"type":"element","tag":"section","props":{"className":["footnotes"],"dataFootnotes":true},"children":[{"type":"element","tag":"h2","props":{"id":"footnote-label","className":["sr-only"]},"children":[{"type":"text","value":"Footnotes"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{"id":"user-content-fn-1"},"children":[{"type":"text","value":"Un exemple simple pour comprendre. Nous avons aujourd'hui 3 façons différentes d'interagir avec PgSQL en Java : mybatis, Jooq, Spring Template. La grande majorité utilise Jooq mais Intellij doit mobiliser 3 plugins pour analyser, proposer de l'auto complétion etc... (Même si le plugin Spring est de toute façon actif par défaut) "},{"type":"element","tag":"a","props":{"href":"#user-content-fnref-1","ariaLabel":"Back to content","className":["data-footnote-backref"],"dataFootnoteBackref":true},"children":[{"type":"text","value":"↩"}]}]}]}]}]},"id":"9","date":"2023-01-02","tags":["rewrite","refactoring","malt"],"cover":"itsatrap.jpg","readingTime":{"text":"9 min read","minutes":8.64,"time":518400,"words":1728},"body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ce titre sonne comme un message d'avertissement n'est-ce pas ? Je suis plutôt très frileux quand il s'agit de tout réécrire en partant de zéro et je rejoins l'avis de Joel Spolsky qui en parlait comme "},{"type":"element","tag":"a","props":{"href":"https://www.joelonsoftware.com/2000/04/06/things-you-should-never-do-part-i/","rel":["nofollow"]},"children":[{"type":"text","value":"l'une des plus grosses erreurs à faire"}]},{"type":"text","value":"."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Une réécriture, c'est souvent l'aboutissement d'une dette technique trop lourde à rembourser, un aveu d'échec par rapport à une application qu'on ne parvient plus à faire évoluer, le coût et les risques étant trop importants. Mais si les évènements qui amènent à tout réécrire sont déjà en soit un problème, la réécriture elle-même est un piège qui peut tuer un produit."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nLes exemples sont légions. De nombreuse entreprise ont perdu des années à réécrire un produit puis mis la clé sous la porte quand le marché ne les a pas attendus."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mais pourquoi je vous parle de tout ça ? Est-ce que Malt est dans une situation aussi catastrophique qu'il est nécessaire de tout refaire ?\nEh bien, c'est ce que je vous propose de voir dans ce billet. On va parler de l'évolution de la stack technique de Malt depuis 2012, de gestion de la dette et de comment nous envisageons de rembourser notre dette de façon itérative par composants."}]},{"type":"element","tag":"h2","props":{"id":"un-petit-peu-dhistoire"},"children":[{"type":"text","value":"Un petit peu d'histoire"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La première version de Malt date de 2012. C'était à ce moment-là une application monolithique Java/Spring boot, qui tournait sur un PAAS (Heroku) avec une base de données mongo et un moteur de recherche Elasticsearch.\nLe frontend était majoritairement en vanilla JS avec quelques touches de AngularJS.\nOn utilisait des JSP comme moteur de templating, choix plutôt bon à ce moment précis."}]},{"type":"element","tag":"image","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"Stack 2012","src":"/images/stack-2012.jpg"},"children":[]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En 2014 l'application s'est étoffé. J'ai pu passer à temps plein suite à une levée de fonds. Nous sommes 2 cofondateurs sur 3 à avoir une casquette technique et travailler sur le site.\nEntre temps on a introduit Redis pour la gestion des sessions et du cache et RabbitMQ pour introduire du découplage entre certaines parties fonctionnelles via un pattern observer."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"On se marche un tout petit peu dessus de temps en temps et on conclut que ce serait intéressant de pouvoir sortir des parties du site indépendamment. Cela permettait par exemple de sortir le moteur de recherche tandis qu'on continuerait à avoir le moteur de paiement en brouillon.\nEn plus de cela, le cout du service Heroku et de ces addons (mongo et Redis), la robustesse de certains services en SAAS (Elastic notamment) font que l'alternative SAAS/PAAS commence à être moins pertinente."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"On décide donc de séparer l'application en plusieurs petites applications, de rajouter un reverse proxy Nginx devant et de tout faire tourner sur des serveurs dédiés OVH."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Même rétrospectivement, il est difficile de juger l'ensemble de ces décisions.\nLa séparation en plusieurs applications était discutable à ce stade. D'autant que nous utilisions déjà une stratégie de feature flipping pour désactiver des parties de code.\nMais la migration sur OVH, notamment pour des raisons de coût des addons était plutôt pragmatique et nous a apporté beaucoup de souplesse pour la suite."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Si cette partie vous intéresse, "},{"type":"element","tag":"a","props":{"href":"https://eventuallycoding.com/2014/05/09/paas-or-not-paas-that-is-the-question/","rel":["nofollow"]},"children":[{"type":"text","value":"un billet de blog sur la migration vers OVH avait été écrit à l'époque"}]},{"type":"text","value":"."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Pour l'anecdote, l'ensemble de l'application et des bases de données tournait sur une seule machine !"}]},{"type":"element","tag":"image","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"Stack 2014","src":"/images/stack-2014.jpg"},"children":[]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Entre 2014 et 2018, l'équipe Produit s'est étoffée jusqu'à 30 personnes. L'architecture s'est complexifiée pour répondre à des besoins plus forts en termes de résilience, sécurité, scalabilité.\nNous sommes notamment passés en partie sur OVH Cloud. Ça a été l'occasion d'introduire Terraform. Consul a été introduit pour la découvrabilité des services.\nVault a été ajouté pour la gestion des clés privée. Postgresql a été introduit en 2019 suite à de nombreuses déconvenues avec Mongo."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Côté frontend on a introduit Vue.js et supprimé AngularJs (EDIT : en fait, apparemment pas partout). Nos modules en Vanilla JS se sont structurés pour donner lieu à un petit framework maison assez léger. Handlebars nous a permis de partager des templates de pages entre client et serveurs et donc résoudre quelques soucis de SEO."}]},{"type":"element","tag":"image","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"Stack 2019","src":"/images/stack-2018.jpg"},"children":[]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Suite à 2018, nous avons rencontré de nombreuses limitations sur le cloud OVH. A l'époque leur implémentation de l'api OpenStack n'était pas stable et nous rencontrions de nombreuses erreurs 500. Le manque de services inclus nous imposait de reconstruire des solutions, sans que ce soit notre cœur de métier (la gestion des clés privée, la gestion des logs, la réplication mongo vers PG ou la création d'un datawarehouse par exemple).\nNous avons donc décidé d'aller sur GCP en 2019 pour bénéficier de services plus packagés. Plus exactement nous tournons désormais sur GKE (Kubernetes managé). Traefik a définitivement remplacé Nginx en tant que reverse proxy grâce à son intégration native avec Docker/Kube."}]},{"type":"element","tag":"image","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"Stack 2019","src":"/images/stack-2019.jpg"},"children":[]}]}]},{"type":"element","tag":"h2","props":{"id":"quest-ce-que-la-dette-technique-"},"children":[{"type":"text","value":"Qu'est ce que la dette technique ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mis bout à bout, chaque décision décrite précédemment s'explique. Elles ont toutes permis de construire la plateforme Malt que l'on connaît aujourd'hui et je les valide donc à posteriori. Refaire l'histoire ne préjuge pas que nous serions arrivés au même résultat."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nMais si ces décisions sont bonnes, pourquoi parler de dette technique ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Eh bien parce que la dette, ce n'est pas uniquement lié au code de mauvaise qualité."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Déjà posons une définition simple, la dette technique, c'est la somme des choix visant à gagner du temps mais qui vont induire des couts futurs à rembourser.\nPour simplifier, la dette permet d'acheter du temps qu'il faudra rembourser par la suite."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"J'aime beaucoup l'analogie avec la dette financière car :"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"la dette n'est pas toujours négative, elle peut servir à aller vite à un instant T, c'est de l'investissement. Dans le cas idéal, on peut le rembourser quand on a obtenu les moyens pour le faire."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"une dette se rembourse avec des intérêts, ces intérêts se cumulent dans le temps, c'est le principe des intérêts composés"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"lorsqu'on ne peut plus rembourser, on fait défaut sur une dette. Ce défaut se traduit par une réécriture complète de l'application avec le cout associé. Dans le pire des cas, c'est la fin du produit et de l'entreprise."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"la dette technique est soumise à l'inflation et la déflation. Des évènements extérieurs peuvent la faire exploser (ou annuler). Elle n'est donc pas totalement prédictible"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Concernant le dernier point, la dette peut évoluer pour des raisons externes or c'est justement un point important pour répondre à la question initiale.\nLes choix effectués sur Malt ont tous été fait en fonction d'un contexte donné."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mais :"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"les contraintes ayant mené à certains choix ont évolué. Par exemple des technologies inexistantes en 2012 sont désormais standard (la gestion du SSR par exemple)"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"la taille de l'équipe entraine des contraintes supplémentaires sur les standards de développement"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"la taille de l'entreprise et de la base utilisateur entraine des contraintes supplémentaires sur les technologies à mettre en œuvre (Exemple, un batch qui prend 10minutes sur une faible volumétrie et qui prend 2h aujourd'hui)"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"etc..."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Bref, certains choix qui ne sont pas vus initialement comme de la dette peuvent en devenir par la suite."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Attention, je ne suis pas en train de dire qu'il faut anticiper les contraintes futures. Pour beaucoup d'entre elles je préconise d'attendre jusqu'au dernier moment car leur résolution induit souvent une complexité supplémentaire qui a aussi un cout et qui grève la vélocité d'équipe."}]},{"type":"element","tag":"h2","props":{"id":"constat-sur-malt"},"children":[{"type":"text","value":"Constat sur Malt"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Sur Malt nous avons toujours eu un principe fort d'autonomie.\nChaque personne est encouragée à avoir un regard critique, pour proposer et améliorer la stack technologique. Ces choix sont discutés, adoptés ou rejetés collégialement."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Cette approche participative nous a été très utile. Les choix ont toujours été très efficaces, innovants tout en restant pragmatiques."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Par exemple nous avons :"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://eventuallycoding.com/2019/07/03/mongodb-vers-postgresql","rel":["nofollow"]},"children":[{"type":"text","value":"introduit PGSQL pour remplacer progressivement Mongo"}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"basculé progressivement de Java à Kotlin"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"basculé progressivement de Javascript à Typescript"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mais, dans notre approche, nous avons aussi souvent décidé de faire ces ajouts de façon progressive sur le nouveau code, sans effectuer de migration complète de l'ancien code.\nC'était un choix logique à ce moment-là, mais qui a creusé notre dette technique."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ce choix a une conséquence forte : l'explosion des dépendances."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nEt ces dépendances ont des impacts importants"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"sur la charge cognitive de chaque développeur qui tombe régulièrement sur des façons différentes de travailler"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"sur les temps de démarrage des applications qui chargent de nombreuses dépendances"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"sur les stations de travail qui sont doivent faire tourner une stack de plus en plus complexe"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"sur intellij qui galère de façon significative. Pas uniquement parce que la base de code est importante, mais aussi parce qu'il a de nombreuses librairies et langages à analyser. Et chaque plugin coute !"},{"type":"element","tag":"sup","props":{},"children":[{"type":"element","tag":"a","props":{"href":"#user-content-fn-1","ariaDescribedBy":"footnote-label","dataFootnoteRef":true,"id":"user-content-fnref-1"},"children":[{"type":"text","value":"1"}]}]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Nous avons de nombreuses métriques que l'on regarde constamment, sur nos temps de builds, taux de disponibilité et j'en passe. Mais pour certaines, l'évolution s'est faite progressivement dans le temps, ce qui n'attire pas l'attention."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nPar exemple"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"le temps de démarrage d'une appli est désormais supérieur à 50secondes sur certains postes de travail"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"les stations de dev nécessitent une configuration très lourde pour faire tourner l'ensemble de la stack (imaginez docker avec des containers ES, Redis, Mongo, PgSQL, Traefik etc...)."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"les indexations intellij qui peuvent durer des heures avec une empreinte mémoire > 8Go dans les dernières versions"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et tout cela entraîne une augmentation importante des temps de cycle de développement."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Malgré tout, jusqu'ici tout va encore bien."}]},{"type":"element","tag":"image","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"This is fine","src":"/images/thisisfine.jpg"},"children":[]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mais nous savons par expérience que nous sommes arrivés au moment où, si nous ne prenons pas d'actions fortes, dans un an nous devrons faire un défaut partiel de notre dette, qui se traduirait par un freeze code de plusieurs mois pour rembourser."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et ça, c'est ce qu'il faut éviter à tout prix."}]},{"type":"element","tag":"h2","props":{"id":"kiss"},"children":[{"type":"text","value":"KISS"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En 2022, parmi nos 5 OKR d'entreprise, nous avions un OKR un peu particulier : KISS, Keep it simple stupid."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Cet enjeu de simplification rejoint totalement le sujet développé dans le chapitre précédent. Il faut simplifier pour diminuer la "},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"charge cognitive par développeur"}]},{"type":"text","value":" et "},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"la charge induite sur nos outils"}]},{"type":"text","value":"."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Pour faire le lien avec l'introduction de ce billet, nous n'allons pas réécrire tout Malt de zéro bien évidemment. Mais nous allons travailler à simplifier Malt à travers plusieurs projets."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et c'est l'un de ces projets dont je souhaite parler prochainement, la modernisation complète de notre stack frontend, comment passer de 6 technos frontend à uniquement une seule, et comment se débarrasser totalement de Java côté frontend (les fameuses JSP)."},{"type":"element","tag":"br","props":{},"children":[]},{"type":"text","value":"\nDe façon un peu poétique, ce projet s'intitule Singapore car c'est l'histoire d'un voyage en dehors de l'île de Java."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Restez à l'écoute, ce sera le sujet du prochain billet."}]},{"type":"element","tag":"section","props":{"className":["footnotes"],"dataFootnotes":true},"children":[{"type":"element","tag":"h2","props":{"id":"footnote-label","className":["sr-only"]},"children":[{"type":"text","value":"Footnotes"}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{"id":"user-content-fn-1"},"children":[{"type":"text","value":"Un exemple simple pour comprendre. Nous avons aujourd'hui 3 façons différentes d'interagir avec PgSQL en Java : mybatis, Jooq, Spring Template. La grande majorité utilise Jooq mais Intellij doit mobiliser 3 plugins pour analyser, proposer de l'auto complétion etc... (Même si le plugin Spring est de toute façon actif par défaut) "},{"type":"element","tag":"a","props":{"href":"#user-content-fnref-1","ariaLabel":"Back to content","className":["data-footnote-backref"],"dataFootnoteBackref":true},"children":[{"type":"text","value":"↩"}]}]}]}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"un-petit-peu-dhistoire","depth":2,"text":"Un petit peu d'histoire"},{"id":"quest-ce-que-la-dette-technique-","depth":2,"text":"Qu'est ce que la dette technique ?"},{"id":"constat-sur-malt","depth":2,"text":"Constat sur Malt"},{"id":"kiss","depth":2,"text":"KISS"},{"id":"footnote-label","depth":2,"text":"Footnotes"}]}},"_type":"markdown","_id":"content:articles:2023:01:faut-il-reecrire-de-zero.md","_source":"content","_file":"articles/2023/01/faut-il-reecrire-de-zero.md","_extension":"md"}