{"_path":"/articles/2023/01/questions-startup","_dir":"01","_draft":false,"_partial":false,"_locale":"en","_empty":false,"title":"Les questions à poser avant de rentrer dans une startup","description":"Dans ce billet, je souhaite vous présenter le projet Singapore, qui vise à simplifier et moderniser toute notre stack frontend en utilisant Nuxt.  ","excerpt":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ça y est, vous avez une offre d’une startup sur la table, mais vous ne savez pas vraiment quoi en penser."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Eh oui, car entre l’imaginaire tout cramé des startups-babyfoot toxiques dirigé par des grands mégalos et les aventures fantastiques des licornes qui impactent des millions de personnes il y a un fossé et vous ne souhaitez pas tomber du mauvais côté du fossé."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Sauf que, vous qui avez peut-être l’expérience des entreprises un peu traditionnelles (ça existe vraiment d’ailleurs ?), vous ne savez pas bien comment évaluer l’entreprise qui cherche à vous séduire."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"On en parle ?"}]},{"type":"element","tag":"h2","props":{"id":"définition-dune-startup"},"children":[{"type":"text","value":"Définition d’une startup"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Avant de démarrer, mettons-nous d’accord sur la définition d’une startup parce que ça ne fait pas l’unanimité."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et donc, comme je suis l’auteur de ce billet et que je fais ce que je veux, je vais prendre cette définition :"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"startup : jeune entreprise, qui expérimente sur un nouveau marché, donc risqué, et nécessitant de gros investissements technologiques. Elles se caractérisent souvent par une grosse croissance, que ce soit organique (le nombre de personnes qui bossent dedans ou le nombre d’utilisateurs) ou financière. Elle réinvestit tout son capital dans sa croissance constamment. Ce capital peut être du revenu, mais aussi, bien souvent, des fonds extérieurs qu’elle a été chercher auprès d’investisseurs."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"C’est un peu long, mais ca me permet d’exclure :"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"les TPE qui se proclament startup juste par leur taille. Il y a un critère de risque technologique et de croissance à respecter"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"les petites et moyennes ESN qui aiment bien profiter de la mode autour des startups pour tenter de se déguiser. Elles n’investissent rien dans un produit technologique et ne naviguent pas dans un environnement inconnu et risqué."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"les scale-ups qui ont trouvé leur modèle et sont en phase d’accélération. Même si elles partagent encore beaucoup de points communs avec les startups (croissance forte, risque, besoin massifs de capitaux etc…)"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Je m’autoriserais un peu à parler des scale ups malgré tout mais c’est important que vous fassiez bien la différence entre les deux au moment de signer."}]},{"type":"element","tag":"h2","props":{"id":"les-questions-à-se-poser"},"children":[{"type":"text","value":"Les questions à SE poser"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Avant même d’évaluer la startup, il y a une petite phase d’introspection à faire sur soi pour savoir si on est prêt à bosser en startup."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Une startup, par définition, c’est une petite boîte et c’est risqué. Le bon point, c'est qu’on ne s’ennuie pas, et qu’on est amené à apprendre plein de métiers. On devient par nature un mouton à cinq pattes car les moyens sont limités donc il faut endosser toutes les casquettes manquantes."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Pour ma part, j'aime beaucoup cette part d’autonomie, d’inconnu, de renouvellement permanent, d’absence de train-train."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mais je comprends ceux qui le voient comme ça :"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://twitter.com/prof_anonyme/status/1612495368083869696","rel":["nofollow"]},"children":[{"type":"text","value":"https://twitter.com/prof_anonyme/status/1612495368083869696"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Une startup c’est l’illustration permanente de l’expression “sortir de sa zone de confort”. Et la phrase dit bien ce qu’elle veut dire. Est-ce que vous êtes prêt à sortir du **confort **?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Personnellement pour avoir testé l’ennui dans certaines grandes entreprises, ma réponse est oui. Mais cette réponse est personnelle et personne n’a rien à redire à votre choix."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"D’autant que cette réponse** elle va sans doute varier dans le temps**. On ne répondra peut-être pas la même chose en fonction de l’âge, de ses contraintes financières ou familiales etc…"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Un second point, qui est corollaire du premier, c’est "},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"l’adaptabilité"}]},{"type":"text","value":". Travailler en startup, c'est accepter que l’entreprise expérimente. Et qui dit expérimentation dit changements de priorité régulier."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Une startup, c'est aussi une entreprise qui croît vite, quand ça marche. Et qui dit croissance dit réorganisation permanente."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Réorganisation, car il y a de nouvelles personnes qui arrivent, car le travail qui se fait à 2 ne peut plus faire de la même façon à 10, car il y a des métiers nouveaux et plus spécialisés qui apparaissent dans la structure, et j’en passe."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Si le changement vous stresse, ce n’est peut-être pas le meilleur environnement."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Par expérience, sur Malt, tous les 6 mois, il fallait revoir l’organisation. On a déménagé tous 18 mois !\nTous les ans, il y avait plus de nouveaux salariés que d’anciens en fin d’année."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Un dernier point, mais crucial, est-ce que la mission de l’entreprise vous inspire ? Ça semble évident, mais je connais encore des personnes qui se sont laissés convaincre par une entreprise puis qui regrettent ensuite de travailler dans un secteur qui leur déplaît. On peut faire des concessions, mais c’est difficile quand c’est à l’opposé total de ces valeurs."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ok, disons que vous avez fait le tour des questions à se poser et vous avez reçu une offre d’une startup. Maintenant voyons ce qu’on peut rechercher sur l’entreprise."}]},{"type":"element","tag":"h2","props":{"id":"les-fondateurs"},"children":[{"type":"text","value":"Les fondateurs"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Je vais vous donner une info que vous ne connaissez peut-être pas. Lorsque des fonds décident d’investir de l’argent dans une startup en phase d'amorçage, la première chose qu’il regarde ce n’est pas l’idée elle-même, c’est l’équipe de fondateurs."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Des idées tout le monde en a, aucune n’est originale à 100%. Ce qui fera la différence, c’est l'exécution et c’est lié, au début, aux fondateurs."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Vous devriez appliquer ce critère. Si vous n’êtes pas convaincus par les fondateurs, c’est très mal engagé. Si vous ne voyez pas travailler avec eux au jour le jour, passez votre chemin. Autant vous ne croiserez jamais ou rarement l’équipe dirigeante dans une entreprise de plus de 1000 personnes, autant dans une startup ce sont vos premiers collègues."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Demandez-vous, qu’ont-ils fait avant ? Est-ce qu’ils vous semblent légitime sur le cœur de métier de la startup ? Si vous allez dans leurs locaux, comment ont-ils l’air de se comporter avec leurs collègues ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ensuite, faites confiance à votre intuition."}]},{"type":"element","tag":"h2","props":{"id":"la-santé-financière-de-lentreprise"},"children":[{"type":"text","value":"La santé financière de l’entreprise"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ce n’est peut-être pas le chapitre le plus attrayant, mais en réalité c’est l’un des plus importants."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Je le disais plus haut, en startup vous allez apprendre beaucoup. Et l’un de ces apprentissages, c'est la culture financière, car **autant quand vous allez prendre un poste chez Société Générale, Axa ou Carrefour, vous ne vous dites pas que l’entreprise peut fermer le lendemain, autant dans une startup, c'est possible. **"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et d’ailleurs, même si la vision produit est incroyable, l’entreprise peut se casser la gueule à tout moment. Ça fait partie des incertitudes à accepter. Je vous invite à poser quelques questions pour les raisons suivantes :"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"ça montre votre curiosité et c’est un bon point en votre faveur pendant l’entretien"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"c’est important dans tous les cas de comprendre le modèle financier de la startup. Si vous ne comprenez pas le modèle ou si vous ne le trouvez pas convaincant, comment allez-vous être motivé par la suite ?"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"ça permet en posant ces questions de voir le niveau de transparence de l’entreprise."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"En startup, l’entreprise fait peu, voire pas de revenus"}]},{"type":"text","value":". Il ne faut pas être surpris. Donc on va surtout se concentrer sur deux notions qui sont le minimum syndical à connaître (on va souvent utiliser le vocabulaire anglais qui est très utilisé) :"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Monthly Burn rate : c’est la somme \"brûlée\" par l’entreprise tous les mois, c'est-à-dire lorsqu’elle dépense plus qu’elle ne gagne de l’argent"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Runway: c’est le nombre de mois qui lui reste avant d’être à court d’argent :)"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Toutes les entreprises ne vous communiqueront pas ces données. Et personnellement je trouve ça dommage parce que vous allez prendre un risque et vous devriez pouvoir avoir un minimum de visibilité sur les prochains mois."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Après on peut aller plus loin et je vous invite à le faire. Essayez déjà par vous-même de comprendre le modèle financier de l’entreprise. Et ensuite en entretien, validez vos hypothèses. Les questions vont varier si c’est du B2B ou du B2C (vente aux entreprises ou vente aux particuliers)."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En B2C, je chercherais à savoir comment ils font de l’acquisition de clients. Est-ce que c’est un produit viral, ou qui marche par affiliation, ou autre ? Je chercherais à comprendre quel est l’effet de masse nécessaire pour que ce soit rentable, combien de personnes arrivent chaque mois sur le produit et est-ce que cette courbe est linéaire ou exponentielle."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"J’aimerais comprendre la monétisation, la taille du marché adressable, les concurrents, la manière dont la startup se démarque par rapport à eux."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En B2B, les questions sont proches (acquisition, concurrence, proposition de valeurs) mais c’est vrai aussi que la notion de masse est moins forte. Pour certains cas, un seul client peut ramener des centaines de milliers d’euros et le plus dur, c’est de boucler le premier. Donc l’absence de client est parfois normale. Mais attention, par expérience, les ventes avec des très grandes boîtes ou des institutions sont complexes et longues. C'est un pari très périlleux pour une startup."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Dans le cas d’une scale-up"}]},{"type":"text","value":", elle gagne des revenus donc vous pouvez creuser un peu plus et retenir le vocabulaire suivant"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"CA (chiffre d’affaires), sales revenue, turnover : la somme des ventes de l’entreprise"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"GMV (Gross margin value), TV (Transaction value) : la somme des transactions effectuées"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"CM (contributive margin) : les revenus générés pour chaque vente en enlevant les coûts variables"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"MRR : revenu mensuel récurrent  (surtout en SAAS)"}]}]},{"type":"element","tag":"tip","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La différence n'est peut-être pas si importante entre CA et GMV mais illustrons-la de façon simple."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Sur Airbnb, vous payez par exemple 100 euros une nuit dans un logement."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Sur ces 100 euros, 90 reviennent à l’hébergeur, 10 à Airbnb."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Le CA pour Airbnb est de 10 euros."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La GMV est de 100."}]}]},{"type":"element","tag":"tip","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La CM (marge contributive) est un bon indicateur car elle permet de vérifier que l’entreprise a un modèle financier sain. En gros, est ce que, quand l’entreprise dépense 1 euros (en marketing, en coûts commerciaux etc…) elle gagne plus que cet euro dépensé ? Si la CM est négative, c’est mauvais signe. Demandez comment elle a évolué dans le temps et quelle est la vision court/moyen terme pour qu’elle s’améliore."}]}]},{"type":"element","tag":"h2","props":{"id":"la-culture-et-les-valeurs"},"children":[{"type":"text","value":"La culture et les valeurs"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Qu’est-ce que la culture déjà ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"J’aime bien les deux définitions suivantes :"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"la culture est la somme des pratiques (tirés du bouquin de Netflix - No rules rules)"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"la culture, c’est ce qui se passe quand les portes sont closes (origine inconnue)"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Prenons des exemples concrets,"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"si la startup communique ses chiffres de façon régulière, on pourra dire qu’elle est transparente."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"si les fondateurs sont tous issus d’une école de commerce, il y a plus de chances que ce soit une culture orientée service que produit"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dans tous les cas, la culture ce n’est pas du tout ou rien, c’est un curseur."}]},{"type":"element","tag":"image","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"Culture as a cursor","src":"/images/culture-cursor.jpg"},"children":[]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et c'est un curseur à plusieurs dimensions.\nChaque élément de la culture s’adapte par rapport à l’autre. Exemple : la vitesse peut entrer en conflit avec la transparence."}]},{"type":"element","tag":"image","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"Culture as a cursor with multiple dimensions","src":"/images/culture-cursor-multiple.jpg"},"children":[]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La culture pour beaucoup, c’est un terme un peu surfait, pas très concret. C’est entouré de vernis marketing un peu mielleux."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et pourtant, détrompez-vous, la culture, surtout en startup, c’est très concret et c’est pour moi un élément que vous devriez sonder pendant les entretiens."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Le plus grand risque étant d’arriver dans une entreprise dont la culture est totalement en contradiction avec vos attentes."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Pour ma part, je prends quelques exemples, je pense que je souhaiterais trouver une culture techy, collaborative, remote, plutôt orienté "},{"type":"element","tag":"a","props":{"href":"https://www.chieflearningofficer.com/2020/11/04/soft-leadership-vs-hard-leadership/","rel":["nofollow"]},"children":[{"type":"text","value":"soft leadership"}]},{"type":"text","value":", avec une bonne ambition et sans culte de la pression."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Pour une startup, c’est rare qu’elle ait formalisé sa culture par écrit. Si ce n’est pas le cas, demandez simplement comment elles gèrent telle ou telle situation."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Si la culture a été écrite quelque part, demandez des exemples concrets qui illustrent chaque point de celle-ci. Petit test amusant, posez la question aux non-fondateurs pour voir si c’est une vision commune ou si ça a juste été écrit par les fondateurs.."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Si par exemple l’entreprise vous dit que la bienveillance fait partie de ses valeurs, demandez comment ça se manifeste concrètement."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Par contre, je vous donne un conseil, dosez correctement votre entretien."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"J’ai en mémoire un entretien où le candidat ne m’a posé que des questions sur le remote et rien d’autre. Ça n’envoie pas un super signal, je n’ai pas envie qu’un candidat choisisse ma boîte juste parce qu’on est remote. J’aurais aimé qu’il pose des questions aussi sur la mission, le modèle de revenu, la tech etc…"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Vous aurez sans doute plusieurs personnes à rencontrer pendant le recrutement, renseignez-vous sur chaque personne que vous allez rencontrer pour cibler un peu vos questions sur leur quotidien et donc détecter les éléments de culture que vous voulez contrôler."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"J’en profite, puisqu'on parle de culture, parfois c'est aussi intéressant de vérifier la cohérence entre l’ambition de l’entreprise et sa culture."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ce n'est pas quelque chose qu’on peut facilement détecter en entretien, mais plutôt après quelque mois passé dans l’entreprise. Mais parfois ça saute aux yeux :)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Connaissez vous le dicton : “culture eats strategy for breakfast” ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La culture ça ne se décrète pas, ça vient des pratiques. Donc toutes les stratégies top down (qui viennent d’en haut) peuvent totalement échouer quand la culture (bottom up) est contradictoire."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Par exemple, une culture très averses aux risques, ne fonctionnera pas sur un produit qui demande beaucoup d’innovation et de pivot régulier."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Une culture basée sur le présentiel, des prises de décisions en physique et un recrutement très centralisé sur une grande ville, aura beaucoup de mal avec une stratégie de déploiement international. Etc…"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et dans ces deux cas précis, ça peut se détecter en entretien en tant que candidat."}]},{"type":"element","tag":"h2","props":{"id":"le-sérieux-technologique"},"children":[{"type":"text","value":"Le sérieux technologique"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dans la définition que je donnais plus haut, une startup, c’est une entreprise propulsée par la tech, un produit. Alors je peux vous dire que juger du sérieux technologique de la dite startup, c’est une sacrée priorité. Est-ce que l’entreprise est crédible ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Premier critère que je définirais, est-ce que l’entreprise a un(e) associé(e) technique ? Est-ce qu’il y a un(e) cofondateur capable de traduire la vision produit en vision technologique ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En cas de réponse négative, tout n’est pas perdu, mais c’est mal engagé. Quelle a été leur stratégie pour poser les premières briques ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Si la réponse est que tout le produit a été développé par une agence externe et que votre job va être justement de reprendre tout ça, grosse méfiance. Encore plus si personne de cette agence n’a décidé de rejoindre l’aventure."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"On est dans une situation où, le fondateur n’a pas su convaincre un associé technique et les employés de l’agence eux-mêmes n’ont pas été convaincus pour poursuivre."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Alternative possible, tout le produit a été développé par des stagiaires, ou juniors, mais qui défilent depuis des mois. Là encore, ce que je mets en évidence, ce n’est pas un éventuel souci de qualité du code produit, c’est plutôt un souci sur la gestion des priorités."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Lancer une startup “tech” sans investir dans la tech en question, c’est surprenant, au mieux…"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Cependant"}]},{"type":"text","value":", malgré ce que je viens dire, je comprends aussi que l’argent est le nerf de la guerre et qu’il est très difficile d’embaucher au démarrage. Je comprends aussi que rencontrer le parfait associé ou premier tech lead est "},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"très"}]},{"type":"text","value":" difficile. Mais c’est le rôle du CEO justement. Si la situation dure depuis plus d’un an, c’est mauvais signe. Il n’a pas su convaincre sur sa vision produit."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ça peut aussi cacher une volonté de contrôle très forte du CEO qui ne saura pas travailler en équipe, qui cherche absolument à protéger son idée. Ce n'est pas forcément mieux que la première situation."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"À vous de vous faire une idée, mais gardez ces signaux en tête."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mais peut-être que c’est vous qui allez prendre ce rôle d’associé(e) technique ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Voyons maintenant le cas où il existe un(e) associé(e) technique, ou tout du moins un(e) tech lead en place."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Vous pouvez regarder son linkedin et ses expériences passées. Si vous êtes un peu expérimenté n’hésitez pas à l’interviewer tout autant qu’il ou elle va vous interviewer (sans forcer évidemment)."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Voici quelques questions dont il faudrait avoir les réponses au cours des entretiens"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Est ce que le ou la tech lead a un vrai rôle de décideur ou bien est-ce que le/la CEO prend les décisions techniques et le/la tech lead a un comportement d'exécutant uniquement ? (gros gros red flag)"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Est-ce que je vais apprendre avec l’équipe en place ?"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Qu’est-ce que moi je vais apporter ? Qu’est-ce qu’on attend de moi ?"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"C’est quoi la vision tech ? Comment on va construire le produit dans les 3 prochains mois ?"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Quel est le profil type des personnes déjà recrutées ? Est-ce que je vais les rencontrer ? (l’inverse est étrange)"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Vous déployez plusieurs fois par jour ? Comment faites-vous ?"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"C’est quoi votre quotidien type ?"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Par contre, attention, une startup c'est un environnement particulier, ne vous attendez pas à une entreprise qui a des moyens pharaoniques. Et dans les moyens, j’inclus le temps disponible."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"C’est intéressant de comprendre comment l’équipe travaille, ses méthodes. Mais ne vous attendez pas à trouver le même niveau de maturité et d’investissement qu’une entreprise mature. Ne vous brusquez pas si l’équipe en place vous dit qu’elle n’utilise pas tel ou tel outil (qu’elle ne peut sans doute pas se payer) ou qu’elle passe peu de temps sur telle ou telle pratique. Jugez plutôt de leur pragmatisme ou de leur capacité à être inventif par rapport aux contraintes."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ici je vais vous donner mes critères personnels. Personnellement j’essaierais de comprendre comment ils recrutent. Je verrais d’un mauvais œil un recrutement très junior sans aucun senior à part le/la tech lead. Pour moi, ça traduit un sous-investissement dans la tech, ce qui est mauvais signe."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ça peut aussi traduire l’incapacité du tech lead à savoir recruter plus fort que lui ou elle, soit par crainte, soit parce qu’il ou elle n’inspire pas confiance."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"De façon plus anecdotique je verrais d’un œil amusé l’application à la lettre d’une méthode type Scrum dans un environnement de ce type. Ce n'est pas éliminatoire, mais je trouverais ça assez inadapté dans un tel contexte et ça pourrait cacher un certain manque de maturité relié aux points précédents."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"J’essaierais de comprendre s’il y a du turnover. Un gros turnover dans une petite équipe cache quelque chose."}]},{"type":"element","tag":"h2","props":{"id":"le-salaire"},"children":[{"type":"text","value":"Le salaire"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Pour certains, ce ne sera pas une surprise si je dis qu’une startup n’est pas synonyme de gros salaires. D’autres au contraire ont lu des tas d'articles sur l’inflation des salaires dans les startups et s’attendent à des chiffres astronomiques."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Soyons clairs,** l’inflation dont on parle plus haut concerne les scale-ups**, assez peu les startups sauf à quelques rares exceptions."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Si je reprends "},{"type":"element","tag":"a","props":{"href":"https://eventuallycoding.com/2021/07/06/les-salaires-dans-la-tech","rel":["nofollow"]},"children":[{"type":"text","value":"un ancien billet"}]},{"type":"text","value":", les startups sont dans ce que j’appelle le groupe I."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Le salaire doit donc être très proche de ceux qu’on peut trouver sur tous les benchmarks généralistes du marché : urban linker, talent.io, welovedevs, silkhom, afup etc…"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En résumé vous aurez des propositions dans le marché, mais pas au-dessus du marché. Ce n’est pas la meilleure solution pour gagner beaucoup d’argent et donc pas le principal levier de motivation.."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Beaucoup de personnes rejoignent des startups, car elles veulent démarrer un produit de zéro, ne pas être submergés dans des bureaucraties kafkaïennes, être super proches des décisions tech et produit, avoir de l’impact tout simplement."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Se faire plaisir au travail ça n’a pas de prix (tout est relatif, hein…)."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Pour autant il peut y avoir un lien entre une expérience en startup et un impact financier dans le futur."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Premier point, les BSPCE (ou stock options). Beaucoup de startups vont vous en proposer et c’est plutôt une bonne chose. Je ne vais pas vous faire un article sur les BSPCE, je vous invite à lire "},{"type":"element","tag":"a","props":{"href":"https://www.maddyness.com/2019/01/29/maddynoob-tout-comprendre-aux-bspce-ou-presque-en-moins-de-10-minutes/","rel":["nofollow"]},"children":[{"type":"text","value":"celui-ci par Quentin"}]},{"type":"text","value":". Les BSPCE restent un pari, "},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"ça ne doit pas être un prétexte pour faire baisser le salaire"}]},{"type":"text","value":" très nettement en dessous du marché."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dans certains cas, le gain peut être très important, je vous invite à lire "},{"type":"element","tag":"a","props":{"href":"https://blog.pragmaticengineer.com/equity-for-software-engineers/","rel":["nofollow"]},"children":[{"type":"text","value":"les success stories listés par Pragmatic engineer"}]},{"type":"text","value":". C’est tout ce que je vous souhaite."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Second point, une expérience en startup est très formatrice. Quelques années dans une startup, pour autant qu’elle vive autant que ça, va vous donner des compétences très appréciées ailleurs. C’est aussi un tremplin pour aller en Scale-up. Vous monnayerez cette expérience sur votre CV, pour peu que vous y passiez plus que quelques mois."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"(Un CV avec de multiples expériences de 3 mois n’est pas très vendeur par contre)."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Si la startup a une bonne croissance, l’évolution de votre propre poste peut être très rapide et vous pourrez revendiquer des postes avec des titres un peu ronflants ailleurs."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Il ne faut pas être naïf pour autant, être “Head of engineering” dans une équipe de 10 ne vous fera pas devenir “Head of Engineering” dans une Scale-up de 1000 personnes. Mais votre expérience vous ouvrira des portes."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Petites choses à savoir en vrac."}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Inutile de demander s’il y a des accords d’intéressement et de participation. Une startup ne fait pas de bénéfices, elle ne peut donc pas les distribuer. Naïf, mais j’ai eu la question."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Inutile aussi de demander ce que propose le CE. Il n’y en a pas en dessous de 50 personnes"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Les avantages classiques en startup sont le remote ou à minima une certaine souplesse sur la gestion de son temps, le choix du matériel de dev. Il peut y avoir beaucoup d’imagination sur le sujet donc, à découvrir. Par contre n’allez pas demander s’ils ont mis en place des primes vélos, chèques vacances ou tout ce qui demande de faire de l’administratif. Une startup n’a souvent pas de RH dédiée, ce serait surprenant à cette taille, donc personne pour s’occuper des trucs un peu évolués."}]}]},{"type":"element","tag":"h2","props":{"id":"faites-confiance-à-votre-intuition"},"children":[{"type":"text","value":"Faites confiance à votre intuition"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En fin de compte, il ne s’agit pas pour vous de rechercher l’entreprise parfaite, ça n’existe pas."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Au vu de la taille d’une startup, en arrivant dans les premiers employés vous allez avoir une influence sur la façon dont elle se construit. Donc à vous de choisir ce qui est vital pour vous, et ce qui peut s’accepter en l’état."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"À partir du moment où vous avez posé les bonnes questions, faites confiance à votre intuition."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Au pire, vous aurez à rechercher du boulot encore une fois dans quelque mois. Aujourd’hui en tout cas, on a la chance d’être dans une position favorable pour le faire."}]}]},"id":"11","date":"2023-01-19","tags":["startup"],"cover":"startup.jpg","readingTime":{"text":"18 min read","minutes":17.7,"time":1062000,"words":3540},"body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ça y est, vous avez une offre d’une startup sur la table, mais vous ne savez pas vraiment quoi en penser."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Eh oui, car entre l’imaginaire tout cramé des startups-babyfoot toxiques dirigé par des grands mégalos et les aventures fantastiques des licornes qui impactent des millions de personnes il y a un fossé et vous ne souhaitez pas tomber du mauvais côté du fossé."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Sauf que, vous qui avez peut-être l’expérience des entreprises un peu traditionnelles (ça existe vraiment d’ailleurs ?), vous ne savez pas bien comment évaluer l’entreprise qui cherche à vous séduire."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"On en parle ?"}]},{"type":"element","tag":"h2","props":{"id":"définition-dune-startup"},"children":[{"type":"text","value":"Définition d’une startup"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Avant de démarrer, mettons-nous d’accord sur la définition d’une startup parce que ça ne fait pas l’unanimité."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et donc, comme je suis l’auteur de ce billet et que je fais ce que je veux, je vais prendre cette définition :"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"startup : jeune entreprise, qui expérimente sur un nouveau marché, donc risqué, et nécessitant de gros investissements technologiques. Elles se caractérisent souvent par une grosse croissance, que ce soit organique (le nombre de personnes qui bossent dedans ou le nombre d’utilisateurs) ou financière. Elle réinvestit tout son capital dans sa croissance constamment. Ce capital peut être du revenu, mais aussi, bien souvent, des fonds extérieurs qu’elle a été chercher auprès d’investisseurs."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"C’est un peu long, mais ca me permet d’exclure :"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"les TPE qui se proclament startup juste par leur taille. Il y a un critère de risque technologique et de croissance à respecter"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"les petites et moyennes ESN qui aiment bien profiter de la mode autour des startups pour tenter de se déguiser. Elles n’investissent rien dans un produit technologique et ne naviguent pas dans un environnement inconnu et risqué."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"les scale-ups qui ont trouvé leur modèle et sont en phase d’accélération. Même si elles partagent encore beaucoup de points communs avec les startups (croissance forte, risque, besoin massifs de capitaux etc…)"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Je m’autoriserais un peu à parler des scale ups malgré tout mais c’est important que vous fassiez bien la différence entre les deux au moment de signer."}]},{"type":"element","tag":"h2","props":{"id":"les-questions-à-se-poser"},"children":[{"type":"text","value":"Les questions à SE poser"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Avant même d’évaluer la startup, il y a une petite phase d’introspection à faire sur soi pour savoir si on est prêt à bosser en startup."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Une startup, par définition, c’est une petite boîte et c’est risqué. Le bon point, c'est qu’on ne s’ennuie pas, et qu’on est amené à apprendre plein de métiers. On devient par nature un mouton à cinq pattes car les moyens sont limités donc il faut endosser toutes les casquettes manquantes."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Pour ma part, j'aime beaucoup cette part d’autonomie, d’inconnu, de renouvellement permanent, d’absence de train-train."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mais je comprends ceux qui le voient comme ça :"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://twitter.com/prof_anonyme/status/1612495368083869696","rel":["nofollow"]},"children":[{"type":"text","value":"https://twitter.com/prof_anonyme/status/1612495368083869696"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Une startup c’est l’illustration permanente de l’expression “sortir de sa zone de confort”. Et la phrase dit bien ce qu’elle veut dire. Est-ce que vous êtes prêt à sortir du **confort **?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Personnellement pour avoir testé l’ennui dans certaines grandes entreprises, ma réponse est oui. Mais cette réponse est personnelle et personne n’a rien à redire à votre choix."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"D’autant que cette réponse** elle va sans doute varier dans le temps**. On ne répondra peut-être pas la même chose en fonction de l’âge, de ses contraintes financières ou familiales etc…"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Un second point, qui est corollaire du premier, c’est "},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"l’adaptabilité"}]},{"type":"text","value":". Travailler en startup, c'est accepter que l’entreprise expérimente. Et qui dit expérimentation dit changements de priorité régulier."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Une startup, c'est aussi une entreprise qui croît vite, quand ça marche. Et qui dit croissance dit réorganisation permanente."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Réorganisation, car il y a de nouvelles personnes qui arrivent, car le travail qui se fait à 2 ne peut plus faire de la même façon à 10, car il y a des métiers nouveaux et plus spécialisés qui apparaissent dans la structure, et j’en passe."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Si le changement vous stresse, ce n’est peut-être pas le meilleur environnement."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Par expérience, sur Malt, tous les 6 mois, il fallait revoir l’organisation. On a déménagé tous 18 mois !\nTous les ans, il y avait plus de nouveaux salariés que d’anciens en fin d’année."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Un dernier point, mais crucial, est-ce que la mission de l’entreprise vous inspire ? Ça semble évident, mais je connais encore des personnes qui se sont laissés convaincre par une entreprise puis qui regrettent ensuite de travailler dans un secteur qui leur déplaît. On peut faire des concessions, mais c’est difficile quand c’est à l’opposé total de ces valeurs."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ok, disons que vous avez fait le tour des questions à se poser et vous avez reçu une offre d’une startup. Maintenant voyons ce qu’on peut rechercher sur l’entreprise."}]},{"type":"element","tag":"h2","props":{"id":"les-fondateurs"},"children":[{"type":"text","value":"Les fondateurs"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Je vais vous donner une info que vous ne connaissez peut-être pas. Lorsque des fonds décident d’investir de l’argent dans une startup en phase d'amorçage, la première chose qu’il regarde ce n’est pas l’idée elle-même, c’est l’équipe de fondateurs."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Des idées tout le monde en a, aucune n’est originale à 100%. Ce qui fera la différence, c’est l'exécution et c’est lié, au début, aux fondateurs."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Vous devriez appliquer ce critère. Si vous n’êtes pas convaincus par les fondateurs, c’est très mal engagé. Si vous ne voyez pas travailler avec eux au jour le jour, passez votre chemin. Autant vous ne croiserez jamais ou rarement l’équipe dirigeante dans une entreprise de plus de 1000 personnes, autant dans une startup ce sont vos premiers collègues."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Demandez-vous, qu’ont-ils fait avant ? Est-ce qu’ils vous semblent légitime sur le cœur de métier de la startup ? Si vous allez dans leurs locaux, comment ont-ils l’air de se comporter avec leurs collègues ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ensuite, faites confiance à votre intuition."}]},{"type":"element","tag":"h2","props":{"id":"la-santé-financière-de-lentreprise"},"children":[{"type":"text","value":"La santé financière de l’entreprise"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ce n’est peut-être pas le chapitre le plus attrayant, mais en réalité c’est l’un des plus importants."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Je le disais plus haut, en startup vous allez apprendre beaucoup. Et l’un de ces apprentissages, c'est la culture financière, car **autant quand vous allez prendre un poste chez Société Générale, Axa ou Carrefour, vous ne vous dites pas que l’entreprise peut fermer le lendemain, autant dans une startup, c'est possible. **"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et d’ailleurs, même si la vision produit est incroyable, l’entreprise peut se casser la gueule à tout moment. Ça fait partie des incertitudes à accepter. Je vous invite à poser quelques questions pour les raisons suivantes :"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"ça montre votre curiosité et c’est un bon point en votre faveur pendant l’entretien"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"c’est important dans tous les cas de comprendre le modèle financier de la startup. Si vous ne comprenez pas le modèle ou si vous ne le trouvez pas convaincant, comment allez-vous être motivé par la suite ?"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"ça permet en posant ces questions de voir le niveau de transparence de l’entreprise."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"En startup, l’entreprise fait peu, voire pas de revenus"}]},{"type":"text","value":". Il ne faut pas être surpris. Donc on va surtout se concentrer sur deux notions qui sont le minimum syndical à connaître (on va souvent utiliser le vocabulaire anglais qui est très utilisé) :"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Monthly Burn rate : c’est la somme \"brûlée\" par l’entreprise tous les mois, c'est-à-dire lorsqu’elle dépense plus qu’elle ne gagne de l’argent"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Runway: c’est le nombre de mois qui lui reste avant d’être à court d’argent :)"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Toutes les entreprises ne vous communiqueront pas ces données. Et personnellement je trouve ça dommage parce que vous allez prendre un risque et vous devriez pouvoir avoir un minimum de visibilité sur les prochains mois."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Après on peut aller plus loin et je vous invite à le faire. Essayez déjà par vous-même de comprendre le modèle financier de l’entreprise. Et ensuite en entretien, validez vos hypothèses. Les questions vont varier si c’est du B2B ou du B2C (vente aux entreprises ou vente aux particuliers)."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En B2C, je chercherais à savoir comment ils font de l’acquisition de clients. Est-ce que c’est un produit viral, ou qui marche par affiliation, ou autre ? Je chercherais à comprendre quel est l’effet de masse nécessaire pour que ce soit rentable, combien de personnes arrivent chaque mois sur le produit et est-ce que cette courbe est linéaire ou exponentielle."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"J’aimerais comprendre la monétisation, la taille du marché adressable, les concurrents, la manière dont la startup se démarque par rapport à eux."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En B2B, les questions sont proches (acquisition, concurrence, proposition de valeurs) mais c’est vrai aussi que la notion de masse est moins forte. Pour certains cas, un seul client peut ramener des centaines de milliers d’euros et le plus dur, c’est de boucler le premier. Donc l’absence de client est parfois normale. Mais attention, par expérience, les ventes avec des très grandes boîtes ou des institutions sont complexes et longues. C'est un pari très périlleux pour une startup."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Dans le cas d’une scale-up"}]},{"type":"text","value":", elle gagne des revenus donc vous pouvez creuser un peu plus et retenir le vocabulaire suivant"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"CA (chiffre d’affaires), sales revenue, turnover : la somme des ventes de l’entreprise"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"GMV (Gross margin value), TV (Transaction value) : la somme des transactions effectuées"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"CM (contributive margin) : les revenus générés pour chaque vente en enlevant les coûts variables"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"MRR : revenu mensuel récurrent  (surtout en SAAS)"}]}]},{"type":"element","tag":"tip","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La différence n'est peut-être pas si importante entre CA et GMV mais illustrons-la de façon simple."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Sur Airbnb, vous payez par exemple 100 euros une nuit dans un logement."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Sur ces 100 euros, 90 reviennent à l’hébergeur, 10 à Airbnb."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Le CA pour Airbnb est de 10 euros."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La GMV est de 100."}]}]},{"type":"element","tag":"tip","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La CM (marge contributive) est un bon indicateur car elle permet de vérifier que l’entreprise a un modèle financier sain. En gros, est ce que, quand l’entreprise dépense 1 euros (en marketing, en coûts commerciaux etc…) elle gagne plus que cet euro dépensé ? Si la CM est négative, c’est mauvais signe. Demandez comment elle a évolué dans le temps et quelle est la vision court/moyen terme pour qu’elle s’améliore."}]}]},{"type":"element","tag":"h2","props":{"id":"la-culture-et-les-valeurs"},"children":[{"type":"text","value":"La culture et les valeurs"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Qu’est-ce que la culture déjà ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"J’aime bien les deux définitions suivantes :"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"la culture est la somme des pratiques (tirés du bouquin de Netflix - No rules rules)"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"la culture, c’est ce qui se passe quand les portes sont closes (origine inconnue)"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Prenons des exemples concrets,"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"si la startup communique ses chiffres de façon régulière, on pourra dire qu’elle est transparente."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"si les fondateurs sont tous issus d’une école de commerce, il y a plus de chances que ce soit une culture orientée service que produit"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dans tous les cas, la culture ce n’est pas du tout ou rien, c’est un curseur."}]},{"type":"element","tag":"image","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"Culture as a cursor","src":"/images/culture-cursor.jpg"},"children":[]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et c'est un curseur à plusieurs dimensions.\nChaque élément de la culture s’adapte par rapport à l’autre. Exemple : la vitesse peut entrer en conflit avec la transparence."}]},{"type":"element","tag":"image","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"Culture as a cursor with multiple dimensions","src":"/images/culture-cursor-multiple.jpg"},"children":[]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La culture pour beaucoup, c’est un terme un peu surfait, pas très concret. C’est entouré de vernis marketing un peu mielleux."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et pourtant, détrompez-vous, la culture, surtout en startup, c’est très concret et c’est pour moi un élément que vous devriez sonder pendant les entretiens."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Le plus grand risque étant d’arriver dans une entreprise dont la culture est totalement en contradiction avec vos attentes."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Pour ma part, je prends quelques exemples, je pense que je souhaiterais trouver une culture techy, collaborative, remote, plutôt orienté "},{"type":"element","tag":"a","props":{"href":"https://www.chieflearningofficer.com/2020/11/04/soft-leadership-vs-hard-leadership/","rel":["nofollow"]},"children":[{"type":"text","value":"soft leadership"}]},{"type":"text","value":", avec une bonne ambition et sans culte de la pression."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Pour une startup, c’est rare qu’elle ait formalisé sa culture par écrit. Si ce n’est pas le cas, demandez simplement comment elles gèrent telle ou telle situation."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Si la culture a été écrite quelque part, demandez des exemples concrets qui illustrent chaque point de celle-ci. Petit test amusant, posez la question aux non-fondateurs pour voir si c’est une vision commune ou si ça a juste été écrit par les fondateurs.."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Si par exemple l’entreprise vous dit que la bienveillance fait partie de ses valeurs, demandez comment ça se manifeste concrètement."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Par contre, je vous donne un conseil, dosez correctement votre entretien."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"J’ai en mémoire un entretien où le candidat ne m’a posé que des questions sur le remote et rien d’autre. Ça n’envoie pas un super signal, je n’ai pas envie qu’un candidat choisisse ma boîte juste parce qu’on est remote. J’aurais aimé qu’il pose des questions aussi sur la mission, le modèle de revenu, la tech etc…"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Vous aurez sans doute plusieurs personnes à rencontrer pendant le recrutement, renseignez-vous sur chaque personne que vous allez rencontrer pour cibler un peu vos questions sur leur quotidien et donc détecter les éléments de culture que vous voulez contrôler."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"J’en profite, puisqu'on parle de culture, parfois c'est aussi intéressant de vérifier la cohérence entre l’ambition de l’entreprise et sa culture."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ce n'est pas quelque chose qu’on peut facilement détecter en entretien, mais plutôt après quelque mois passé dans l’entreprise. Mais parfois ça saute aux yeux :)"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Connaissez vous le dicton : “culture eats strategy for breakfast” ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La culture ça ne se décrète pas, ça vient des pratiques. Donc toutes les stratégies top down (qui viennent d’en haut) peuvent totalement échouer quand la culture (bottom up) est contradictoire."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Par exemple, une culture très averses aux risques, ne fonctionnera pas sur un produit qui demande beaucoup d’innovation et de pivot régulier."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Une culture basée sur le présentiel, des prises de décisions en physique et un recrutement très centralisé sur une grande ville, aura beaucoup de mal avec une stratégie de déploiement international. Etc…"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Et dans ces deux cas précis, ça peut se détecter en entretien en tant que candidat."}]},{"type":"element","tag":"h2","props":{"id":"le-sérieux-technologique"},"children":[{"type":"text","value":"Le sérieux technologique"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dans la définition que je donnais plus haut, une startup, c’est une entreprise propulsée par la tech, un produit. Alors je peux vous dire que juger du sérieux technologique de la dite startup, c’est une sacrée priorité. Est-ce que l’entreprise est crédible ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Premier critère que je définirais, est-ce que l’entreprise a un(e) associé(e) technique ? Est-ce qu’il y a un(e) cofondateur capable de traduire la vision produit en vision technologique ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En cas de réponse négative, tout n’est pas perdu, mais c’est mal engagé. Quelle a été leur stratégie pour poser les premières briques ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Si la réponse est que tout le produit a été développé par une agence externe et que votre job va être justement de reprendre tout ça, grosse méfiance. Encore plus si personne de cette agence n’a décidé de rejoindre l’aventure."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"On est dans une situation où, le fondateur n’a pas su convaincre un associé technique et les employés de l’agence eux-mêmes n’ont pas été convaincus pour poursuivre."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Alternative possible, tout le produit a été développé par des stagiaires, ou juniors, mais qui défilent depuis des mois. Là encore, ce que je mets en évidence, ce n’est pas un éventuel souci de qualité du code produit, c’est plutôt un souci sur la gestion des priorités."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Lancer une startup “tech” sans investir dans la tech en question, c’est surprenant, au mieux…"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Cependant"}]},{"type":"text","value":", malgré ce que je viens dire, je comprends aussi que l’argent est le nerf de la guerre et qu’il est très difficile d’embaucher au démarrage. Je comprends aussi que rencontrer le parfait associé ou premier tech lead est "},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"très"}]},{"type":"text","value":" difficile. Mais c’est le rôle du CEO justement. Si la situation dure depuis plus d’un an, c’est mauvais signe. Il n’a pas su convaincre sur sa vision produit."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ça peut aussi cacher une volonté de contrôle très forte du CEO qui ne saura pas travailler en équipe, qui cherche absolument à protéger son idée. Ce n'est pas forcément mieux que la première situation."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"À vous de vous faire une idée, mais gardez ces signaux en tête."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Mais peut-être que c’est vous qui allez prendre ce rôle d’associé(e) technique ?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Voyons maintenant le cas où il existe un(e) associé(e) technique, ou tout du moins un(e) tech lead en place."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Vous pouvez regarder son linkedin et ses expériences passées. Si vous êtes un peu expérimenté n’hésitez pas à l’interviewer tout autant qu’il ou elle va vous interviewer (sans forcer évidemment)."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Voici quelques questions dont il faudrait avoir les réponses au cours des entretiens"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Est ce que le ou la tech lead a un vrai rôle de décideur ou bien est-ce que le/la CEO prend les décisions techniques et le/la tech lead a un comportement d'exécutant uniquement ? (gros gros red flag)"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Est-ce que je vais apprendre avec l’équipe en place ?"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Qu’est-ce que moi je vais apporter ? Qu’est-ce qu’on attend de moi ?"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"C’est quoi la vision tech ? Comment on va construire le produit dans les 3 prochains mois ?"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Quel est le profil type des personnes déjà recrutées ? Est-ce que je vais les rencontrer ? (l’inverse est étrange)"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Vous déployez plusieurs fois par jour ? Comment faites-vous ?"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"C’est quoi votre quotidien type ?"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Par contre, attention, une startup c'est un environnement particulier, ne vous attendez pas à une entreprise qui a des moyens pharaoniques. Et dans les moyens, j’inclus le temps disponible."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"C’est intéressant de comprendre comment l’équipe travaille, ses méthodes. Mais ne vous attendez pas à trouver le même niveau de maturité et d’investissement qu’une entreprise mature. Ne vous brusquez pas si l’équipe en place vous dit qu’elle n’utilise pas tel ou tel outil (qu’elle ne peut sans doute pas se payer) ou qu’elle passe peu de temps sur telle ou telle pratique. Jugez plutôt de leur pragmatisme ou de leur capacité à être inventif par rapport aux contraintes."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ici je vais vous donner mes critères personnels. Personnellement j’essaierais de comprendre comment ils recrutent. Je verrais d’un mauvais œil un recrutement très junior sans aucun senior à part le/la tech lead. Pour moi, ça traduit un sous-investissement dans la tech, ce qui est mauvais signe."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ça peut aussi traduire l’incapacité du tech lead à savoir recruter plus fort que lui ou elle, soit par crainte, soit parce qu’il ou elle n’inspire pas confiance."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"De façon plus anecdotique je verrais d’un œil amusé l’application à la lettre d’une méthode type Scrum dans un environnement de ce type. Ce n'est pas éliminatoire, mais je trouverais ça assez inadapté dans un tel contexte et ça pourrait cacher un certain manque de maturité relié aux points précédents."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"J’essaierais de comprendre s’il y a du turnover. Un gros turnover dans une petite équipe cache quelque chose."}]},{"type":"element","tag":"h2","props":{"id":"le-salaire"},"children":[{"type":"text","value":"Le salaire"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Pour certains, ce ne sera pas une surprise si je dis qu’une startup n’est pas synonyme de gros salaires. D’autres au contraire ont lu des tas d'articles sur l’inflation des salaires dans les startups et s’attendent à des chiffres astronomiques."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Soyons clairs,** l’inflation dont on parle plus haut concerne les scale-ups**, assez peu les startups sauf à quelques rares exceptions."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Si je reprends "},{"type":"element","tag":"a","props":{"href":"https://eventuallycoding.com/2021/07/06/les-salaires-dans-la-tech","rel":["nofollow"]},"children":[{"type":"text","value":"un ancien billet"}]},{"type":"text","value":", les startups sont dans ce que j’appelle le groupe I."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Le salaire doit donc être très proche de ceux qu’on peut trouver sur tous les benchmarks généralistes du marché : urban linker, talent.io, welovedevs, silkhom, afup etc…"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En résumé vous aurez des propositions dans le marché, mais pas au-dessus du marché. Ce n’est pas la meilleure solution pour gagner beaucoup d’argent et donc pas le principal levier de motivation.."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Beaucoup de personnes rejoignent des startups, car elles veulent démarrer un produit de zéro, ne pas être submergés dans des bureaucraties kafkaïennes, être super proches des décisions tech et produit, avoir de l’impact tout simplement."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Se faire plaisir au travail ça n’a pas de prix (tout est relatif, hein…)."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Pour autant il peut y avoir un lien entre une expérience en startup et un impact financier dans le futur."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Premier point, les BSPCE (ou stock options). Beaucoup de startups vont vous en proposer et c’est plutôt une bonne chose. Je ne vais pas vous faire un article sur les BSPCE, je vous invite à lire "},{"type":"element","tag":"a","props":{"href":"https://www.maddyness.com/2019/01/29/maddynoob-tout-comprendre-aux-bspce-ou-presque-en-moins-de-10-minutes/","rel":["nofollow"]},"children":[{"type":"text","value":"celui-ci par Quentin"}]},{"type":"text","value":". Les BSPCE restent un pari, "},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"ça ne doit pas être un prétexte pour faire baisser le salaire"}]},{"type":"text","value":" très nettement en dessous du marché."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Dans certains cas, le gain peut être très important, je vous invite à lire "},{"type":"element","tag":"a","props":{"href":"https://blog.pragmaticengineer.com/equity-for-software-engineers/","rel":["nofollow"]},"children":[{"type":"text","value":"les success stories listés par Pragmatic engineer"}]},{"type":"text","value":". C’est tout ce que je vous souhaite."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Second point, une expérience en startup est très formatrice. Quelques années dans une startup, pour autant qu’elle vive autant que ça, va vous donner des compétences très appréciées ailleurs. C’est aussi un tremplin pour aller en Scale-up. Vous monnayerez cette expérience sur votre CV, pour peu que vous y passiez plus que quelques mois."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"(Un CV avec de multiples expériences de 3 mois n’est pas très vendeur par contre)."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Si la startup a une bonne croissance, l’évolution de votre propre poste peut être très rapide et vous pourrez revendiquer des postes avec des titres un peu ronflants ailleurs."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Il ne faut pas être naïf pour autant, être “Head of engineering” dans une équipe de 10 ne vous fera pas devenir “Head of Engineering” dans une Scale-up de 1000 personnes. Mais votre expérience vous ouvrira des portes."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Petites choses à savoir en vrac."}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Inutile de demander s’il y a des accords d’intéressement et de participation. Une startup ne fait pas de bénéfices, elle ne peut donc pas les distribuer. Naïf, mais j’ai eu la question."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Inutile aussi de demander ce que propose le CE. Il n’y en a pas en dessous de 50 personnes"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Les avantages classiques en startup sont le remote ou à minima une certaine souplesse sur la gestion de son temps, le choix du matériel de dev. Il peut y avoir beaucoup d’imagination sur le sujet donc, à découvrir. Par contre n’allez pas demander s’ils ont mis en place des primes vélos, chèques vacances ou tout ce qui demande de faire de l’administratif. Une startup n’a souvent pas de RH dédiée, ce serait surprenant à cette taille, donc personne pour s’occuper des trucs un peu évolués."}]}]},{"type":"element","tag":"h2","props":{"id":"faites-confiance-à-votre-intuition"},"children":[{"type":"text","value":"Faites confiance à votre intuition"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En fin de compte, il ne s’agit pas pour vous de rechercher l’entreprise parfaite, ça n’existe pas."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Au vu de la taille d’une startup, en arrivant dans les premiers employés vous allez avoir une influence sur la façon dont elle se construit. Donc à vous de choisir ce qui est vital pour vous, et ce qui peut s’accepter en l’état."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"À partir du moment où vous avez posé les bonnes questions, faites confiance à votre intuition."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Au pire, vous aurez à rechercher du boulot encore une fois dans quelque mois. Aujourd’hui en tout cas, on a la chance d’être dans une position favorable pour le faire."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"définition-dune-startup","depth":2,"text":"Définition d’une startup"},{"id":"les-questions-à-se-poser","depth":2,"text":"Les questions à SE poser"},{"id":"les-fondateurs","depth":2,"text":"Les fondateurs"},{"id":"la-santé-financière-de-lentreprise","depth":2,"text":"La santé financière de l’entreprise"},{"id":"la-culture-et-les-valeurs","depth":2,"text":"La culture et les valeurs"},{"id":"le-sérieux-technologique","depth":2,"text":"Le sérieux technologique"},{"id":"le-salaire","depth":2,"text":"Le salaire"},{"id":"faites-confiance-à-votre-intuition","depth":2,"text":"Faites confiance à votre intuition"}]}},"_type":"markdown","_id":"content:articles:2023:01:questions-startup.md","_source":"content","_file":"articles/2023/01/questions-startup.md","_extension":"md"}