[{"data":1,"prerenderedAt":346},["Reactive",2],{"/articles/2012/04/23/devoxx-france-2012-jour-33":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":7,"id":9,"date":10,"categories":11,"tags":13,"cover":15,"readingTime":16,"body":21,"_type":341,"_id":342,"_source":343,"_file":344,"_extension":345},"/articles/2012/04/23/devoxx-france-2012-jour-33","23",false,"","Devoxx France 2012 jour 3/3","531","2012-04-23",[12],"waza",[14],"devoxx","logo-devoxx-france-seul.png",{"text":17,"minutes":18,"time":19,"words":20},"8 min read",7.73,463800,1546,{"type":22,"children":23,"toc":332},"root",[24,45,50,57,62,67,92,97,111,125,134,139,145,150,155,160,166,181,195,217,223,228,233,238,244,249,254,265,271,276,281,317,322,327],{"type":25,"tag":26,"props":27,"children":28},"element","p",{},[29,42],{"type":25,"tag":30,"props":31,"children":35},"a",{"href":32,"rel":33},"http://eventuallycoding.com/wp-content/uploads/2012/04/logo-devoxx-france-seul.png",[34],"nofollow",[36],{"type":25,"tag":37,"props":38,"children":41},"img",{"alt":7,"src":39,"title":40},"/images/logo-devoxx-france-seul.png","Logo-Devoxx-France-seul",[],{"type":43,"value":44},"text"," Voici le 3ème et dernier jour qui commence. Pour ne rien cacher, après 2 journées déjà bien chargées et la soirée Meet and Greet de la veille, cette journée dense qui s'est malgré tout fini à 19h fut difficile à encaisser. Mais bon, que voulez-vous, quand on aime on ne compte pas.",{"type":25,"tag":26,"props":46,"children":47},{},[48],{"type":43,"value":49},"Petit panorama de ce que j'ai pu y voir.",{"type":25,"tag":51,"props":52,"children":54},"h2",{"id":53},"les-keynotes",[55],{"type":43,"value":56},"les keynotes",{"type":25,"tag":26,"props":58,"children":59},{},[60],{"type":43,"value":61},"Comme la veille, je suis arrivé après le début des keynotes. Il faut dire que cette journée de vendredi fut aussi chargée que la veille en nombre de participants donc tout aussi difficile au vestiaire. Sauf qu'à la différence du jeudi un grand nombre a déposé une valise en sus du manteau. Et oui, ça fait partie des grosses surprises de cette édition, nous avons eu beaucoup de gens provenant d'ailleurs. Je n'ai pas encore les chiffres et je ne sais même pas si nous les aurons mais Devoxx France 2012 fut un évènement à l'échelle du pays et non un regroupement de geeks parisiens !",{"type":25,"tag":26,"props":63,"children":64},{},[65],{"type":43,"value":66},"Bon bref, j'ai rejoint en cours de keynote pour assister à une beau discours de Patrick Chanezon (Vmware) qui a su réutiliser le thème de The Artist avec humour. Après avoir bien roulé sa bosse il analyse notre période actuelle comme faisant partie d'un des grand cycles de changement comme il y en a déjà eu dans le passé :",{"type":25,"tag":68,"props":69,"children":70},"ul",{},[71,77,82,87],{"type":25,"tag":72,"props":73,"children":74},"li",{},[75],{"type":43,"value":76},"les applications mainframe à partir des années 60,",{"type":25,"tag":72,"props":78,"children":79},{},[80],{"type":43,"value":81},"le client serveur dans les années 80,",{"type":25,"tag":72,"props":83,"children":84},{},[85],{"type":43,"value":86},"le web dans les années 90 avec sa révolution 2.0 dans les années 2000",{"type":25,"tag":72,"props":88,"children":89},{},[90],{"type":43,"value":91},"et puis enfin les années 2010 avec le cloud, le html5 et le mobile.",{"type":25,"tag":26,"props":93,"children":94},{},[95],{"type":43,"value":96},"Et son dada justement c'est le Cloud, ça tombe bien dis donc ;) Du coup il nous en a parlé et il est revenu notamment sur la différence entre IAAS, PAAS, SAAS en rappelant qu'en tant que développeur nos centres d'intérêt se situent majoritairement sur les PAAS. Avis personnel, avec les pratiques Devops qui font de plus en parler d'elles, le développeur pourrait aussi s'intéresser aux IAAS pour les provisionner de façon bien plus intelligente et efficace qu'auparavant, fin de la parenthèse.",{"type":25,"tag":26,"props":98,"children":99},{},[100,102,109],{"type":43,"value":101},"Les slides de sa présentation sont déjà disponibles sur slideshare, ",{"type":25,"tag":30,"props":103,"children":106},{"href":104,"rel":105},"http://www.slideshare.net/chanezon/devoxx-france-2012-portrait-du-developeur-en-the-artist",[34],[107],{"type":43,"value":108},"je vous laisse les découvrir",{"type":43,"value":110}," si vous avez raté la session. Ils sont suffisamment bien fait pour être compréhensibles.",{"type":25,"tag":26,"props":112,"children":113},{},[114,116,123],{"type":43,"value":115},"Et enfin, dernière keynote, nous avons enchaîné avec \"Abstraction Distractions\" de Neal Ford. Vous pouvez retrouver ",{"type":25,"tag":30,"props":117,"children":120},{"href":118,"rel":119},"http://www.nealford.com/mypastconferences.html",[34],[121],{"type":43,"value":122},"les slides utilisés",{"type":43,"value":124}," sur son site. La encore, bonne keynote, très dynamique et qui a assumé son rôle de note d'ouverture : un discours capable de nous faire aller plus loin que notre train train quotidien. Le thème général tournait autour des abstractions que nous utilisons régulièrement pour résoudre nos problèmes courants d'informaticien et qui nous emmène parfois dans de belles impasses lorsque nous nous laissons distraire de l'objectif initial. Ca ne vous rappelle rien ? Tiens, le discours de Pierre Pezziardi sur la recherche de valeur ! Je ne sais pas si je suis le seul à établir ce lien mais pour moi il existe. Encore une fois la leçon c'est qu'il faut franchir les frontières de la technicité pour résoudre un problème et non se \"vautrer\" dans nos abstractions et perdre de vue la valeur à produire. On notera un superbe raid anti maven effectué par Neal qui aura entamé la charge par une citation plus cinglante :",{"type":25,"tag":126,"props":127,"children":128},"blockquote",{},[129],{"type":25,"tag":26,"props":130,"children":131},{},[132],{"type":43,"value":133},"“Maven builds are an infinite cycle of despair that will slowly drag you into the deepest, darkest pits of hell (where Maven itself was forged).”",{"type":25,"tag":26,"props":135,"children":136},{},[137],{"type":43,"value":138},"Comme quoi, même les plus grands peuvent se tromper ;)",{"type":25,"tag":51,"props":140,"children":142},{"id":141},"grails",[143],{"type":43,"value":144},"Grails",{"type":25,"tag":26,"props":146,"children":147},{},[148],{"type":43,"value":149},"Bon, vous devinez sur quoi j'ai enchaîné par la suite ? Hum, pour le peu de lecteurs qui fréquentent ce site vous vous souviendrez peut être de ma quête du graal avec un cure dent. Eh oui, j'avais testé Grails pour un projet perso et je m'en étais un peu mordu les doigts. Et devinez quoi, Sébastien Blanc et Stéphane Maldini m'avait invité dans les commentaires à venir voir de mes propres yeux leur présentation à Devoxx France ! Forcément c'est ce que j'ai fait ^^",{"type":25,"tag":26,"props":151,"children":152},{},[153],{"type":43,"value":154},"On a assisté à une présentation rapide de Groovy puis de Grails et ensuite ce fut du live coding pendant 30 minutes. Enfin presque live puisqu'une partie du code provenait d'une application de secours. C'était censé illustrer la rapidité de développement avec Grails et c'était bien amené. Bon après c'est comme toutes les présentations de live coding, c'est dangereux et on a eu droit à l'effet démo. Tant pis, ça arrive. Et je ne trollerais pas en disant que les stracktraces à l'écran étaient incompréhensibles, non je ne trollerais pas ;)",{"type":25,"tag":26,"props":156,"children":157},{},[158],{"type":43,"value":159},"On notera les retours très très positifs sur la présentation de Habib Guergachi sur les architectures orientées Web. Vivement son passage sur Parleys tellement les tweets ont été positifs dessus.",{"type":25,"tag":51,"props":161,"children":163},{"id":162},"les-quickies-du-midi",[164],{"type":43,"value":165},"Les quickies du midi",{"type":25,"tag":26,"props":167,"children":168},{},[169,171,179],{"type":43,"value":170},"J'ai vu qu'un seul quickie cette fois car je tenais à ne pas louper le repas cette fois-ci. Et pour poursuivre sur le thème Devops j'ai assisté à ",{"type":25,"tag":30,"props":172,"children":176},{"href":173,"rel":174,"title":175},"http://www.devoxx.com/pages/viewpage.action?pageId=6128509",[34],"DevOps illustré   la jungle de la configuration d'une application",[177],{"type":43,"value":178},"DevOps illustré : la jungle de la configuration d'une application",{"type":43,"value":180},". L'approche était intéressante, elle ne répondait pas complètement à ce que j'attendais car j'aurais aimé voir des solutions de configuration management mais j'y penserais sans doute en fonction des cas de figure.",{"type":25,"tag":26,"props":182,"children":183},{},[184,186,193],{"type":43,"value":185},"J'en profite pour signaler qu'à la même heure il y avait aussi Florent Biville qui passait pour un autre outils qu'on peut ranger dans la catégorie Devops puisqu'il s'agissait de ",{"type":25,"tag":30,"props":187,"children":190},{"href":188,"rel":189},"http://www.liquibase.org/",[34],[191],{"type":43,"value":192},"Liquibase",{"type":43,"value":194},". Pourquoi Devops ? Parce qu'il permet d'intégrer la gestion du cycle de vie des données dans le cycle de vie de l'application. C'est un peu ça au final Devops, c'est l'intégration des différents processus autrefois en silos (dev, dba, ops) amenant à la création d'une application.",{"type":25,"tag":26,"props":196,"children":197},{},[198,200,207,209,215],{"type":43,"value":199},"Et vous avez peut être suivi aussi Andrew Spencer et son talk : ",{"type":25,"tag":30,"props":201,"children":205},{"href":202,"rel":203,"title":204},"http://www.devoxx.com/pages/viewpage.action?pageId=6128512",[34],"L'heure de la SSII coopérative a sonné",[206],{"type":43,"value":204},{"type":43,"value":208}," ? Cool, il parait qu'on a mentionné ",{"type":25,"tag":30,"props":210,"children":212},{"href":211},"www.lateral-thoughts.com",[213],{"type":43,"value":214},"lateral-thoughts",{"type":43,"value":216}," ! Je vous invite à y jeter un oeil ;)",{"type":25,"tag":51,"props":218,"children":220},{"id":219},"le-cloud",[221],{"type":43,"value":222},"Le cloud",{"type":25,"tag":26,"props":224,"children":225},{},[226],{"type":43,"value":227},"La session suivante à laquelle j'ai assisté était centré sur le Cloud. Cyrille Leclerc nous a fait un discours sur les différents services existants aujourd'hui et disponibles pour réaliser une application avec du MongoDb, du Lucene, une base de données, une appli web java. Il a évoqué les différents critères de choix permettant d'opter pour tel ou tel fournisseur en n'oubliant pas les aspects légaux ou les contraintes de vérouillage de certains de ces services.",{"type":25,"tag":26,"props":229,"children":230},{},[231],{"type":43,"value":232},"Déjà premier point positif, l'application présentait un catalogue de cocktails, forcément je me sentais concerné ^^ Ensuite c'était intéressant car on sentait l'étude comparative réalisée et la difficulté de choisir parmi tous les services existants. Pour m'y être un peu frotté, entre le fait de trouver les services, décrypter les grilles tarifaires parfois obscures, comprendre comment s'intégrer dedans etc... C'est une belle jungle.",{"type":25,"tag":26,"props":234,"children":235},{},[236],{"type":43,"value":237},"J'avoue que j'ai ensuite commencé un peu à caler. La fatigue des derniers jours a commencé à se faire ressentir et j'ai donc zappé les trois confs suivantes. J'ai commencé à assister à celle de Olivier Philippot sur les Greens Patterns mais j'ai vite senti que je n'avais plus la concentration nécessaire et je suis ressorti.",{"type":25,"tag":51,"props":239,"children":241},{"id":240},"les-castcodeurs",[242],{"type":43,"value":243},"Les castcodeurs",{"type":25,"tag":26,"props":245,"children":246},{},[247],{"type":43,"value":248},"Comme je l'avais twitté, j'avais besoin de débrancher mon cerveau et c'était vraiment le bon endroit pour cela. Ca été ma dernière session, j'ai pris une bière australienne offert par Atlassian, j'ai ouvert le mode veille et j'ai savouré.",{"type":25,"tag":26,"props":250,"children":251},{},[252],{"type":43,"value":253},"Pour le coup, je vais juste résumer l'ambiance, c'était Fun (oui avec un grand F). Et pour la petite histoire, je faisais partie du comité de sélection pour Devoxx et comme je ne connaissais pas les castcodeurs je ne les avais pas bien notés. J'avais un peu d'appréhension. Eh bien en fin de compte je ne regrette pas, c'est vraiment dans l'esprit, c'est une super session de cloture qui permet de résumer la conf. Bref, je m'étais trompé.",{"type":25,"tag":26,"props":255,"children":256},{},[257,259],{"type":43,"value":258},"Et c'est déjà en ligne ! ",{"type":25,"tag":30,"props":260,"children":263},{"href":261,"rel":262},"http://lescastcodeurs.com/2012/04/les-cast-codeurs-podcast-episode-57-en-direct-de-devoxx-france-2012/",[34],[264],{"type":43,"value":261},{"type":25,"tag":51,"props":266,"children":268},{"id":267},"code-storyhackergartenprogrammatoo",[269],{"type":43,"value":270},"Code story/Hackergarten/Programmatoo",{"type":25,"tag":26,"props":272,"children":273},{},[274],{"type":43,"value":275},"Je me suis rendu compte que j'avais oublié 3 évènements majeurs sur les deux premiers billets. Je me permets donc quelques lignes dessus.",{"type":25,"tag":26,"props":277,"children":278},{},[279],{"type":43,"value":280},"Oui car en parallèle de toutes ces confs nous avons eu droit à 3 formats très spéciaux :",{"type":25,"tag":68,"props":282,"children":283},{},[284,298,303],{"type":25,"tag":72,"props":285,"children":286},{},[287,289,296],{"type":43,"value":288},"un ",{"type":25,"tag":30,"props":290,"children":293},{"href":291,"rel":292},"http://www.devoxx.com/display/FR12/Hackergarten+Paris",[34],[294],{"type":43,"value":295},"hackergarten",{"type":43,"value":297}," permettant à tout un chacun de devenir commiter open source. Apparemment il a bien marché",{"type":25,"tag":72,"props":299,"children":300},{},[301],{"type":43,"value":302},"un atelier de programmation pour les tous petits. Je n'ai pas assisté mais il y a de bons retours",{"type":25,"tag":72,"props":304,"children":305},{},[306,308,315],{"type":43,"value":307},"Code story, 4 geeks, 2 jours, du code et un super défi. Je n'ai vu que des bribes en coup de vent mais ça avait l'air d'envoyer du bois sévère. Et le code est sur ",{"type":25,"tag":30,"props":309,"children":312},{"href":310,"rel":311},"https://github.com/dgageot/CodeStoryDevoxx",[34],[313],{"type":43,"value":314},"github",{"type":43,"value":316}," si vous voulez vous faire une idée.",{"type":25,"tag":26,"props":318,"children":319},{},[320],{"type":43,"value":321},"J'en profite pour saluer le fait qu'on a vu des directeurs informatiques (ou ex directeurs) nous démontrer a quel point ils étaient bons durant cet évènement. Ca a l'air de rien peut être mais c'est un message très fort pour moi. Ce sont des experts et ils sont à des postes importants sans avoir perdu leur fibre de développeur. Ils ne sont pas à leur poste juste pour vendre du vent, ce sont de vrais professionnels. C'est à contre courant de certaines grandes boites et ca fait du bien.",{"type":25,"tag":26,"props":323,"children":324},{},[325],{"type":43,"value":326},"Pour conclure, je vous dis tous à l'année prochaine. Ce fut une très belle édition et j'espère que nous nous y reverrons si vous étiez déjà présents ou bien que ces petits résumés vous ont incité à venir la prochaine fois si vous avez du zapper cette année.",{"type":25,"tag":26,"props":328,"children":329},{},[330],{"type":43,"value":331},"Et un merci à Arnaud Héritier pour les photos que j'ai collé sur la série. Elles viennent toutes de son appareil.",{"title":7,"searchDepth":333,"depth":333,"links":334},2,[335,336,337,338,339,340],{"id":53,"depth":333,"text":56},{"id":141,"depth":333,"text":144},{"id":162,"depth":333,"text":165},{"id":219,"depth":333,"text":222},{"id":240,"depth":333,"text":243},{"id":267,"depth":333,"text":270},"markdown","content:articles:2012:04:23:devoxx-france-2012-jour-33.md","content","articles/2012/04/23/devoxx-france-2012-jour-33.md","md",1700650418820]