[{"data":1,"prerenderedAt":296},["Reactive",2],{"/articles/2022/11/scrum-is-dead":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"date":11,"tags":12,"img":17,"cover":17,"readingTime":18,"body":23,"_type":291,"_id":292,"_source":293,"_file":294,"_extension":295},"/articles/2022/11/scrum-is-dead","11",false,"","Scrum is dead","Autant le discours de ces dernières années sur l'agilité m'a fatigué, autant ce serait dommage de jeter le bébé avec l'eau du bain.","5","2022-11-08",[13,14,15,16],"lean","agile","product","scrum","grave.jpg",{"text":19,"minutes":20,"time":21,"words":22},"6 min read",5.39,323400,1078,{"type":24,"children":25,"toc":285},"root",[26,34,39,50,55,83,88,97,106,111,124,131,136,144,154,159,164,175,180,190,196,201,220,225,231,236,241,260,265,270,275,280],{"type":27,"tag":28,"props":29,"children":30},"element","p",{},[31],{"type":32,"value":33},"text","Récemment sur Twitter, un petit débat a eu lieu autour de l'agilité, et de Scrum en particulier.",{"type":27,"tag":28,"props":35,"children":36},{},[37],{"type":32,"value":38},"Je vous laisse en profiter ici :",{"type":27,"tag":28,"props":40,"children":41},{},[42],{"type":27,"tag":43,"props":44,"children":48},"a",{"href":45,"rel":46},"https://twitter.com/maxime_bajeux/status/1581236820419186688",[47],"nofollow",[49],{"type":32,"value":45},{"type":27,"tag":28,"props":51,"children":52},{},[53],{"type":32,"value":54},"(et les commentaires sont intéressants)",{"type":27,"tag":28,"props":56,"children":57},{},[58,60,66,68,72,74,81],{"type":32,"value":59},"C'est loin d'être la première fois que Scrum se prend des volées de bois vert. Je vous laisse vous amuser à effectuer la recherche ",{"type":27,"tag":43,"props":61,"children":64},{"href":62,"rel":63},"https://www.google.com/search?q=scrum+is+dead&oq=scrum+is+dead",[47],[65],{"type":32,"value":8},{"type":32,"value":67}," sur Google.",{"type":27,"tag":69,"props":70,"children":71},"br",{},[],{"type":32,"value":73},"\nMoi-même encore récemment j'écrivais ",{"type":27,"tag":43,"props":75,"children":78},{"href":76,"rel":77},"https://eventuallycoding.com/2021/06/14/pourquoi-le-sujet-nest-plus-dadopter-lagilite-mais-de-changer-de-culture-produit",[47],[79],{"type":32,"value":80},"un billet",{"type":32,"value":82}," dont le premier chapitre s'intitulait \"l'Agile est mort\"",{"type":27,"tag":28,"props":84,"children":85},{},[86],{"type":32,"value":87},"Mais dans le même temps j'écrivais :",{"type":27,"tag":89,"props":90,"children":91},"blockquote",{},[92],{"type":27,"tag":28,"props":93,"children":94},{},[95],{"type":32,"value":96},"Mais, autant le discours de ces dernières années sur l'agilité m'a fatigué, autant ce serait dommage de jeter le bébé avec l'eau du bain.",{"type":27,"tag":98,"props":99,"children":100},"disclaimer",{},[101],{"type":27,"tag":28,"props":102,"children":103},{},[104],{"type":32,"value":105},"Attention, dans la suite de ce billet on pourrait croire que je fais l'amalgame entre Scrum et Agile. Ce n'est pas le cas mais Scrum est devenu la méthode agile standard de facto dans de nombreuses entreprises, pour le meilleur, et surtout pour le pire.",{"type":27,"tag":28,"props":107,"children":108},{},[109],{"type":32,"value":110},"Remarquez, c'est déjà mieux que celles qui font du SAFe...",{"type":27,"tag":112,"props":113,"children":114},"image",{},[115],{"type":27,"tag":28,"props":116,"children":117},{},[118],{"type":27,"tag":119,"props":120,"children":123},"img",{"alt":121,"src":122},"SAFE is the new waterfall","/images/safe-waterfall.jpg",[],{"type":27,"tag":125,"props":126,"children":128},"h2",{"id":127},"pourquoi-la-scrum-fatigue",[129],{"type":32,"value":130},"Pourquoi la \"Scrum fatigue\" ?",{"type":27,"tag":28,"props":132,"children":133},{},[134],{"type":32,"value":135},"Déjà on va différentier deux choses, l'agilité en théorie, l'agilité en pratique. Et comme bien souvent, le plus important ca va être la pratique.",{"type":27,"tag":89,"props":137,"children":138},{},[139],{"type":27,"tag":28,"props":140,"children":141},{},[142],{"type":32,"value":143},"Un jour j'irais vivre en théorie parce qu'en théorie, tout va bien.",{"type":27,"tag":28,"props":145,"children":146},{},[147,149,152],{"type":32,"value":148},"Si on prend la base de la base, l'agilité, c'est le fait de développer par incréments utilisable.\nJe ne prends pas trop de risque à dire qu'aujourd'hui c'est le standard accepté par presque tout le monde.",{"type":27,"tag":69,"props":150,"children":151},{},[],{"type":32,"value":153},"\nAlors oui, le \"utilisable\" n'est pas toujours synonyme de mis en prod. On rencontre encore des équipes qui mettent en prod tout les trimestres ou semestre, mais globalement tout le monde s'accorde vers le fait de diminuer les temps de cycle. A l'opposé du spectre, on a de plus en plus d'équipes capables de mettre en prod dans la journée, voire plusieurs fois par jour.",{"type":27,"tag":28,"props":155,"children":156},{},[157],{"type":32,"value":158},"Ensuite il y a d'autres fondamentaux dans les principes agiles qui sont plus ou moins bien respectés, ou compris (comme le rythme soutenable). Et c'est souvent là où l'agilité en pratique échoue dans de très nombreuses équipes. D'où le thread Twitter ci-dessus.",{"type":27,"tag":28,"props":160,"children":161},{},[162],{"type":32,"value":163},"La réunionite, les sessions d'estimations toutes cassées, les product Owner, les story point, les daily meetings qui deviennent des moments désagréables et j'en passe, tout un tas de truc qui vous amène vite à la rupture.",{"type":27,"tag":112,"props":165,"children":166},{},[167],{"type":27,"tag":28,"props":168,"children":169},{},[170],{"type":27,"tag":119,"props":171,"children":174},{"alt":172,"src":173},"But I'm certified!","/images/product-by-scrum-1024x1024.jpg",[],{"type":27,"tag":28,"props":176,"children":177},{},[178],{"type":32,"value":179},"Bref, l'implémentation de l'agilité, souvent bancale, est à différentier de son objectif de base. On est presque tous d'accord pour livrer par incréments et amener progressivement de la valeur aux utilisateurs, récolter du feedback, itérer. En pratique on ne sait pas toujours comment faire, on se fait bien souvent mener en bateau par les innombrables consultants/coachs en agilité, transfo digitale etc... qui n'ont pas eux même d'expérience de création de produit.",{"type":27,"tag":28,"props":181,"children":182},{},[183,185,188],{"type":32,"value":184},"Mais surtout, surtout, vouloir implémenter une méthode dans une entreprise avec une culture logicielle défaillante, des pratiques de management toxiques, ça ne change ni l'un, ni l'autre. Vous pouvez mettre toutes les réus de Scrum possible, vous ne saurez pas mieux faire du logiciel ou créer une culture produit dans une entreprise. D'autant plus quand l'agilité est cantonnée à l'équipe de dev uniquement.",{"type":27,"tag":69,"props":186,"children":187},{},[],{"type":32,"value":189},"\nEt il est très facile d'utiliser une méthode agile, Scrum par exemple, avec des objectifs radicalement différents. Les daily pour faire du micro management, les estimations pour pressurer, les Scrum Masters pour reconvertir les anciens chefs de projet etc..",{"type":27,"tag":125,"props":191,"children":193},{"id":192},"premier-contact",[194],{"type":32,"value":195},"Premier contact",{"type":27,"tag":28,"props":197,"children":198},{},[199],{"type":32,"value":200},"Mon premier contact avec l'agilité, c'était en 2006/2007, donc plutôt tôt pour la France, grâce à mon boss de l'époque qui avait compris son potentiel.\nEn 2010, étant devenu freelance et bénéficiant de ces 3/4 ans de mise en pratique, j'ai fait une mission d'un an en tant que coach agile. Je participais à l'écosystème, j'ai plusieurs billets de blog ici-même qui parle de ca, de transfo agile etc...",{"type":27,"tag":28,"props":202,"children":203},{},[204,206,209,211,218],{"type":32,"value":205},"Mais ce fut loin d'être un long fleuve tranquille et j'ai fini par m'en désintéresser car cela n'avait pas toujours l'impact espéré. Et plus le temps passait, plus j'étais irrité par certains gourous de l'agilité. D'ailleurs on parle souvent d'évangéliste, il y a un petit peu quelque chose de négatif là-dedans vous ne trouvez pas ?",{"type":27,"tag":69,"props":207,"children":208},{},[],{"type":32,"value":210},"\n(Marrant, j'écrivais ca en 2010 : ",{"type":27,"tag":43,"props":212,"children":215},{"href":213,"rel":214},"https://eventuallycoding.com/2010/10/28/euh-lagilite-finalement-cest-pas-un-peu-une-secte-2",[47],[216],{"type":32,"value":217},"L'agilité, c'est pas un peu une secte",{"type":32,"value":219},")\nJ'en pouvais plus de certains discours creux sur les valeurs agiles, des serious games etc...",{"type":27,"tag":28,"props":221,"children":222},{},[223],{"type":32,"value":224},"Et c'est pour ça que c'est un sujet que je n'aborde plus souvent sur mon blog.\nCe billet fait exception, mais ce n'est plus un sujet qui me passionne. Avant tout, ce qui m'intéresse, c'est de construire un produit, qui soit utilisé et qui apporte quelque chose.",{"type":27,"tag":125,"props":226,"children":228},{"id":227},"mais-cela-fait-partie-des-outils-que-jai-à-disposition-et-que-jai-suffisament-pratiqué-pour-savoir-les-utiliser-correctement",[229],{"type":32,"value":230},"MAIS, cela fait partie des outils que j'ai à disposition et que j'ai suffisament pratiqué pour savoir les utiliser correctement.",{"type":27,"tag":28,"props":232,"children":233},{},[234],{"type":32,"value":235},"Parce qu'en fait, bien utilisé, ça marche.",{"type":27,"tag":28,"props":237,"children":238},{},[239],{"type":32,"value":240},"Pour toute cassé que soit de nombreuses implémentations de méthodes agiles, je ne souscris pas au fait de tout jeter. Quelle est l'alternative ?",{"type":27,"tag":28,"props":242,"children":243},{},[244,246,253,255,258],{"type":32,"value":245},"La ",{"type":27,"tag":43,"props":247,"children":250},{"href":248,"rel":249},"https://www.la-rache.com/",[47],[251],{"type":32,"value":252},"méthode à la rache",{"type":32,"value":254}," ?",{"type":27,"tag":69,"props":256,"children":257},{},[],{"type":32,"value":259},"\nC'est assez facile en regardant de l'extérieur de penser que se passer de méthode est plus efficace. Mais construire du logiciel, c'est aussi le faire vivre, c'est la possibilité de le passer à l'échelle, c'est le travail en équipe et tout ça nécessite un cadre de travail et une mécanique de construction reproductible.",{"type":27,"tag":28,"props":261,"children":262},{},[263],{"type":32,"value":264},"Construire un prototype tout seul ne nécessite pas autant de méthodes, mais ça en nécessite quand même. Par contre, construire un produit complexe avec plus d'une dizaine de personnes, qui devra encore fonctionner dans 2 ans et avec de nombreux utilisateurs, sans cadre de travail, c'est l'assurance du désastre.",{"type":27,"tag":28,"props":266,"children":267},{},[268],{"type":32,"value":269},"Lorsque je vois des candidats pour Malt, je dis systématiquement la même chose. Oui, on connait Scrum (et Kanban etc...), mais sans l'appliquer de façon stricte. Chaque équipe est libre de son organisation. Ce qu'on regarde à la fin, c'est le produit final et ces externalités (taux de conversion, nps etc...), pas le nombre de story point dont tout le monde se fout.\nJ'ai bien conscience que peut-être, pour certains, ça donne l'apparence d'une absence de méthode ou de mauvaise implémentation. Ce n'est pas assez proche du dogme.",{"type":27,"tag":28,"props":271,"children":272},{},[273],{"type":32,"value":274},"Mais c'est loin d'être le cas. Je considère que nous avons une équipe expérimentée, qui a le recul et l'expérience nécessaire pour créer, appliquer et adapter un processus de création mature et sans forcément coller à la lettre d'une méthode en particulier.",{"type":27,"tag":28,"props":276,"children":277},{},[278],{"type":32,"value":279},"Bref, en réalité Scrum est mort ainsi que l'agilité à partir du moment où le manifeste a été écrit, des livres sont sortis, des certifications ont été créées.",{"type":27,"tag":28,"props":281,"children":282},{},[283],{"type":32,"value":284},"Pour autant, il faut le voir comme une boite à outils qui peut vous permettre de construire un cadre de travail, cadre de toute façon nécessaire au-delà d'une certaine taille. Et ce cadre, doit évoluer avec le temps et les équipes.",{"title":7,"searchDepth":286,"depth":286,"links":287},2,[288,289,290],{"id":127,"depth":286,"text":130},{"id":192,"depth":286,"text":195},{"id":227,"depth":286,"text":230},"markdown","content:articles:2022:11:scrum-is-dead.md","content","articles/2022/11/scrum-is-dead.md","md",1699821945778]