[{"data":1,"prerenderedAt":658},["Reactive",2],{"/articles/2019/05/28/le-teletravail-chez-malt":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"date":11,"categories":12,"tags":14,"img":17,"cover":18,"readingTime":19,"body":24,"_type":653,"_id":654,"_source":655,"_file":656,"_extension":657},"/articles/2019/05/28/le-teletravail-chez-malt","28",false,"","Le télétravail chez Malt","Parlons télétravail pour ce billet !\nSi le télétravail (ou remote) s'est bien développé récemment, il est loin d'être encore très fréquent en France,...","1411","2019-05-28",[13],"waza",[15,16],"remote","teletravail","holo2.jpg","cover6.jpg",{"text":20,"minutes":21,"time":22,"words":23},"14 min read",13.025,781500,2605,{"type":25,"children":26,"toc":644},"root",[27,35,51,56,61,66,80,85,90,95,100,105,110,139,144,151,156,163,168,173,187,206,220,225,234,239,247,253,258,263,296,301,306,311,316,321,326,331,336,341,346,389,395,400,405,410,415,420,425,430,473,478,484,489,494,499,504,509,514,519,524,529,534,539,544,549,554,559,564,569,574,579,592,597,602,607,612,617,624,629,634,639],{"type":28,"tag":29,"props":30,"children":31},"element","p",{},[32],{"type":33,"value":34},"text","Parlons télétravail pour ce billet !",{"type":28,"tag":29,"props":36,"children":37},{},[38,40,49],{"type":33,"value":39},"Si le télétravail (ou remote) s'est bien développé récemment, il est loin d'être encore très fréquent en France, seulement ",{"type":28,"tag":41,"props":42,"children":46},"a",{"href":43,"rel":44},"https://solutions.lesechos.fr/juridique/c/le-teletravail-depuis-les-ordonnances-macron-12776/",[45],"nofollow",[47],{"type":33,"value":48},"17% de la population active",{"type":33,"value":50},".",{"type":28,"tag":29,"props":52,"children":53},{},[54],{"type":33,"value":55},"Et pourtant il semble fortement demandé et je dirais même, idéalisé.",{"type":28,"tag":29,"props":57,"children":58},{},[59],{"type":33,"value":60},"Dans ce billet je vous propose de vous décrire la façon dont nous faisons du télétravail chez Malt, les pratiques qui fonctionnent et celles qui n'ont pas fonctionné.",{"type":28,"tag":29,"props":62,"children":63},{},[64],{"type":33,"value":65},"Le télétravail chez Malt c'est un mode de travail mis en place dès le début avec un fondateur à Lyon, deux à Paris et la première salariée à Barcelone.",{"type":28,"tag":29,"props":67,"children":68},{},[69,71,78],{"type":33,"value":70},"Si au début on pourrait considérer qu'il s'agissait plus d'une situation résultant d'une contrainte, dès 2014, Vincent bloggait sous un titre emblématique \"",{"type":28,"tag":41,"props":72,"children":75},{"href":73,"rel":74},"https://blog.malt.fr/pourquoi-nous-avons-chasse-notre-equipe-du-bureau-ou-presque/",[45],[76],{"type":33,"value":77},"Pourquoi nous avons chassé notre équipe du bureau",{"type":33,"value":79},"\".",{"type":28,"tag":29,"props":81,"children":82},{},[83],{"type":33,"value":84},"Aujourd'hui, en 2019, nous avons bien des locaux : à Paris, Lyon, Madrid et prochainement à Munich.",{"type":28,"tag":29,"props":86,"children":87},{},[88],{"type":33,"value":89},"Nous avons mis en place une auto gestion sur le lieu de travail avec une contrainte : ne pas dépasser 4/5eme en remote, c'est à dire pouvoir se voir au moins une fois par semaine mais vous pouvez décider aussi de venir au bureau tous les jours.",{"type":28,"tag":29,"props":91,"children":92},{},[93],{"type":33,"value":94},"A cela nous avons associé une politique de voyage souple, chacun peut choisir d'aller dans les autres bureaux de Malt quand il le souhaite en utilisant une carte bleue virtuelle (coucou spendesk) pour acheter le billet.",{"type":28,"tag":29,"props":96,"children":97},{},[98],{"type":33,"value":99},"Enfin notre gestion de l'espace de travail a évolué. A Lyon par exemple, nous faisons du flex office (bureau dynamique), c'est à dire que chacun peut se placer où il le souhaite quand il arrive. On peut donc se placer à côté de la personne avec qui nous avions décidé de travailler ce jour là, qu'il soit de Lyon ou d'une autre ville s'il est de passage.",{"type":28,"tag":29,"props":101,"children":102},{},[103],{"type":33,"value":104},"Cumulez tout cela et vous vous retrouvez avec des bureaux qui changent de configuration tous les jours, des collègues qui sont un jour distant, le jour suivant à côté de vous.",{"type":28,"tag":29,"props":106,"children":107},{},[108],{"type":33,"value":109},"Les avantages les plus immédiats que tout le monde cite :",{"type":28,"tag":111,"props":112,"children":113},"ul",{},[114,120,134],{"type":28,"tag":115,"props":116,"children":117},"li",{},[118],{"type":33,"value":119},"Déjà, le télétravail c'est moins de stress et de fatigue liés aux transports. Démarrer sa journée par une heure de transport collé contre une vitre c'est pas optimal",{"type":28,"tag":115,"props":121,"children":122},{},[123,125,132],{"type":33,"value":124},"C'est aussi éviter les bruits d'un open space et donc bénéficier d'une meilleure concentration. Saviez-vous que l'open space serait la cause de la ",{"type":28,"tag":41,"props":126,"children":129},{"href":127,"rel":128},"https://www.nouvelobs.com/bien-bien/20150616.OBS0908/pourquoi-il-faut-en-finir-avec-l-open-space.html",[45],[130],{"type":33,"value":131},"perte de 66% de la productivité",{"type":33,"value":133}," ?",{"type":28,"tag":115,"props":135,"children":136},{},[137],{"type":33,"value":138},"Et si jamais votre bilan carbone est important à vos yeux et que cela vous évite de prendre la voiture, les gains en CO2 sont vraiment conséquents.",{"type":28,"tag":29,"props":140,"children":141},{},[142],{"type":33,"value":143},"Le télétravail c'est aussi la fin des soucis liés aux grèves et pannes, une meilleure santé (on reste chez soi si on a un léger rhume pour ne pas le refiler aux autres), une réduction des frais de locaux (uniquement si vous faites du flex office, sinon ca ne marche pas), un gain financier pour le salarié, une attractivité plus forte à l'embauche, une souplesse énorme pour accueillir une livraison/un artisan ou aller récupérer ses enfants à l'école bref des avantages pour tout le monde.",{"type":28,"tag":145,"props":146,"children":148},"h1",{"id":147},"mais-nidéalisez-pas-non-plus",[149],{"type":33,"value":150},"Mais n'idéalisez pas non plus !",{"type":28,"tag":29,"props":152,"children":153},{},[154],{"type":33,"value":155},"Si je suis convaincu par le télétravail, je reconnais également que ce n'est pas si simple à faire fonctionner correctement et qu'on peut nuancer chaque avantage ci-dessus.",{"type":28,"tag":157,"props":158,"children":160},"h3",{"id":159},"bruit-ou-échanges",[161],{"type":33,"value":162},"Bruit ou échanges ?",{"type":28,"tag":29,"props":164,"children":165},{},[166],{"type":33,"value":167},"Si l'open space est destructeur en terme de concentrations c'est aussi un lieu d'échanges et de créativité.",{"type":28,"tag":29,"props":169,"children":170},{},[171],{"type":33,"value":172},"Ce n'est pas pour rien que l'agilité prone des équipes colocalisées.",{"type":28,"tag":29,"props":174,"children":175},{},[176,178,185],{"type":33,"value":177},"En écrivant ce billet je suis tombé sur ",{"type":28,"tag":41,"props":179,"children":182},{"href":180,"rel":181},"https://blog.octo.com/ce-que-la-science-nous-dit-de-la-colocalisation/",[45],[183],{"type":33,"value":184},"cet autre billet de 2010",{"type":33,"value":186}," de Octo où on peut lire une citation :",{"type":28,"tag":188,"props":189,"children":190},"blockquote",{},[191,196],{"type":28,"tag":29,"props":192,"children":193},{},[194],{"type":33,"value":195},"« High-bandwidth communication is one of the core practices of Scrum… The best communication is face to face, with communications occurring through facial expression, body language, intonation, and words. »",{"type":28,"tag":29,"props":197,"children":198},{},[199],{"type":28,"tag":41,"props":200,"children":203},{"href":201,"rel":202},"https://en.wikipedia.org/wiki/Ken_Schwaber",[45],[204],{"type":33,"value":205},"Ken Schwaber",{"type":28,"tag":29,"props":207,"children":208},{},[209,211,218],{"type":33,"value":210},"Et le reste de l'article est aussi intéressant, mentionnant également Eric Schmidt de Google qui a énoncé les ",{"type":28,"tag":41,"props":212,"children":215},{"href":213,"rel":214},"https://searchenginewatch.com/sew/news/2060252/eric-schmidt-lays-out-googles-ten-golden-rules",[45],[216],{"type":33,"value":217},"10 règles d'Or chez Google",{"type":33,"value":219},", dont l'une d'entre elles est \"pack them in\".",{"type":28,"tag":29,"props":221,"children":222},{},[223],{"type":33,"value":224},"De plus, même si les méthodes de communication en ligne s'améliorent, on est encore loin de l'holoportation (communication par hologrammes actuellement en travail par certaines sociétés), les réseaux ne sont pas toujours fiables pour la vidéo, le matériel (casque et micro) reste perfectible, bref, cela ressemble encore plus à ca :",{"type":28,"tag":29,"props":226,"children":227},{},[228],{"type":28,"tag":41,"props":229,"children":232},{"href":230,"rel":231},"https://www.youtube.com/watch?v=kNz82r5nyUw",[45],[233],{"type":33,"value":230},{"type":28,"tag":29,"props":235,"children":236},{},[237],{"type":33,"value":238},"qu'à ca :",{"type":28,"tag":29,"props":240,"children":241},{},[242],{"type":28,"tag":243,"props":244,"children":246},"img",{"alt":7,"src":245},"/images/holo2.jpg",[],{"type":28,"tag":157,"props":248,"children":250},{"id":249},"alors-bonne-ou-mauvaise-la-colocalisation",[251],{"type":33,"value":252},"Alors bonne ou mauvaise la colocalisation ?",{"type":28,"tag":29,"props":254,"children":255},{},[256],{"type":33,"value":257},"Eh bien les deux. C'est indéniable que les échanges ont plus de chances d'arriver si vous êtes proches et c'est indéniable également qu'il y a plus d'éléments de communication qui passent mieux en face à face qu'à l'écrit ou qu'en vidéo conférence.",{"type":28,"tag":29,"props":259,"children":260},{},[261],{"type":33,"value":262},"D'ailleurs dans l'ordre, voici, pour moi, les moyens de communication les plus efficaces dans une communication à deux si on ne prend en objectif que la compréhension :",{"type":28,"tag":111,"props":264,"children":265},{},[266,271,276,281,286,291],{"type":28,"tag":115,"props":267,"children":268},{},[269],{"type":33,"value":270},"le face à face",{"type":28,"tag":115,"props":272,"children":273},{},[274],{"type":33,"value":275},"la vidéo conf avec casque intégral (on perd cependant une partie de la communication non verbale, le langage du corps)",{"type":28,"tag":115,"props":277,"children":278},{},[279],{"type":33,"value":280},"la vidéo conf avec micro d'ambiance (avec la qualité de son qui se dégrade, on perd des intonations et de la réactivité dans les échanges)",{"type":28,"tag":115,"props":282,"children":283},{},[284],{"type":33,"value":285},"le téléphone (toute la communication corporelle disparaît)",{"type":28,"tag":115,"props":287,"children":288},{},[289],{"type":33,"value":290},"le slack (les nuances disparaissent)",{"type":28,"tag":115,"props":292,"children":293},{},[294],{"type":33,"value":295},"l'email (perte de l'échange interactif)",{"type":28,"tag":29,"props":297,"children":298},{},[299],{"type":33,"value":300},"Attention, cet ordre ne serait pas le même si je devais par exemple être sûr que l'info soit diffusé à un large groupe ou archivé pour des personnes absentes.",{"type":28,"tag":29,"props":302,"children":303},{},[304],{"type":33,"value":305},"Mais bon, comme je le disais au début, le bruit d'un open space serait la cause de beaucoup de stress et de perte de productivité.",{"type":28,"tag":29,"props":307,"children":308},{},[309],{"type":33,"value":310},"Et puis la proximité et les bureaux ce n'est pas non plus la panacée en terme de communication.",{"type":28,"tag":29,"props":312,"children":313},{},[314],{"type":33,"value":315},"Dans bon nombre de boîtes, vous pouvez être sur deux bureaux du même immeuble et ne pas être informé. Vous pouvez faire partie d'une équipe, être absent et louper une information importante.",{"type":28,"tag":29,"props":317,"children":318},{},[319],{"type":33,"value":320},"Vous pouvez avoir des décisions prises sur une pause café ou pendant la pause repas.",{"type":28,"tag":29,"props":322,"children":323},{},[324],{"type":33,"value":325},"Une bonne communication ça passe par une diffusion, un archivage, une facilité pour la retrouver.",{"type":28,"tag":29,"props":327,"children":328},{},[329],{"type":33,"value":330},"Et en développant notre mode de travail distribué (multi sites et télétravail) nous avons aussi grandement amélioré la capacité de faire passer l'information à un groupe plus large. Nous essayons d'utiliser les bons canaux de communication en fonction du contexte, par exemple : slack pour de l'immédiat, de l'échange interactif éphémère, l'email pour une diffusion large, le bugtracker pour des échanges précis et la traçabilité, le wiki pour de la documentation etc...",{"type":28,"tag":29,"props":332,"children":333},{},[334],{"type":33,"value":335},"Vous pouvez être chez vous, à Lyon ou Paris, vous avez accès aux mêmes infos.",{"type":28,"tag":29,"props":337,"children":338},{},[339],{"type":33,"value":340},"En fin de compte pour essayer d'obtenir le meilleur des deux mondes, nous essayons de nous voir régulièrement pour préserver ces moments d'échanges et de grande créativité. Nous ne faisons donc pas du full remote. Ensuite, sortis de ces moments d'échanges, nous bénéficions du calme et de la concentration du télétravail pour travailler efficacement.",{"type":28,"tag":29,"props":342,"children":343},{},[344],{"type":33,"value":345},"Dans les choses qu'on a appris :",{"type":28,"tag":111,"props":347,"children":348},{},[349,354,359,364,369,374,379,384],{"type":28,"tag":115,"props":350,"children":351},{},[352],{"type":33,"value":353},"il ne faut pas économiser sur le matériel audio et vidéo de chacun",{"type":28,"tag":115,"props":355,"children":356},{},[357],{"type":33,"value":358},"un bon setup de son dans une salle de réu ça coûte cher, mais mieux vaut un setup cher et utilisé qu'un setup pas cher inutile",{"type":28,"tag":115,"props":360,"children":361},{},[362],{"type":33,"value":363},"les micros d'ambiance des ordinateurs portables sont tous pourris et ne doivent pas être utilisés",{"type":28,"tag":115,"props":365,"children":366},{},[367],{"type":33,"value":368},"lors d'une réunion, soit tout le monde est dans la même pièce, soit personne. Même si ca peut paraître bizarre, si vous avez 10 personnes dans un lieu et une à distance, chacun devrait être sur son propre poste avec un casque et un micro, sinon, n'invitez même pas celui qui est à distance, vous ne ferez que lui créer de la frustration",{"type":28,"tag":115,"props":370,"children":371},{},[372],{"type":33,"value":373},"on peut faire des rétrospectives à distance avec des outils en ligne (comme retrium)",{"type":28,"tag":115,"props":375,"children":376},{},[377],{"type":33,"value":378},"on peut faire du pair programming à distance avec vscode liveShare par exemple",{"type":28,"tag":115,"props":380,"children":381},{},[382],{"type":33,"value":383},"une réu sans agenda, sans compte rendu, avec les mauvais interlocuteurs et mal timé c'est toujours une mauvaise réunion. Mais à distance ça se voit encore plus !",{"type":28,"tag":115,"props":385,"children":386},{},[387],{"type":33,"value":388},"se voir régulièrement renforce la cohésion d'équipe et la motivation qui a tendance à se distendre à distance",{"type":28,"tag":157,"props":390,"children":392},{"id":391},"le-télétravail-cest-aussi-un-grand-changement-individuel-quil-faut-savoir-gérer",[393],{"type":33,"value":394},"Le télétravail, c'est aussi un grand changement individuel qu'il faut savoir gérer",{"type":28,"tag":29,"props":396,"children":397},{},[398],{"type":33,"value":399},"Eh oui sans surprise, le télétravail c'est quelque chose qui peut beaucoup changer vos habitudes de vies et tout le monde n'y est pas prêt.",{"type":28,"tag":29,"props":401,"children":402},{},[403],{"type":33,"value":404},"C'est par exemple un lien social qui peut se dégrader et se restreindre à votre seul environnement familial. Alors certes vous êtes content de passer plus de temps avec eux mais peut-être que vous allez vous rendre compte que les pauses midis ou pause cafés avec vos collègues vont vous manquer, que les pots du soir improvisé en sortie de bureau sont plus difficiles à organiser et que ne vivre qu'entre les murs de votre maison/appartement c'est un peu... limité.  ",{"type":28,"tag":29,"props":406,"children":407},{},[408],{"type":33,"value":409},"D'ailleurs en parlant de vos repas du midi, les restes de la veille réchauffé au micro ondes et englouti en 5 minutes, ça peut vous frustrer à la longue.",{"type":28,"tag":29,"props":411,"children":412},{},[413],{"type":33,"value":414},"Votre famille peut aussi ne plus faire la différence entre votre travail et votre temps libre, vous interrompant donc pendant un temps de travail. Imaginez votre mère qui passe un après midi en sachant que vous êtes là et forcément \"disponible\".",{"type":28,"tag":29,"props":416,"children":417},{},[418],{"type":33,"value":419},"Si vous êtes plus au calme, les notifications emails, slack, etc... peuvent être très nombreuses et vous perturber presque autant que le bruit d'un open space.",{"type":28,"tag":29,"props":421,"children":422},{},[423],{"type":33,"value":424},"Bref, là encore, ce sont des nouvelles habitudes à mettre en place.",{"type":28,"tag":29,"props":426,"children":427},{},[428],{"type":33,"value":429},"Parmi les choses que j'ai appris ou observé :",{"type":28,"tag":111,"props":431,"children":432},{},[433,438,443,448,453,458,463,468],{"type":28,"tag":115,"props":434,"children":435},{},[436],{"type":33,"value":437},"il faut avoir un bureau dédié dans votre maison. C'est pas à la portée de tout le monde mais ce sera bien plus simple pour \"clore\" symboliquement votre journée et  faire une séparation avec votre entourage",{"type":28,"tag":115,"props":439,"children":440},{},[441],{"type":33,"value":442},"pour votre propre estime de soi et de celle de votre entourage, gardez une bonne hygiène de vie. Bosser chez soi ne veut pas dire bosser en robe de chambre et mal rasé.",{"type":28,"tag":115,"props":444,"children":445},{},[446],{"type":33,"value":447},"garder un rituel de vie de bureau. Conservez un rythme fixe sur les horaires de travail, de pause, de nourriture et ne vous décalez pas sur les soirées. Il n'y a que Batman qui travaille le jour et la nuit.",{"type":28,"tag":115,"props":449,"children":450},{},[451],{"type":33,"value":452},"vous pouvez faire des pauses cafés en vidéo conf, ca marche pas mal (j'ai testé pour vous).",{"type":28,"tag":115,"props":454,"children":455},{},[456],{"type":33,"value":457},"Réglez vos logiciels pour couper toutes les notifications inutiles, mais gardez un rythme de surveillance pour rester joignable.",{"type":28,"tag":115,"props":459,"children":460},{},[461],{"type":33,"value":462},"vous pouvez compenser vos repas très courts du midi par d'autres activités, sportives, associatives etc...",{"type":28,"tag":115,"props":464,"children":465},{},[466],{"type":33,"value":467},"ne pas croire qu'on peut garder un enfant et travailler, c'est totalement illusoire, personne n'y arrive",{"type":28,"tag":115,"props":469,"children":470},{},[471],{"type":33,"value":472},"si vous avez une tendance naturelle à jouer à l’ermite et vous renfermer, forcez-vous, utilisez la video conf plus souvent que les autres et allez au bureau plus régulièrement que les autres sinon vous risquez de renforcer votre manque de sociabilité",{"type":28,"tag":29,"props":474,"children":475},{},[476],{"type":33,"value":477},"Et si vraiment ce n'est pas fait pour vous, que vous ne trouvez pas un bon équilibre, n'insistez pas, venez au bureau ou dans un espace de coworking si ce n'est pas possible.",{"type":28,"tag":157,"props":479,"children":481},{"id":480},"et-la-gestion-déquipe-dans-tout-ça",[482],{"type":33,"value":483},"Et la gestion d'équipe dans tout ça ?",{"type":28,"tag":29,"props":485,"children":486},{},[487],{"type":33,"value":488},"Par gestion d'équipe j'entends les méthodes de gestion de projet, le suivi individuel, la formation des nouveaux arrivants, le suivi des juniors et stagiaires.",{"type":28,"tag":29,"props":490,"children":491},{},[492],{"type":33,"value":493},"Sur les méthodes de gestion de projet, chez Malt nous bossons selon des mix de méthodes agiles. Certaines équipes travaillent sur des sprints d'une semaine, d'autres de 2 semaines, d'autres encore en kanban. C'est l'équipe qui choisit.",{"type":28,"tag":29,"props":495,"children":496},{},[497],{"type":33,"value":498},"La principale différence comme je le disais plus haut, les équipes ne sont pas colocalisées. Pour remplacer le standup meeting du matin, chacun le matin fait un point sur Slack sur son activité de la journée et ses difficultés du moment. L'avantage pour le coup c'est qu'on peut aussi suivre les daily des autres équipes si on le souhaite.",{"type":28,"tag":29,"props":500,"children":501},{},[502],{"type":33,"value":503},"On a aussi testé des outils de rétro à distance comme retrium. Mais dans l'ensemble, le télétravail n'a pas beaucoup d'impact sur ces aspects la.",{"type":28,"tag":29,"props":505,"children":506},{},[507],{"type":33,"value":508},"En terme de suivi des nouveaux arrivants nous avons mis en place un programme général avec des promos, une semaine complète de présentation de tous les métiers de la boite sur Paris.",{"type":28,"tag":29,"props":510,"children":511},{},[512],{"type":33,"value":513},"C'est finalement même bien plus efficace que ce qu'on retrouve dans beaucoup de boîtes \"traditionnelles\" en termes d’immersion.",{"type":28,"tag":29,"props":515,"children":516},{},[517],{"type":33,"value":518},"Ensuite selon les équipes cela peut varier. Plusieurs équipes fonctionnent avec relecture systématique (code review via des PR) pour justement mieux accueillir les nouveaux et partager plus rapidement les bons points d'entrée et bonnes pratiques déjà en place.",{"type":28,"tag":29,"props":520,"children":521},{},[522],{"type":33,"value":523},"Là où personnellement je trouve cela plus difficile, c'est le suivi individuel et les feedbacks. A distance, les feedbacks n'ont pas la même force qu'en direct car ils sont un peu plus déshumanisés. Les feedbacks positifs perdent en impact et les négatifs sont encore plus négatifs.",{"type":28,"tag":29,"props":525,"children":526},{},[527],{"type":33,"value":528},"Je tente donc de faire au maximum les feedbacks les plus importants en face à face. Mais pour ne pas perdre en spontanéité (un feedback fait trop longtemps après un évènement devient moins utile), j'utilise malgré tout la vidéo conf. Simplement il faut être conscient que c’est différent et adapter son discours.  ",{"type":28,"tag":29,"props":530,"children":531},{},[532],{"type":33,"value":533},"Parfois j'entends ou je lis des interrogations autour des juniors ou stagiaires dans le cadre du télétravail.",{"type":28,"tag":29,"props":535,"children":536},{},[537],{"type":33,"value":538},"Pourquoi cette question serait différente de celle du suivi des nouveaux arrivants me direz-vous ?",{"type":28,"tag":29,"props":540,"children":541},{},[542],{"type":33,"value":543},"Comme je le disais plus haut lorsque je parlais des habitudes individuelles, le changement vers le télétravail nécessite un grand travail sur soi et ses habitudes.",{"type":28,"tag":29,"props":545,"children":546},{},[547],{"type":33,"value":548},"Par définition, cela nécessite plus d'autonomie, une certaine rigueur personnelle. Et tout cela, c'est plus difficile quand on débute et qu'on doit tout apprendre. L'absence d'exemple direct, de mentor physique peut être un frein car on apprend beaucoup par mimétisme.",{"type":28,"tag":29,"props":550,"children":551},{},[552],{"type":33,"value":553},"Je ne m'étalerais pas vraiment sur ce point en particulier car personnellement je ne prends pas de stagiaire et très rarement des juniors, en partie car je ne pense pas savoir bien les encadrer. Mais il y a des stagiaires et juniors pris dans d’autres équipes.",{"type":28,"tag":29,"props":555,"children":556},{},[557],{"type":33,"value":558},"Autre question épineuse que j’entends parfois, “que faire si une personne semble beaucoup moins efficace à distance que sur place ?”",{"type":28,"tag":29,"props":560,"children":561},{},[562],{"type":33,"value":563},"Une personne n'est pas à l'abri de ne pas réussir à travailler correctement à distance. Ce n'est pas si simple et les distractions sont possibles.",{"type":28,"tag":29,"props":565,"children":566},{},[567],{"type":33,"value":568},"Contrairement à ce que certains peuvent croire, ça reste très rare.",{"type":28,"tag":29,"props":570,"children":571},{},[572],{"type":33,"value":573},"Soit on est au contraire plus efficace, soit on se rend compte tout seul qu'on préfère bosser ailleurs que chez soi.",{"type":28,"tag":29,"props":575,"children":576},{},[577],{"type":33,"value":578},"Le réflexe dans certaines boîtes pourrait aller",{"type":28,"tag":111,"props":580,"children":581},{},[582,587],{"type":28,"tag":115,"props":583,"children":584},{},[585],{"type":33,"value":586},"à la création de nouveaux moyens de contrôles plus intrusifs : webcam connecté en permanence, screenshots régulier, détecteur d'absence",{"type":28,"tag":115,"props":588,"children":589},{},[590],{"type":33,"value":591},"au fait de réserver le télétravail qu'à certaine personne.",{"type":28,"tag":29,"props":593,"children":594},{},[595],{"type":33,"value":596},"La première solution est évidemment totalement aberrante....",{"type":28,"tag":29,"props":598,"children":599},{},[600],{"type":33,"value":601},"La seconde solution me paraît également peu efficace. Dans le cas où cela arriverait, je ne différentie pas la performance \"sur place\" et \"à distance\".",{"type":28,"tag":29,"props":603,"children":604},{},[605],{"type":33,"value":606},"Si une personne a des soucis de performance/productivité/rigueur etc... c'est global, pas juste \"à distance\". Et c'est dans ces termes qu'il faut l'aborder avec celle-ci.",{"type":28,"tag":29,"props":608,"children":609},{},[610],{"type":33,"value":611},"En discutant de ces soucis de performance, la personne en question doit trouver les actions à mettre en place pour résoudre ce problème. Parfois elle décidera d'elle-même de réduire son télétravail le temps de trouver un rythme qui fonctionne.",{"type":28,"tag":29,"props":613,"children":614},{},[615],{"type":33,"value":616},"Si aucune amélioration ne se fait, n'allez pas croire qu'en supprimant le télétravail vous avez résolu quoi que ce soit, vous n'avez fait que déporter le problème. Si un problème de rigueur/concentration/sérieux existe, il existera partout.",{"type":28,"tag":618,"props":619,"children":621},"h2",{"id":620},"mais-tu-le-referais-si-tavais-le-choix",[622],{"type":33,"value":623},"Mais tu le referais si t’avais le choix ?",{"type":28,"tag":29,"props":625,"children":626},{},[627],{"type":33,"value":628},"J'ai tenté d'être objectif dans le traitement de ce sujet en donnant aussi les côtés difficiles. Mais je ne voudrais pas donner l'impression que c'est un mauvais choix. Bien au contraire, aujourd'hui nous vivons ce choix comme un véritable avantage. Nous avons une capacité à tacler des sujets ardus car nous avons la possibilité d'avoir un environnement de travail qui favorise la concentration sans négliger les échanges.",{"type":28,"tag":29,"props":630,"children":631},{},[632],{"type":33,"value":633},"Nous avons créé un environnement agréable pour travailler où chacun peut choisir son propre fonctionnement.",{"type":28,"tag":29,"props":635,"children":636},{},[637],{"type":33,"value":638},"Mais le télétravail n'est pas juste un tips qu'on met en place du jour au lendemain et qui va marcher sans rien changer aux habitudes. C'est un changement profond sur les méthodes de communication en place dans l'entreprise, sur la gestion d’équipe, sur les habitudes individuelles et rien ne garantit que ce qui marche chez nous marchera chez vous.",{"type":28,"tag":29,"props":640,"children":641},{},[642],{"type":33,"value":643},"De mon côté, malgré toutes les difficultés, les avantages font que je ne reviendrais pas sur ce choix.",{"title":7,"searchDepth":645,"depth":645,"links":646},2,[647,649,650,651,652],{"id":159,"depth":648,"text":162},3,{"id":249,"depth":648,"text":252},{"id":391,"depth":648,"text":394},{"id":480,"depth":648,"text":483},{"id":620,"depth":645,"text":623},"markdown","content:articles:2019:05:28:le-teletravail-chez-malt.md","content","articles/2019/05/28/le-teletravail-chez-malt.md","md",1699949732514]