[{"data":1,"prerenderedAt":556},["Reactive",2],{"/articles/2023/05/engineering-leadership":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"date":11,"tags":12,"cover":16,"book":17,"language":18,"alternates":19,"readingTime":22,"body":27,"_type":551,"_id":552,"_source":553,"_file":554,"_extension":555},"/articles/2023/05/engineering-leadership","05",false,"","Engineering Leadership","Le développement informatique est l’une des activités les plus collaboratives qui soit. Développer sa communication est crucial, d’autant plus pour répondre à un enjeu majeur : comment démultiplier son impact","20","2023-05-01",[13,14,15],"impact","product","engineering","leadership.jpg","impactfulSoftwareEngineering","fr",[20],{"en":21},"https://eventuallycoding.com/en/2023/05/engineering-leadership",{"text":23,"minutes":24,"time":25,"words":26},"9 min read",8.495,509700,1699,{"type":28,"children":29,"toc":542},"root",[30,38,43,48,53,66,71,78,83,99,104,109,114,119,134,146,159,174,179,184,195,209,215,220,225,230,235,240,253,258,263,268,273,278,283,289,300,314,319,324,336,342,347,352,357,362,421,426,456,462,467,472,477,482,488,520],{"type":31,"tag":32,"props":33,"children":34},"element","p",{},[35],{"type":36,"value":37},"text","Il y a quelques années, lors d’un meetup à Lyon je me rappelle avoir rencontré un jeune diplômé, appelons-le José, qui était intéressé par Malt. Il avait eu une manière surprenante d’entamer la discussion. Il me disait qu’il ne souhaitait pas trop parler et que son métier de toute façon ne nécessitait pas d’interactions, juste de coder. Autant dire qu’il ne m’avait pas totalement convaincu.",{"type":31,"tag":32,"props":39,"children":40},{},[41],{"type":36,"value":42},"Mais si José était sans doute très caricatural, il n’est pas unique.",{"type":31,"tag":32,"props":44,"children":45},{},[46],{"type":36,"value":47},"Pourtant, loin des clichés de “The social Network” ou la série “Silicon Valley” le développement informatique est une activité beaucoup plus sociale qu'il n'y paraît. Les équipes Produits des outils que vous utilisez régulièrement se comptent en centaines, voire milliers de personnes.",{"type":31,"tag":32,"props":49,"children":50},{},[51],{"type":36,"value":52},"Le développement informatique est l’une des activités les plus collaboratives qui soit. C’est un travail qui nécessite de bien comprendre les problèmes à résoudre, donc de parler avec de nombreux utilisateurs. C’est un travail qui nécessite de savoir prioriser, donc d’être dans les bonnes discussions pour avoir le contexte. L’activité même de développement est une activité qui implique de multiples discussions auprès des utilisateurs, du Product Manager, du business. Et bien sûr, c’est un travail d’équipe impliquant de nombreuses spécialités, front, back, ops, sécurité, data etc…",{"type":31,"tag":32,"props":54,"children":55},{},[56,58,64],{"type":36,"value":57},"Bref, ce n’est pas une activité solitaire, ce qui rend cette activité particulièrement complexe. Au-delà d'une nécessaire maîtrise individuelle, se pose une question majeure, comment apporter de l'impact dans un large groupe d'individus et même mieux, ",{"type":31,"tag":59,"props":60,"children":61},"strong",{},[62],{"type":36,"value":63},"comment démultiplier son impact",{"type":36,"value":65}," grâce au groupe ?",{"type":31,"tag":32,"props":67,"children":68},{},[69],{"type":36,"value":70},"A l'inverse, comment éviter que ce groupe parte dans toutes les directions et fasse mauvais usage de ces ressources ?",{"type":31,"tag":72,"props":73,"children":75},"h2",{"id":74},"le-leadership-une-autre-forme-de-management",[76],{"type":36,"value":77},"Le Leadership, une autre forme de management",{"type":31,"tag":32,"props":79,"children":80},{},[81],{"type":36,"value":82},"Une ambiguïté forte subsiste souvent quand on parle d’évoluer en tant que Senior.",{"type":31,"tag":32,"props":84,"children":85},{},[86,88,97],{"type":36,"value":87},"Pour quelques entreprises, le management est l’unique voie d’évolution pour un(e) Senior. L’idée étant que les Software Engineer les plus chevronné(e)s feront les meilleurs managers. De fait, elles perdent leurs contributeurs individuels les plus expérimentés pour les convertir à un autre métier sur lequel il n’y a aucune garantie que cela fonctionne. C'est le fameux ",{"type":31,"tag":89,"props":90,"children":94},"a",{"href":91,"rel":92},"https://fr.wikipedia.org/wiki/Principe_de_Peter",[93],"nofollow",[95],{"type":36,"value":96},"principe de Peter",{"type":36,"value":98},". Je ne m'éternise pas sur cette erreur, ce n’est pas le but de ce chapitre",{"type":31,"tag":32,"props":100,"children":101},{},[102],{"type":36,"value":103},"Mais, côté contributeurs individuels, il y a également un stéréotype persistant. Quelques personnes pensent qu’il y a les managers d’un côté, un rôle un peu flou qui sert à faire des réunions et remplir des fichiers excel, et les contributeurs individuels de l’autre côté, qui développent l’application.",{"type":31,"tag":32,"props":105,"children":106},{},[107],{"type":36,"value":108},"C’est très caricatural et cache une incompréhension du rôle de manager, d'une part.",{"type":31,"tag":32,"props":110,"children":111},{},[112],{"type":36,"value":113},"D'autre part, cela mène aussi à dénigrer les tâches assimilées à du management et penser qu’un(e) contributeur individuel ne doit jamais être impliqué dans ce type d’activités qui seraient par essence, moins nobles.",{"type":31,"tag":32,"props":115,"children":116},{},[117],{"type":36,"value":118},"Pourtant, si on reprend la définition du management de wikipedia :",{"type":31,"tag":120,"props":121,"children":122},"blockquote",{},[123],{"type":31,"tag":32,"props":124,"children":125},{},[126,128,132],{"type":36,"value":127},"Le management se définit comme l’ensemble des techniques d’organisation et de gestion pour conduire, piloter l’action des individus.",{"type":31,"tag":129,"props":130,"children":131},"br",{},[],{"type":36,"value":133},"\nWikipedia",{"type":31,"tag":32,"props":135,"children":136},{},[137,139,144],{"type":36,"value":138},"À partir de senior, pour créer plus d’impact, il faut développer sa capacité à présenter des solutions, argumenter et convaincre sur une stratégie, rassembler des personnes autour d’un objectif, coordonner des groupes de personnes, mesurer des résultats. Pour tout cela, il va falloir utiliser des compétences de management, ce qu’on peut regrouper sous le ",{"type":31,"tag":59,"props":140,"children":141},{},[142],{"type":36,"value":143},"leadership technique",{"type":36,"value":145},". On ne développe plus seulement une application, on commence à \"programmer\" une organisation.",{"type":31,"tag":147,"props":148,"children":149},"image",{},[150],{"type":31,"tag":32,"props":151,"children":152},{},[153],{"type":31,"tag":154,"props":155,"children":158},"img",{"alt":156,"src":157},"Coding the company","/images/coding-company.png",[],{"type":31,"tag":32,"props":160,"children":161},{},[162,164,167,169,172],{"type":36,"value":163},"Faire bien les choses est important.",{"type":31,"tag":129,"props":165,"children":166},{},[],{"type":36,"value":168},"\nFaire les bonnes choses est crucial.",{"type":31,"tag":129,"props":170,"children":171},{},[],{"type":36,"value":173},"\nFaire que tout le monde soit aligné sur les bonnes choses à faire est fondamental.",{"type":31,"tag":32,"props":175,"children":176},{},[177],{"type":36,"value":178},"Et malgré les apparences, c’est bien le rôle des contributeurs individuels quand il s’agit de design, d’architecture et de réalisation techniques complexes.",{"type":31,"tag":32,"props":180,"children":181},{},[182],{"type":36,"value":183},"Ce que je regroupe derrière le terme leadership est tellement important qu’il fait partie pour moi des deux barrières importantes, avec l’amélioration de la compréhension business, à débloquer pour dépasser le rôle de Senior et augmenter son impact dans une organisation.",{"type":31,"tag":147,"props":185,"children":186},{},[187],{"type":31,"tag":32,"props":188,"children":189},{},[190],{"type":31,"tag":154,"props":191,"children":194},{"alt":192,"src":193},"Career path showing that leadership needs new skills","/images/career-path-chasm.jpg",[],{"type":31,"tag":32,"props":196,"children":197},{},[198,200,207],{"type":36,"value":199},"On parle parfois de “",{"type":31,"tag":89,"props":201,"children":204},{"href":202,"rel":203},"https://www.adachen.com/the-leadership-chasm/",[93],[205],{"type":36,"value":206},"Leadership chasm",{"type":36,"value":208},"” : le fossé qu’il faut combler pour évoluer après le stade de Senior.",{"type":31,"tag":72,"props":210,"children":212},{"id":211},"développer-son-réseau",[213],{"type":36,"value":214},"Développer son réseau",{"type":31,"tag":32,"props":216,"children":217},{},[218],{"type":36,"value":219},"Développer son réseau revient à créer les bonnes conditions pour réussir à déplacer des groupes de personnes dans la même direction.",{"type":31,"tag":32,"props":221,"children":222},{},[223],{"type":36,"value":224},"Quand on parle de développer son réseau, j’entends parfois des personnes répondre qu’elles n’aiment pas faire de la politique.",{"type":31,"tag":32,"props":226,"children":227},{},[228],{"type":36,"value":229},"Je ne sais pas si “faire de la politique” a la même connotation négative dans tous les pays. Mais en France, c'est très souvent associé à de la manipulation dans le but de se procurer un avantage personnel.",{"type":31,"tag":32,"props":231,"children":232},{},[233],{"type":36,"value":234},"Alors effectivement, ne faites pas de la politique.",{"type":31,"tag":32,"props":236,"children":237},{},[238],{"type":36,"value":239},"Mais l'objectif ici, c'est d'utiliser l'effet de levier d'un groupe pour accomplir plus grand que ce qu'on réaliserait tout seul.",{"type":31,"tag":120,"props":241,"children":242},{},[243],{"type":31,"tag":32,"props":244,"children":245},{},[246,248,251],{"type":36,"value":247},"Tout seul on va plus vite, ensemble, on va plus loin",{"type":31,"tag":129,"props":249,"children":250},{},[],{"type":36,"value":252},"\nProverbe africain",{"type":31,"tag":32,"props":254,"children":255},{},[256],{"type":36,"value":257},"Il existe de multiples façons de construire ce réseau au sein d’une équipe produit.",{"type":31,"tag":32,"props":259,"children":260},{},[261],{"type":36,"value":262},"Vous pouvez par exemple être régulièrement disponible pour apporter de l’aide ou faire du travail en pair programming, lorsque des collègues en ont besoin.",{"type":31,"tag":32,"props":264,"children":265},{},[266],{"type":36,"value":267},"Vous avez la possibilité de faire du coaching ou du mentorat avec des personnes qui le souhaitent et/ou des nouveaux arrivants.",{"type":31,"tag":32,"props":269,"children":270},{},[271],{"type":36,"value":272},"Vous pouvez faire du transfert de connaissance via de la formation, des BBL, des REX (retour d’expériences).",{"type":31,"tag":32,"props":274,"children":275},{},[276],{"type":36,"value":277},"Cette liste n’est pas exhaustive, je n’inclus pas toutes les bonnes pratiques de travail en équipe (respect des délais, mises à jour régulières, communication claire etc…). Ce qui est important ici, c'est de susciter des échanges réguliers avec ces pairs, de comprendre les points de douleurs que l’équipe peut connaître, de travailler à améliorer la productivité globale.",{"type":31,"tag":32,"props":279,"children":280},{},[281],{"type":36,"value":282},"On évoque souvent les 10x developers, des personnes qui produisent 10x plus. Mais pour une personne Senior, l’objectif pour démultiplier son impact, c'est surtout de contribuer à créer des équipes 10x.",{"type":31,"tag":72,"props":284,"children":286},{"id":285},"un-réseau-élargi-dans-lentreprise",[287],{"type":36,"value":288},"Un réseau élargi dans l’entreprise",{"type":31,"tag":147,"props":290,"children":291},{},[292],{"type":31,"tag":32,"props":293,"children":294},{},[295],{"type":31,"tag":154,"props":296,"children":299},{"alt":297,"src":298},"Impact growing by circle","/images/circle-impact.png",[],{"type":31,"tag":32,"props":301,"children":302},{},[303,305,312],{"type":36,"value":304},"Je l’évoquais ",{"type":31,"tag":89,"props":306,"children":309},{"href":307,"rel":308},"https://eventuallycoding.com/2023/03/individual-impact#growing-impact-with-experience",[93],[310],{"type":36,"value":311},"dans un chapitre précédent",{"type":36,"value":313},", l’influence et l’impact que l’on peut avoir en tant que contributeur individuel doit dépasser le cercle de l’équipe produit. Pour cela il faut étendre son réseau, que ce soit à travers l’ensemble de l’entreprise ou en dehors.",{"type":31,"tag":32,"props":315,"children":316},{},[317],{"type":36,"value":318},"J’entends par là, faire du shadow (observer des personnes du support, ou des équipes commerciales), prendre le rôle d’une personne pendant une journée (le support s’y prête bien), et tout simplement participer à des discussions métiers avec les autres départements.",{"type":31,"tag":32,"props":320,"children":321},{},[322],{"type":36,"value":323},"José vous dirait sans doute que ces discussions ne lui sont pas naturelles. Il préfère rester dans des groupes qui partagent les mêmes codes, la même culture. C’est justement le point. Sortir de l’équipe Engineering est nécessaire pour construire une meilleure compréhension des problèmes que l’on doit et peut résoudre.",{"type":31,"tag":32,"props":325,"children":326},{},[327,329,334],{"type":36,"value":328},"Bien sûr, c’est compliqué, il faut apprendre de nouveaux jargons, de nouveaux codes. Mais c’est de cette façon qu’on peut développer son ",{"type":31,"tag":59,"props":330,"children":331},{},[332],{"type":36,"value":333},"empathie",{"type":36,"value":335}," : la capacité de s’identifier à l’autre, de comprendre comment il ou elle utilise votre produit, comment vous pourriez lui apporter de la valeur.\nEt ça va dans les deux sens.",{"type":31,"tag":72,"props":337,"children":339},{"id":338},"un-réseau-en-dehors-de-lentreprise",[340],{"type":36,"value":341},"Un réseau en dehors de l’entreprise",{"type":31,"tag":32,"props":343,"children":344},{},[345],{"type":36,"value":346},"Enfin, on peut étendre ce réseau de confiance en dehors de l’entreprise.",{"type":31,"tag":32,"props":348,"children":349},{},[350],{"type":36,"value":351},"Si je prends mon expérience personnelle, je blogue depuis 2006. Je suis impliqué dans les communautés depuis 2011 avec notamment des participations à l’organisation de Devoxx France, Blend Web Mix ou la création des Human Talks à Lyon. Actuellement je suis actif sur des channels slack comme Tech.rocks, Rands, ou FrenchProduit.\nIndirectement ces actions m’ont permis de rencontrer et de recruter de nombreuses personnes chez Malt et donc avoir un impact positif sur mon entreprise. L’avenir me dira si j’ai pu aussi avoir une influence positive sur l’écosystème dans lequel j’évolue.",{"type":31,"tag":32,"props":353,"children":354},{},[355],{"type":36,"value":356},"Mais si on pense surtout au recrutement, ce n’est pas le seul impact positif possible. Certains ont contribué à créer des formats, spécifications ou protocoles standards à l’ensemble de l’industrie.\nCette standardisation a pu permettre à leur entreprise un meilleur usage grâce à une plus forte interopérabilité et tout simplement de ne plus perdre autant de temps sur des sujets maintes fois réinventés par chaque acteur dans un même secteur.",{"type":31,"tag":32,"props":358,"children":359},{},[360],{"type":36,"value":361},"D’autres ont fait bénéficier leur entreprise de leur travail au sein d’une communauté et je vous propose de l’illustrer avec l’exemple de Florent et Olivier.",{"type":31,"tag":363,"props":364,"children":365},"example",{},[366,376,386,396,401,406,411,416],{"type":31,"tag":32,"props":367,"children":368},{},[369,374],{"type":31,"tag":59,"props":370,"children":371},{},[372],{"type":36,"value":373},"Date",{"type":36,"value":375}," : 2012",{"type":31,"tag":32,"props":377,"children":378},{},[379,384],{"type":31,"tag":59,"props":380,"children":381},{},[382],{"type":36,"value":383},"Acteurs",{"type":36,"value":385}," : Florent Biville et Olivier Girardot - Software engineer chez Lateral-Thoughts",{"type":31,"tag":32,"props":387,"children":388},{},[389,394],{"type":31,"tag":59,"props":390,"children":391},{},[392],{"type":36,"value":393},"Topic",{"type":36,"value":395}," : création de partenariat exclusif avec des éditeurs de logiciels",{"type":31,"tag":32,"props":397,"children":398},{},[399],{"type":36,"value":400},"Florent et Olivier étaient tous deux membres de Lateral-Thoughts en 2012, une petite société de conseil de 10 personnes.",{"type":31,"tag":32,"props":402,"children":403},{},[404],{"type":36,"value":405},"Chacun d’entre eux s’était appliqué à faire beaucoup de veille autour de Spark pour Olivier et Neo4j pour Florent.\nDe fil en aiguille, ils ont blogué, participé à des conférences, des ateliers et se sont construits un réseau autour de cette expertise.",{"type":31,"tag":32,"props":407,"children":408},{},[409],{"type":36,"value":410},"Ce réseau en retour leur a permis d’entrer en contact avec les éditeurs des logiciels Spark et Neo4j. Et ces éditeurs ont tous deux choisi de créer un partenariat exclusif Européen pour la formation et le conseil avec Lateral-Thoughts.",{"type":31,"tag":32,"props":412,"children":413},{},[414],{"type":36,"value":415},"Et voici comment Florent et Olivier ont su créer un réseau de confiance et, via ce réseau, nouer un partenariat entre des éditeurs internationaux et leur société, pourtant pas plus grande que 10 personnes. Bref, ils ont créé de l’impact pour leur entreprise, voire pour l’industrie en contribuant à étendre l’usage de ces softs en Europe au début des années 2010.",{"type":31,"tag":32,"props":417,"children":418},{},[419],{"type":36,"value":420},"Pour l’anecdote, Florent travaille aujourd'hui pour la société Neo4j.",{"type":31,"tag":32,"props":422,"children":423},{},[424],{"type":36,"value":425},"Ce chapitre est le premier d'un gros morceau autour du leadership.\nSi je suis bien conscient qu'il n'existe pas une seule façon de faire les choses, j'aimerais exposer dans les prochains chapitres les principes qui sont communs à de nombreuses organisations efficaces :",{"type":31,"tag":427,"props":428,"children":429},"ul",{},[430,436,441,446,451],{"type":31,"tag":431,"props":432,"children":433},"li",{},[434],{"type":36,"value":435},"Hard leadership vs soft leadership",{"type":31,"tag":431,"props":437,"children":438},{},[439],{"type":36,"value":440},"La notion d'équipes autonomes (empowered teams)",{"type":31,"tag":431,"props":442,"children":443},{},[444],{"type":36,"value":445},"Qu'est-ce qu'une vision technique et comment la créer",{"type":31,"tag":431,"props":447,"children":448},{},[449],{"type":36,"value":450},"L'alignement par le contexte",{"type":31,"tag":431,"props":452,"children":453},{},[454],{"type":36,"value":455},"La notion d'équipe 10x",{"type":31,"tag":72,"props":457,"children":459},{"id":458},"questions",[460],{"type":36,"value":461},"Questions",{"type":31,"tag":32,"props":463,"children":464},{},[465],{"type":36,"value":466},"Diriez-vous que vous êtes moteur sur l’organisation de la stratégie technologique ? C'est-à-dire que vous êtes à l’initiative des groupes de discussion, que vous listez les actions à faire, que vous surveillez les plannings, fixez les objectifs et faites le suivi ? Ou bien est-ce uniquement de la responsabilité des managers ?",{"type":31,"tag":32,"props":468,"children":469},{},[470],{"type":36,"value":471},"Quelle est la dernière fois que vous avez eu une discussion avec des personnes d’autres équipes que la vôtre, au sein du produit, mais aussi avec le marketing, les équipes de vente, le support client… ?",{"type":31,"tag":32,"props":473,"children":474},{},[475],{"type":36,"value":476},"Avez-vous récemment passé une journée avec une autre équipe pour les regarder travailler sur les produits que vous développez ?",{"type":31,"tag":32,"props":478,"children":479},{},[480],{"type":36,"value":481},"Avez-vous tenté d’endosser le rôle d’une personne au support client, ou dans l’équipe de test ?",{"type":31,"tag":72,"props":483,"children":485},{"id":484},"ressources",[486],{"type":36,"value":487},"Ressources",{"type":31,"tag":427,"props":489,"children":490},{},[491,500,510],{"type":31,"tag":431,"props":492,"children":493},{},[494],{"type":31,"tag":89,"props":495,"children":497},{"href":202,"rel":496},[93],[498],{"type":36,"value":499},"The Leadership Chasm",{"type":31,"tag":431,"props":501,"children":502},{},[503],{"type":31,"tag":89,"props":504,"children":507},{"href":505,"rel":506},"https://www.infoworld.com/article/3691015/from-the-10x-developer-to-the-10x-team.html",[93],[508],{"type":36,"value":509},"From the 10x developer to the 10x team",{"type":31,"tag":431,"props":511,"children":512},{},[513],{"type":31,"tag":89,"props":514,"children":517},{"href":515,"rel":516},"https://andela.com/insights/manage/build-10x-team/",[93],[518],{"type":36,"value":519},"Build 10x teams",{"type":31,"tag":521,"props":522,"children":523},"tip",{},[524],{"type":31,"tag":32,"props":525,"children":526},{},[527,529,535,537,540],{"type":36,"value":528},"Ce billet de blog fait partie du livre ",{"type":31,"tag":89,"props":530,"children":532},{"href":531},"/2023/02/impactful-software-engineering",[533],{"type":36,"value":534},"Impactful Software Engineering",{"type":36,"value":536},".",{"type":31,"tag":129,"props":538,"children":539},{},[],{"type":36,"value":541},"\nN'hésitez pas à lire les autres chapitres.",{"title":7,"searchDepth":543,"depth":543,"links":544},2,[545,546,547,548,549,550],{"id":74,"depth":543,"text":77},{"id":211,"depth":543,"text":214},{"id":285,"depth":543,"text":288},{"id":338,"depth":543,"text":341},{"id":458,"depth":543,"text":461},{"id":484,"depth":543,"text":487},"markdown","content:articles:2023:05:engineering-leadership.md","content","articles/2023/05/engineering-leadership.md","md",1707915847714]