[{"data":1,"prerenderedAt":221},["Reactive",2],{"/articles/2014/04/21/devoxx-france-2014":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"date":11,"categories":12,"tags":14,"cover":16,"readingTime":17,"body":22,"_type":216,"_id":217,"_source":218,"_file":219,"_extension":220},"/articles/2014/04/21/devoxx-france-2014","21",false,"","Devoxx France 2014","[![devoxxfr](/images/31dab-devoxxfr.jpg)](http://eventuallycoding.com/wp-content/uploads/2014/04/31dab-devoxxfr.jpg)Et voilà, 3ème édition de Devoxx F...","1076","2014-04-21",[13],"waza",[15],"devoxx","31dab-devoxxfr.jpg",{"text":18,"minutes":19,"time":20,"words":21},"8 min read",7.02,421200,1404,{"type":23,"children":24,"toc":213},"root",[25,46,51,56,61,76,89,94,117,122,135,140,145,150,155,160,165,203,208],{"type":26,"tag":27,"props":28,"children":29},"element","p",{},[30,43],{"type":26,"tag":31,"props":32,"children":36},"a",{"href":33,"rel":34},"http://eventuallycoding.com/wp-content/uploads/2014/04/31dab-devoxxfr.jpg",[35],"nofollow",[37],{"type":26,"tag":38,"props":39,"children":42},"img",{"alt":40,"src":41},"devoxxfr","/images/31dab-devoxxfr.jpg",[],{"type":44,"value":45},"text","Et voilà, 3ème édition de Devoxx France terminée et ce ne fut pas de tout repos. 3 jours, 1500 personnes, des heures et des heures de concentration (ou pas). Personnellement j'étais déjà bien fatigué après le premier jour et j'ai encore du mal à comprendre comment font ceux qui assistent à Devoxx Belgique sur 5 jours :)",{"type":26,"tag":27,"props":47,"children":48},{},[49],{"type":44,"value":50},"Dans l'ensemble, c'est toujours positif de venir et je ne saurais que trop conseiller cette conférence à tout développeur qui se poserait la question. Merci aux organisateurs pour ce contenu de qualité.",{"type":26,"tag":27,"props":52,"children":53},{},[54],{"type":44,"value":55},"Et en fait, c'est tellement de qualité qu'il en est devenu difficile de se faire un programme. Problème de riche me direz-vous, et vous auriez raison. Je me rappelle de What's Next en 2011, qui était une très bonne conf par ailleurs, on ne se posait pas la question du choix de la conf à regarder, il n'y avait qu'une salle. A Devoxx c'est 6 salles plus des espaces additionnels (Hackaton, Code Story, les mercenaires du Devops etc...) ! Déjà la difficulté va être différente en fonction du nombre de jour de présence. Si vous venez 3 jours, vous savez que vous raterez quelques créneaux horaires pour vous reposer et vous prendrez quelques risques sur vos choix en espérant être surpris. Si vous venez une seule journée, vous avez intérêt à prendre des contenus \"sûrs\".",{"type":26,"tag":27,"props":57,"children":58},{},[59],{"type":44,"value":60},"Déjà si vous ne veniez que le jeudi ou vendredi, il y avait un passage obligé : les keynotes. Et là malheureusement, je n'ai pas trouvé le cru transcendant cette année. Le thème 2014 était \"Born to be\", une déclinaison du thème autour de l'éducation et l'apprentissage. On a eu le droit entre autre à un laius sur l'éducation via... un représentant de l'école 42, désolé j'ai peu adhéré. Dommage, sur ce thème il y avait beaucoup à dire. Par exemple le chiffre de 38_000 chomeurs a été évoqué, et personne n'a vraiment parlé de la formation pour adultes ou du compagnonage. Je note cependant deux keynotes au dessus des autres :",{"type":26,"tag":62,"props":63,"children":64},"ul",{},[65,71],{"type":26,"tag":66,"props":67,"children":68},"li",{},[69],{"type":44,"value":70},"simplon.co, jeune boîte qui tente d'inculquer des rudiments d'informatique à des personnes de tous âges et de tous milieux",{"type":26,"tag":66,"props":72,"children":73},{},[74],{"type":44,"value":75},"la keynote de Geert Bevin, un peu étrange, qui parlait de... Je ne sais pas bien mais c'était sympa. Si bon en fait fallait trouver sa vague et la surfer, je vous conseille la vidéo je serais mauvais pour résumer.",{"type":26,"tag":27,"props":77,"children":78},{},[79,81,87],{"type":44,"value":80},"Quitte à continuer sur un point négatif, j'ai trouvé que, dans l'ensemble, les stands étaient moins funs que les années précédentes :) Ca se résume en moins de jeux concours, pas de baby foot, moins de démo de trucs qui tuent. Certains stands on sentait l'ennui du seul gars obligé d'être là avec sa pile de prospectus... Un petit effort pour l'année prochaine les gars, si vous payez un slot sponsor à Devoxx France venez nous présenter autre chose que des plaquettes de pub sur vos stands... Une boite dont je tairais le nom m'a un peu déçu sur sa stratégie \"",{"type":26,"tag":82,"props":83,"children":84},"em",{},[85],{"type":44,"value":86},"jeunes femmes qui doit attirer du geek",{"type":44,"value":88},"\"... Elle m'avait habitué à mieux. Bon mais certains sortaient du lot : PS3 sur le stand de PaloIT, Oracle et son jeu d'échec avec bras mécanique (ok, dis comme ça ca semble inutile et ca l'est surement), Google qui abandonne le stand traditionnel pour faire café, Ippon qui reste dans la tradition culinaire pour filer des yaourt glacés pas mauvais du tout (l'année dernière c'était sushi), et tout ceux qui ont proposé tireuse à bière, popcorn, t-shirts etc... Si je peux me permettre par contre, à filer de la bouffe, et si on innovait en évitant de filer des sucreries ? Du bio ? Des fruits ?",{"type":26,"tag":27,"props":90,"children":91},{},[92],{"type":44,"value":93},"Bon, et les confs alors ? J'avoue que je deviens de plus en plus difficile année après année. En général, j'ai un ratio de 1 bon choix pour 5 créneaux horaires. Quelques éléments qui me déçoivent :",{"type":26,"tag":62,"props":95,"children":96},{},[97,102,107,112],{"type":26,"tag":66,"props":98,"children":99},{},[100],{"type":44,"value":101},"un titre qui n'a rien à voir avec le contenu. C'est devenu trop courant, sans doute pour vendre auprès du CFP.",{"type":26,"tag":66,"props":103,"children":104},{},[105],{"type":44,"value":106},"trop de métier imbriqué avec du technique, c'est fouillis.",{"type":26,"tag":66,"props":108,"children":109},{},[110],{"type":44,"value":111},"manque de rythme, trop de temps passé sur des points inintéressants",{"type":26,"tag":66,"props":113,"children":114},{},[115],{"type":44,"value":116},"soit trop débutant (merci j'ai déjà lu les tutos), soit pas assez",{"type":26,"tag":27,"props":118,"children":119},{},[120],{"type":44,"value":121},"Concernant le rythme, je préfère de plus en plus les formats \"Quickie\" et \"Tools in action\". Je trouve que les gens se dispersent moins sur les \"Tools In Action\" et au pire c'est moins long à supporter. Mesdames et messieurs les conférenciers, quelques conseils par rapport au rythme :",{"type":26,"tag":62,"props":123,"children":124},{},[125,130],{"type":26,"tag":66,"props":126,"children":127},{},[128],{"type":44,"value":129},"si votre contenu est malgré tout bien taillé pour une conférence, épurez quand même et entrainez vous en regardant \"rapido\" avec Antoine De Caunes :)",{"type":26,"tag":66,"props":131,"children":132},{},[133],{"type":44,"value":134},"si vous pensez avoir un contenu d'une heure, postulez pour un Tools In Action et épurez. Si vous pensez avoir un contenu de 3h... Posez vous des questions (ou alors vous êtes peut être José Paumard et ca passera très bien).",{"type":26,"tag":27,"props":136,"children":137},{},[138],{"type":44,"value":139},"Bon ok, du coup le nom \"Tools In Action\" pourrait perdre son sens. Et bien renommons le dans ce cas \"Small Conference\".",{"type":26,"tag":27,"props":141,"children":142},{},[143],{"type":44,"value":144},"Mesdames et messieurs organisateurs, et pourquoi pas des \"Small Conference\" sur les jeudi/vendredi ? 2 SC à la place d'une conf, sur certains créneaux ca passe avec les pauses. Ou alors vous réduisez le format sur 20/25 minutes pour vous adapter aux créneaux.",{"type":26,"tag":27,"props":146,"children":147},{},[148],{"type":44,"value":149},"Mesdames et messieurs les participants, quand une conf vous déplait, barrez vous rapidement (mais discretement), par contre si vous pouviez éviter de tous vous barrer pendant les sessions de questions-réponses ?",{"type":26,"tag":27,"props":151,"children":152},{},[153],{"type":44,"value":154},"Concernant les thèmes, certains ont dit avant la conf qu'il y avait trop de tracks différentes. Je ne partage pas cet avis. C'est notre métier qui veut ça et avec 6 salles en parralèle on n'est pas coincé de toute façon. Ca n'empêche pas de regarder l'affluence pour vérifier que certaines conf étaient vraiment nécessaires (comme celles sur IOS qui ont été vide apparemment).",{"type":26,"tag":27,"props":156,"children":157},{},[158],{"type":44,"value":159},"Et dans le détail, la seule conf que j'ai adoré - extremist programming par E. Ardant et C. Martraire Juste énorme, du délire en barre mais avec du fond quand on y regardait de plus près. Il faut quelques ovnis comme celle-ci.",{"type":26,"tag":27,"props":161,"children":162},{},[163],{"type":44,"value":164},"J'ai apprécié également la conf sur les S3I par nos amis RH. Ok, certains pourraient penser que c'est paradoxal de dire d'un côté \"prenez-vous en main, votre carrière dépend de vous\" et de l'autre \"les RH dans les S3I doivent être au service de votre carrière\". Par contre le bilan sur les SSII était très bon et l'alternative freelance était bien abordé. Les confs que je regrette d'avoir raté au vu des retours des participants :",{"type":26,"tag":62,"props":166,"children":167},{},[168,173,178,183,188,193,198],{"type":26,"tag":66,"props":169,"children":170},{},[171],{"type":44,"value":172},"HA proxy par Nicolas Helleringer",{"type":26,"tag":66,"props":174,"children":175},{},[176],{"type":44,"value":177},"une conf qui n'était pas marqué dans le programme papier à la place de celle de Zach Hollman",{"type":26,"tag":66,"props":179,"children":180},{},[181],{"type":44,"value":182},"la conf de Bortzmeyer sur TLS",{"type":26,"tag":66,"props":184,"children":185},{},[186],{"type":44,"value":187},"la conf de Sebastien Deleuze sur Spring4 Angular Dart et WS",{"type":26,"tag":66,"props":189,"children":190},{},[191],{"type":44,"value":192},"la conf sur les bitcoins par Grégory Paul",{"type":26,"tag":66,"props":194,"children":195},{},[196],{"type":44,"value":197},"la conf de Xavier Hanin sur RestX",{"type":26,"tag":66,"props":199,"children":200},{},[201],{"type":44,"value":202},"le quickie sur git deliver",{"type":26,"tag":27,"props":204,"children":205},{},[206],{"type":44,"value":207},"Bon maintenant je vais citer des confs que je regrette car elles auraient pu être bien. Si je les cite alors que je ne cite pas plein d'autres confs que je n'ai pas apprécié, c'est qu'elles avaient un super potentiel, des gens que j'apprécie qui les présentaient et je suis sûr qu'elles pourraient être terrible : - Developper en mode kick ass Vraiment dommage. Je savais que j'apprendrais peu sur ce type de conf, donc je m'attendais à du gros délire. Sur un sujet de ce type, faut pas hésiter à se lâcher.",{"type":26,"tag":27,"props":209,"children":210},{},[211],{"type":44,"value":212},"- Web Performance Bon soyons clair, comparer plusieurs stacks web sur le seul angle de la perf c'est déjà casse gueule . Dire \"on voulait être proche d'un cas réel car les autres ne font pas ça\" et se passer de bases de données, avoir un seul appel REST sur des technos pas toujours maitrisées, ca sentait le fail. Mais soyons clair, je ne m'attendais pas à un truc sérieux. En fait, je souhaitais que cela ne le soit pas. J'attendais clairement une conf second degré, de la vanne qui fuse, du trolling et des poneys. A part quelques blagues de Nicolas Leroux et quelques trolls de Rémi Forax, je suis un peu resté sur ma faim. C'était un concours de \"qui a la plus grosse\", franchement fallait assumer jusqu'au bout. Dommage. Et maintenant, à l'année prochaine ! Car pour sûr j'y retournerais même si vous avez pu lire quelques critiques au dessus. Devoxx c'est une conférence mais c'est aussi plein de rencontres, un lieu d'échange et de remotivation et il ne faut pas le rater. Cette fois ce sera au palais des Congrés, ça promet !",{"title":7,"searchDepth":214,"depth":214,"links":215},2,[],"markdown","content:articles:2014:04:21:devoxx-france-2014.md","content","articles/2014/04/21/devoxx-france-2014.md","md",1700650412038]