[{"data":1,"prerenderedAt":184},["Reactive",2],{"/articles/2018/05/26/we-are-not-done-yet":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"date":11,"categories":12,"tags":14,"cover":17,"readingTime":18,"body":23,"_type":179,"_id":180,"_source":181,"_file":182,"_extension":183},"/articles/2018/05/26/we-are-not-done-yet","26",false,"","We are not done yet","[![](/images/475f8-keep-calm-it-s-not-done-yet1.png)](http://eventuallycoding.com/wp-content/uploads/2018/05/475f8-keep-calm-it-s-not-done-yet1.png)\n...","1357","2018-05-26",[13],"waza",[15,16],"malt","startup","475f8-keep-calm-it-s-not-done-yet1.png",{"text":19,"minutes":20,"time":21,"words":22},"7 min read",6.795,407700,1359,{"type":24,"children":25,"toc":176},"root",[26,34,39,44,49,54,59,64,80,89,94,99,107,112,117,130,153,158,163],{"type":27,"tag":28,"props":29,"children":30},"element","p",{},[31],{"type":32,"value":33},"text","Chez Malt nous sommes constamment en recrutement et je fais passer des entretiens très très régulièrement. Il y a une chose que je répète à chaque candidat car cela reflète une qualité essentielle que nous recherchons et j'aimerais le partager ici et l'étoffer.",{"type":27,"tag":28,"props":35,"children":36},{},[37],{"type":32,"value":38},"Dans les 2 premières minutes de l'entretien, je rappelle rapidement ce que nous sommes et j'insiste sur un point. Chaque année Malt a doublé de taille. Chaque année notre environnement de travail, les personnes avec qui nous travaillons, nos rôles ont changé.",{"type":27,"tag":28,"props":40,"children":41},{},[42],{"type":32,"value":43},"Alors évidemment je ne raconte pas toute l'histoire aux candidats. Mais j'aime leur décrire à quel point nous avons beaucoup d'idées, que la boite telle qu'ils ou elles la voient aujourd'hui va encore beaucoup changer. Malt pour une personne qui vient chez nous ce n'est pas une certitude de confort, un train train. C'est être dans une organisation qui évolue constamment. Et pour cela, il y a une qualité importante, être capable de se réinventer, de s'adapter, de se remettre en cause. Oh oui, savoir se remettre en cause. Et à force d'en parler j'ai eu envie de le partager ici dans ce billet.",{"type":27,"tag":28,"props":45,"children":46},{},[47],{"type":32,"value":48},"En 2012 Malt c'est juste une idée et 3 personnes qui en discutent. En 2013 c'est une version béta, deux personnes qui bossent dessus à temps plein mais pour moi c'est un rôle de développement en mode side project du soir et week end. Ce n'est qu'en 2014 que je travaillerais à temps plein sur le projet avec un rôle de \"CTO\", dit autrement, le dev à tout faire de l'équipe avec JB, lui aussi co fondateur et co-CTO. Aucun de nous ne prend très au sérieux ce titre de CTO, CTO de nous-mêmes. A ce moment je suis juste un dev qui essaie de bien faire son boulot, gérer la dette technique, savoir quand aller vite et adopter un certain pragmatisme, savoir quand aller moins vite pour faire les choses bien, se planter aussi, souvent, mais poursuivre. C'est aussi des nouveautés, discuter de référencement, de communication, de stratégie commerciale, de tarification, des évolutions du produit. Beaucoup d'idées mais avec un paradoxe exaspérant : plus on en parle, moins on a le temps de le faire. C'était il y a 4 ans.",{"type":27,"tag":28,"props":50,"children":51},{},[52],{"type":32,"value":53},"Et puis Malt est monté progressivement à 10 personnes. On ne se représente pas toujours facilement ce que c'est. De nouveaux métiers, de nouvelles cultures qu'on ne connait pas. Tiens c'est quoi le community management ? Le traffic management ? C'est des nouvelles interactions, une autre posture à adopter, son propre métier qui évolue. De 10 l'équipe est passé ensuite à 20, puis 30, 40, 50 et aujourd'hui 70 (regardez bien la date de ce billet, il y a de fortes chances qu'on ne soit plus ce nombre là passé cette date). A chaque fois, pour reprendre la formule consacrée, vous devez vous virer vous-mêmes et trouver des personnes meilleures que vous. Et même à 70, toujours le même paradoxe, il faut savoir gérer l'équilibre entre trouver de nouvelles idées, améliorer les anciennes et prendre le temps de réaliser tout cela. C'est une lutte constante entre court terme et long terme, entre vos difficultés quotidiennes et la vision vers laquelle vous voulez aller mais qui demande du temps.",{"type":27,"tag":28,"props":55,"children":56},{},[57],{"type":32,"value":58},"Chaque étape a ses propres défis. Doubler les équipes chaque année, chercher une équipe qui va nous représenter dans un autre pays, trouver les bons partenaires, gérer les sollicitations extérieures, aider les personnes dans l'organisation à trouver leur place. C'est amusant mais parfois on oublie le chemin parcouru. On oublie qu'on a tourné sur une seule machine en production de 2014 à 2017, machine qui contenait RabbitMq, Mongo, Redis, Elasticsearch et toutes les applis. On oublie que notre seul CRM a été pendant longtemps un truc bricolé en quelques mois vers 2013 et qui a été utilisé jusqu'encore très récemment. On oublie que nous avons fait pendant longtemps une modération manuelle de tout les messages de la plateforme avant d'automatiser (même si c'est encore perfectible). On oublie toutes les modifications directes en bases de données pour corriger des cas de support aujourd'hui résolvables automatiquement par un administrateur. On oublie que pendant un long moment on tenait dans une seule pièce à Paris et que je bossais dans un (super) coworking à Lyon. On oublie tout ces moments où une équipe est passé d'une seule personne à deux, puis trois, puis... ce qui a considérablement changé les échanges, les dynamiques. On oublie que l'équipe produit c'était juste 2 devs pendant longtemps, que son premier product manager c'est 2015 mais qu'il galérait bien avec tellement de sujets à traiter pour une si petite équipe.",{"type":27,"tag":28,"props":60,"children":61},{},[62],{"type":32,"value":63},"Et j'en passe. Ce ne sont que quelques anecdotes.",{"type":27,"tag":28,"props":65,"children":66},{},[67,69,78],{"type":32,"value":68},"C'est amusant car malgré cette expérience, malgré le fait que chaque étape de notre croissance a entrainé des changements, on se retrouve parfois à se recréer une petite zone de confort, des petites habitudes sur quelques mois. C'est exactement l'histoire ",{"type":27,"tag":70,"props":71,"children":75},"a",{"href":72,"rel":73},"https://fr.wikipedia.org/wiki/Fable_de_la_grenouille",[74],"nofollow",[76],{"type":32,"value":77},"de la fable de la grenouille",{"type":32,"value":79},".",{"type":27,"tag":81,"props":82,"children":83},"blockquote",{},[84],{"type":27,"tag":28,"props":85,"children":86},{},[87],{"type":32,"value":88},"Si l'on plonge subitement une grenouille dans de l'eau chaude, elle s'échappe d'un bond ; alors que si on la plonge dans l'eau froide et qu'on porte très progressivement l'eau à ébullition, la grenouille s'engourdit ou s'habitue à la température pour finir ébouillantée.",{"type":27,"tag":28,"props":90,"children":91},{},[92],{"type":32,"value":93},"La grenouille ici c'est nous. Si on n'y prend pas garde on s'endort dans une eau qui chauffe et tout d'un coup le réveil est difficile. Il faut réagir, se réinventer, changer des choses car ce qui fonctionnait 6 mois plus tôt ne fonctionne plus. Le contexte a changé, les exigences autour de vous ont changé. Aux early adopters du début vous avez désormais des \"haters\" à gérer, votre volume de données à explosé, vous avez des arrivées mais aussi des départs. J'y reviens encore, il faut se remettre en cause, c'est un travail constant et si on n'y fais pas attention, c'est quelqu'un ou quelque chose qui finira par vous le rappeler, pas toujours en douceur.",{"type":27,"tag":28,"props":95,"children":96},{},[97],{"type":32,"value":98},"Il y a peu j'ai eu la chance d'aller visiter San Francisco et rencontrer de nombreuses boîtes sur place. Notamment nous avons vu les locaux de Facebook. Le campus se trouve sur l'emplacement de l'ancien campus de Sun. Lorsqu'on rentre il y a un panneau à l'entrée. Et derrière ce panneau on trouve l'ancien panneau de Sun.",{"type":27,"tag":28,"props":100,"children":101},{},[102],{"type":27,"tag":103,"props":104,"children":106},"img",{"alt":7,"src":105},"/images/f0d11-facebook-_sign.jpg",[],{"type":27,"tag":28,"props":108,"children":109},{},[110],{"type":32,"value":111},"Il y a une raison d'avoir gardé ce panneau.",{"type":27,"tag":28,"props":113,"children":114},{},[115],{"type":32,"value":116},"Le logo de Sun rappelle à tout les employés ce qui peut arriver lorsqu'on oublie de se réinventer. Rien n'est acquis.",{"type":27,"tag":28,"props":118,"children":119},{},[120,122,128],{"type":32,"value":121},"Me concernant c'est une constante remise en cause. Je suis en recherche perpétuelle d'équilibre entre le fait que j'aime toujours coder, le mentorat que je peux apporter, la vision à laquelle je contribue, sur le produit, la stratégie, les choses désagréables qu'il faut aussi faire parfois. Et toujours comme il y a 4 ans mais sur de bien plus nombreux sujets : \"",{"type":27,"tag":123,"props":124,"children":125},"em",{},[126],{"type":32,"value":127},"savoir quand aller vite et adopter un certain pragmatisme, savoir quand aller moins vite pour faire les choses bien, se planter aussi, souvent, mais poursuivre",{"type":32,"value":129},"\".",{"type":27,"tag":28,"props":131,"children":132},{},[133,135,142,144,151],{"type":32,"value":134},"Au delà du savoir faire, c'est aussi une remise en cause de mon savoir-être, pas le point le plus simple pour moi. Comme beaucoup de dev j'ai une culture tech, hérité pour ma part de Lateral-thoughts, des conférences tech, des communautés open source, des bouquins tels que ",{"type":27,"tag":70,"props":136,"children":139},{"href":137,"rel":138},"https://en.wikipedia.org/wiki/The_Pragmatic_Programmer",[74],[140],{"type":32,"value":141},"Pragmatic programmer",{"type":32,"value":143},", ",{"type":27,"tag":70,"props":145,"children":148},{"href":146,"rel":147},"https://basecamp.com/books/rework",[74],[149],{"type":32,"value":150},"Rework",{"type":32,"value":152},", des règles de références tels que \"don't let a broken window\", \"le boy scout\" etc... Mais bosser avec autant de personnes et métiers différents c'est prendre conscience de la pluralité des cultures, des références, des approches et des sensibilités différentes. C'est se rendre compte qu'il n'y a pas qu'un seul chemin pour résoudre le même problème. Oh oui, être dev c'est avoir beaucoup de qualités mais je vous le garantis, des défauts tout aussi nombreux.",{"type":27,"tag":28,"props":154,"children":155},{},[156],{"type":32,"value":157},"Alors il ne faut pas s'y tromper, il y a des difficultés mais c'est aussi sacrément intéressant. On apprend de nombreux métiers, on est rejoint par de supers personnes qui apportent tous quelque chose, c'est une stimulation à chaque instant. Et vous savez quoi ? Finalement vous cultivez même une insatisfaction à ne pas aller encore plus vite.",{"type":27,"tag":28,"props":159,"children":160},{},[161],{"type":32,"value":162},"Et nous ne sommes pas encore arrivés. Il reste un sacré chemin avant d'avoir fait tout ce que nous voulons faire.",{"type":27,"tag":28,"props":164,"children":165},{},[166,168,175],{"type":32,"value":167},"PS : envie de participer à l'aventure ? ",{"type":27,"tag":70,"props":169,"children":172},{"href":170,"rel":171},"https://www.welcometothejungle.co/companies/malt/jobs",[74],[173],{"type":32,"value":174},"Jette un œil ici",{"type":32,"value":79},{"title":7,"searchDepth":177,"depth":177,"links":178},2,[],"markdown","content:articles:2018:05:26:we-are-not-done-yet.md","content","articles/2018/05/26/we-are-not-done-yet.md","md",1699824932912]