[{"data":1,"prerenderedAt":226},["Reactive",2],{"/articles/2015/10/13/siffler-en-teletravaillant":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"date":11,"categories":12,"tags":14,"img":18,"cover":19,"readingTime":20,"body":25,"_type":221,"_id":222,"_source":223,"_file":224,"_extension":225},"/articles/2015/10/13/siffler-en-teletravaillant","13",false,"","Siffler en télétravaillant","[![6f95cc57e9fd19cc8139863326c29067[1]](/images/b6856-6f95cc57e9fd19cc8139863326c290671.jpg)](http://eventuallycoding.com/wp-content/uploads/2015/10/b...","1211","2015-10-13",[13],"waza",[15,16,17],"malt","product","remote","b6856-6f95cc57e9fd19cc8139863326c290671.jpg","cover4.jpg",{"text":21,"minutes":22,"time":23,"words":24},"6 min read",5.22,313200,1044,{"type":26,"children":27,"toc":213},"root",[28,46,61,68,73,78,98,112,118,123,156,161,167,172,178,183,189,203,208],{"type":29,"tag":30,"props":31,"children":32},"element","p",{},[33],{"type":29,"tag":34,"props":35,"children":39},"a",{"href":36,"rel":37},"http://eventuallycoding.com/wp-content/uploads/2015/10/b6856-6f95cc57e9fd19cc8139863326c290671.jpg",[38],"nofollow",[40],{"type":29,"tag":41,"props":42,"children":45},"img",{"alt":43,"src":44},"6f95cc57e9fd19cc8139863326c290671","/images/b6856-6f95cc57e9fd19cc8139863326c290671.jpg",[],{"type":29,"tag":30,"props":47,"children":48},{},[49,52,59],{"type":50,"value":51},"text","Cela fait désormais un an et quatre mois que je suis à temps plein sur ",{"type":29,"tag":34,"props":53,"children":56},{"href":54,"rel":55},"http://www.hopwork.fr",[38],[57],{"type":50,"value":58},"Hopwork",{"type":50,"value":60},". Sur cette période nous avons fait deux levées de fonds successives et l'équipe compte désormais une vingtaine de personnes, plus si on compte les freelances qui bossent pour nous de temps en temps. Tout cela est dingue et excitant à la fois. A l'origine, quand je suis en mesure de travailler à 100% sur Hopwork en Avril 2014 je me retrouve seul à Lyon, nous comptons une personne à Bordeaux, une personne à Toulouse et le reste de l'équipe à Paris. Nous avons dans l'esprit de créer une société distribuée, nous n'avons pas peur de la distance, cela fait longtemps que nous sommes tous entré dans l'ère du numérique. Mais voilà, si j'ai déjà travaillé en remote auparavant, je faisais du 3/5 chez moi, 2/5 dans des locaux. Cette fois c'est du 100% en remote. Alors on apprend. Et j'aimerais vous faire partager ce que l'on a appris.",{"type":29,"tag":62,"props":63,"children":65},"h2",{"id":64},"le-truc-à-ne-vraiment-pas-faire",[66],{"type":50,"value":67},"Le truc à ne vraiment pas faire",{"type":29,"tag":30,"props":69,"children":70},{},[71],{"type":50,"value":72},"Avant de commencer par les choses qu'on fait et qui marchent, je tenais à vous partager ce qu'il ne faut pas faire.",{"type":29,"tag":30,"props":74,"children":75},{},[76],{"type":50,"value":77},"Si on a bien découvert un truc, enfin surtout moi, c'est qu'il faut à tout prix éviter de se retrouver dans la situation suivante :",{"type":29,"tag":79,"props":80,"children":81},"ul",{},[82,88,93],{"type":29,"tag":83,"props":84,"children":85},"li",{},[86],{"type":50,"value":87},"une réunion avec un seul participant à distance",{"type":29,"tag":83,"props":89,"children":90},{},[91],{"type":50,"value":92},"un très mauvais matériel, micro d'ambiance qui capte tous les échos, connexion pourrie",{"type":29,"tag":83,"props":94,"children":95},{},[96],{"type":50,"value":97},"une mauvaise discipline, plein de gens qui parlent entre eux",{"type":29,"tag":30,"props":99,"children":100},{},[101,103,110],{"type":50,"value":102},"Si vous le pouvez, faites en sorte qu'il y ait plusieurs personnes à distance, même si ca doit être artificiel avec des personnes qui restent dans une autre salle juste pour utiliser leur matériel quand bien même ils auraient pu être en présence des autres. Ces personnes là feront plus d'effort pour que tout se passe bien et s'en rappelleront lorsqu'elles seront dans une salle à plusieurs la prochaine fois. Investissez dans le meilleur micro qui soit, branchez vous en filaire, ayez un ordre du jour et un sens de parole clair. Vous pouvez même utiliser la technique du ",{"type":29,"tag":34,"props":104,"children":107},{"href":105,"rel":106},"https://fr.wikipedia.org/wiki/B%C3%A2ton_de_parole",[38],[108],{"type":50,"value":109},"bâton de parole",{"type":50,"value":111}," pour réguler la parole au sein du groupe. Sinon vous perdrez immanquablement la personne à distance en lui procurant frustration et énervement.",{"type":29,"tag":62,"props":113,"children":115},{"id":114},"utilisez-tous-les-moyens-à-disposition",[116],{"type":50,"value":117},"Utilisez tous les moyens à disposition",{"type":29,"tag":30,"props":119,"children":120},{},[121],{"type":50,"value":122},"Il n'existe pas qu'une seule façon de communiquer et tous les médias de communication ne sont pas fait pour toutes les situations. Chez Hopwork nous utilisons :",{"type":29,"tag":79,"props":124,"children":125},{},[126,131,136,141,146,151],{"type":29,"tag":83,"props":127,"children":128},{},[129],{"type":50,"value":130},"Jira pour tracer les choses à faire, c'est pour notre planification à court ou long terme.",{"type":29,"tag":83,"props":132,"children":133},{},[134],{"type":50,"value":135},"Hangout pour les réunions d'équipe, les brief, les sessions de debug en commun, le partage d'écran",{"type":29,"tag":83,"props":137,"children":138},{},[139],{"type":50,"value":140},"Slack, pour la discussion informelle de tous les jours, les demandes d'aides au pied levé, la bonne ambiance, que tout le monde sache ce que faites. C'est l'équivalent de la machine à café au milieu de l'open space",{"type":29,"tag":83,"props":142,"children":143},{},[144],{"type":50,"value":145},"l'email, pour les discussions qui doivent toucher plusieurs personnes, qui peuvent se traiter à tête reposée et pour ne pas tomber dans la réunionite aigue, pour garder une trace de nos \"super\" bonnes idées",{"type":29,"tag":83,"props":147,"children":148},{},[149],{"type":50,"value":150},"le téléphone, quand franchement hangout ou skype déconne trop pour être utilisé. Franchement le téléphone reste un outils d'une très bonne qualité sonore",{"type":29,"tag":83,"props":152,"children":153},{},[154],{"type":50,"value":155},"le face à face, rien de tel pour échanger, pratiquer, partager. Mais ca reste du petit groupe",{"type":29,"tag":30,"props":157,"children":158},{},[159],{"type":50,"value":160},"Evidemment le gros risque c'est d'utiliser le mauvais outils pour la mauvaise chose, mettre des choses à faire dans Slack, planifier le travail en face à face sans impliquer tous les participants, répondre par email quand il faudrait utiliser son téléphone pour désamorcer une mauvaise discussion etc...",{"type":29,"tag":62,"props":162,"children":164},{"id":163},"rencontrez-vous-régulièrement",[165],{"type":50,"value":166},"Rencontrez-vous régulièrement",{"type":29,"tag":30,"props":168,"children":169},{},[170],{"type":50,"value":171},"Le télétravail c'est excellent pour la concentration, la capacité que l'on a à réaliser en 4h ce que l'on ferait habituellement en 1 semaine dans un open space bruyant et constamment interrompu. Mais cela enlève une grande partie de la spontanéité des échanges, de la discussion qui part de rien, des échanges absurdes qui finissent par aboutir à une super idée. Se voir reste un super motivateur collectif, c'est aussi remettre des sourires et de l'humour à la place des smileys (quand encore on pense à les mettre) et ça n'a pas de prix. Alors il faut savoir doser les deux. Garder de vrais moments de concentration pour avancer, des moments de rencontre pour se motiver et repartir du bon pied. Sur Lyon nous sommes désormais 3. Nous avons fini par trouver un rythme de 1 jours ensemble dans un espace de coworking, 4 jours chez nous. Et nous apprécions vraiment cette journée en commun. Et nous tentons de nous voir aussi régulièrement entre équipes de villes différentes.",{"type":29,"tag":62,"props":173,"children":175},{"id":174},"partagezvotre-flow",[176],{"type":50,"value":177},"Partagez votre flow",{"type":29,"tag":30,"props":179,"children":180},{},[181],{"type":50,"value":182},"Je mentionnais Slack plus haut qui sert de machine à café virtuel, je remets une couche sur le sujet. L'une des choses qui perturbe quand on travaille seul chez soi c'est de ne pas savoir ce que font les autres. Est-on en phase sur le travail de la journée ? Est ce que je vais devoir balancer tout mon travail en l'air quand on fera le point mercredi car quelqu'un l'a déjà fait ou a décidé que c'était plus utile ? Est ce que quelqu'un n'aurait pas fait mieux que moi ? Est ce que le travail de X sera prêt pour que je l'utilise demain matin ? Il est en où \"Y\" au fait sur ce truc ? Autant de questions auxquelles on répond naturellement dans un open space, soit lors d'un daily meeting, soit autour de la machine à café, à table etc... On utilise donc Slack pour cela. C'est l'endroit ou on fait notre daily status régulier pour dire sur quoi on bosse, si on a des difficultés, pour troller gratuitement sur un outils qui ne fonctionne pas comme on le voudrait etc... Quand chacun joue le jeu, c'est un outil formidable.",{"type":29,"tag":62,"props":184,"children":186},{"id":185},"bon-et-maintenant-on-continue",[187],{"type":50,"value":188},"Bon et maintenant, on continue ?",{"type":29,"tag":30,"props":190,"children":191},{},[192,194,201],{"type":50,"value":193},"Vincent avait déjà écrit un très bon billet de blog \"",{"type":29,"tag":34,"props":195,"children":198},{"href":196,"rel":197},"https://blog.hopwork.fr/pourquoi-nous-avons-chasse-notre-equipe-du-bureau-ou-presque/",[38],[199],{"type":50,"value":200},"Pourquoi nous avons chassé notre équipe du bureau",{"type":50,"value":202},"\" en 2014.",{"type":29,"tag":30,"props":204,"children":205},{},[206],{"type":50,"value":207},"Un an plus tard, tout est encore d'actualité. Dans toute l'équipe, chacun est libre de décider de venir au bureau ou non. Certains vont dans des espaces de coworking. Parfois cela se fait dans la journée quand l'un d'entre nous a besoin de s'isoler ou au contraire voir les autres. C'est plus pratique pour tout le monde, plus efficace, bref ceci restera dans notre ADN.",{"type":29,"tag":30,"props":209,"children":210},{},[211],{"type":50,"value":212},"Et heureusement, car très bientôt c'est l'Europe qui nous tend les bras ;)",{"title":7,"searchDepth":214,"depth":214,"links":215},2,[216,217,218,219,220],{"id":64,"depth":214,"text":67},{"id":114,"depth":214,"text":117},{"id":163,"depth":214,"text":166},{"id":174,"depth":214,"text":177},{"id":185,"depth":214,"text":188},"markdown","content:articles:2015:10:13:siffler-en-teletravaillant.md","content","articles/2015/10/13/siffler-en-teletravaillant.md","md",1699796119659]