[{"data":1,"prerenderedAt":394},["Reactive",2],{"/articles/2016/06/16/recruter-futurs-pairs-autour-dun-verre":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"date":11,"categories":12,"tags":14,"img":17,"cover":18,"readingTime":19,"body":24,"_type":389,"_id":390,"_source":391,"_file":392,"_extension":393},"/articles/2016/06/16/recruter-futurs-pairs-autour-dun-verre","16",false,"","Recruter ces futurs pairs autour d'un verre","[![redcrabe](/images/redcrabe2.jpg)](https://eventuallycoding.com/wp-content/uploads/2013/03/redcrabe2.jpg)J’ai cofondé [Lateral-Thoughts](http://www....","1284","2016-06-16",[13],"waza",[15,16],"lateralthoughts","recrutement","redcrabe2.jpg","cover1.jpg",{"text":20,"minutes":21,"time":22,"words":23},"9 min read",8.23,493800,1646,{"type":25,"children":26,"toc":376},"root",[27,57,62,75,80,85,90,95,105,112,117,122,127,132,137,142,147,152,157,162,168,182,187,192,197,204,209,214,226,231,237,242,247,252,257,263,268,273,278,283,288,294,299,304,309,314,319,324,330,335,341,346,351,356,361,366,371],{"type":28,"tag":29,"props":30,"children":31},"element","p",{},[32,45,48,55],{"type":28,"tag":33,"props":34,"children":38},"a",{"href":35,"rel":36},"https://eventuallycoding.com/wp-content/uploads/2013/03/redcrabe2.jpg",[37],"nofollow",[39],{"type":28,"tag":40,"props":41,"children":44},"img",{"alt":42,"src":43},"redcrabe","/images/redcrabe2.jpg",[],{"type":46,"value":47},"text","J’ai cofondé ",{"type":28,"tag":33,"props":49,"children":52},{"href":50,"rel":51},"http://www.lateral-thoughts.com/",[37],[53],{"type":46,"value":54},"Lateral-Thoughts",{"type":46,"value":56}," en 2011. Techniquement j’y suis encore même si dans les faits je travaille à 100% sur Hopwork. Lateral-Thoughts est une boite formidable dont je ferais toujours la promotion. Son modèle collaboratif, la transparence tout cela est une réussite. Et comme je suis lancé sur le thème du recrutement, voyons comment ça se passe dans une boite comme ça.",{"type":28,"tag":29,"props":58,"children":59},{},[60],{"type":46,"value":61},"Cette société a été vu à un moment, à tort, comme un regroupement de freelances. On pourrait le croire, mais il y a une structure derrière. Et cette structure a des freelances mais aussi des salariés. En terme d’adhésion, freelance comme salarié passe les mêmes étapes pour rejoindre le groupe.",{"type":28,"tag":29,"props":63,"children":64},{},[65,67,73],{"type":46,"value":66},"D’ailleurs pour ceux qui se posent la question, Lateral-Thoughts ne fait pas de campagne de recrutement active mais par contre ",{"type":28,"tag":68,"props":69,"children":70},"strong",{},[71],{"type":46,"value":72},"il y a toujours de la place",{"type":46,"value":74},". Donc si la boite vous intéresse, contactez-nous !",{"type":28,"tag":29,"props":76,"children":77},{},[78],{"type":46,"value":79},"Revenons au sujet. La différence fondamentale dans une boite comme celle ci, c’est qu’il s’agit non pas de recruter une équipe à la “Mission impossible” pour réaliser un projet et ensuite se séparer, il s’agit de recruter ses “pairs”.",{"type":28,"tag":29,"props":81,"children":82},{},[83],{"type":46,"value":84},"Et oui, chez Lateral-Thoughts (LT pour les intimes) la société est organisée autour de la collaboration, toutes les infos sont partagées, toutes les décisions sont prises collégialement.",{"type":28,"tag":29,"props":86,"children":87},{},[88],{"type":46,"value":89},"Alors le recrutement est quelque chose de crucial. On cherche des personnes qui seront nos égaux dans la société, qui ne vont pas juste participer à la vie de la société mais la créer, voter pour toutes les décisions avec le même nombre de voix que les autres.",{"type":28,"tag":29,"props":91,"children":92},{},[93],{"type":46,"value":94},"Recruter une personne pour bosser avec est déjà délicat, ici c’est encore le stade au dessus. Il faut qu’on s’entende sur la vision et nos aspirations communes.",{"type":28,"tag":29,"props":96,"children":97},{},[98,100],{"type":46,"value":99},"Et c’est pourquoi ",{"type":28,"tag":68,"props":101,"children":102},{},[103],{"type":46,"value":104},"la venue dans LT commence par une bonne discussion autour d’un verre.",{"type":28,"tag":106,"props":107,"children":109},"h2",{"id":108},"la-discussion-autour-dun-verre-ou-dun-repas",[110],{"type":46,"value":111},"La discussion autour d’un verre (ou d’un repas)",{"type":28,"tag":29,"props":113,"children":114},{},[115],{"type":46,"value":116},"Vous en connaissez beaucoup des boites qui font leur premier entretien au resto ou au pub ?",{"type":28,"tag":29,"props":118,"children":119},{},[120],{"type":46,"value":121},"C’est le cas de LT.",{"type":28,"tag":29,"props":123,"children":124},{},[125],{"type":46,"value":126},"On souhaite toujours que la première discussion porte sur l’informel, les valeurs, les aspirations. Et c’est bien souvent autour d’un repas ou d’un verre que genre de discussion se déroule.",{"type":28,"tag":29,"props":128,"children":129},{},[130],{"type":46,"value":131},"Bien souvent il y a donc une ou deux personnes qui rencontrent le potentiel futur membre autour d’un verre pour discuter. On présente le modèle, notre fonctionnement. Et on voit si l’état d’esprit peut concorder.",{"type":28,"tag":29,"props":133,"children":134},{},[135],{"type":46,"value":136},"Même si on connaît bien la personne, on passe par cette étape afin d’éliminer toute fausse vision, tout préjugé que la personne pourrait avoir.",{"type":28,"tag":29,"props":138,"children":139},{},[140],{"type":46,"value":141},"C’est presque philosophique, est-ce que le futur membre s’accorde avec ce modèle ? Est ce qu’il est aligné avec ce qu’est LT, ce qu’on peut y trouver ou pas ?",{"type":28,"tag":29,"props":143,"children":144},{},[145],{"type":46,"value":146},"Certaines personnes cherchent absolument des chefs, d’autres cherchent absolument à l’être.",{"type":28,"tag":29,"props":148,"children":149},{},[150],{"type":46,"value":151},"Il n’y a pas de chef chez LT.",{"type":28,"tag":29,"props":153,"children":154},{},[155],{"type":46,"value":156},"Certains cherchent à entrer dans le futur Docker. LT n’est pas une startup tech.",{"type":28,"tag":29,"props":158,"children":159},{},[160],{"type":46,"value":161},"Ensuite vient la seconde étape.",{"type":28,"tag":106,"props":163,"children":165},{"id":164},"la-discussion-de-groupe",[166],{"type":46,"value":167},"La discussion de groupe",{"type":28,"tag":29,"props":169,"children":170},{},[171,173,180],{"type":46,"value":172},"Ok là il faut être bien accroché, on fait souvent l’entretien entre 4 et 6 personnes. C’est l’ensemble des présents qui vont se porter garant de la décision finale. On pense que c’est tellement important qu’il existe des points à gagner pour être présent (",{"type":28,"tag":33,"props":174,"children":177},{"href":175,"rel":176},"http://www.lateral-thoughts.com/blog/2015/02/26/Hello%20world/",[37],[178],{"type":46,"value":179},"Plus d’info sur les points business ici",{"type":46,"value":181},").",{"type":28,"tag":29,"props":183,"children":184},{},[185],{"type":46,"value":186},"Donc évidemment le premier challenge c’est de mettre à l’aise la personne. Une personne va “diriger l’entretien”, c’est-à-dire faire dérouler les étapes. Mais c’est le rôle de tous de mettre à l’aise la personne, vérifier qu’elle n’est pas trop stressée et y remédier si c’est possible.",{"type":28,"tag":29,"props":188,"children":189},{},[190],{"type":46,"value":191},"Le risque inverse c’est de faire trop ambiance potache.",{"type":28,"tag":29,"props":193,"children":194},{},[195],{"type":46,"value":196},"Sur cette discussion de groupe on sait qu’on prend environ 1h30/2h. Et nous avons découpé comme suit :",{"type":28,"tag":198,"props":199,"children":201},"h3",{"id":200},"une-partie-intro",[202],{"type":46,"value":203},"une partie intro",{"type":28,"tag":29,"props":205,"children":206},{},[207],{"type":46,"value":208},"Le but c’est de redire un peu ce qu’on fait, notre ADN.",{"type":28,"tag":29,"props":210,"children":211},{},[212],{"type":46,"value":213},"C’est l’occasion  pour le candidat de se présenter à ceux qui ne l’ont pas encore rencontré, de comprendre comment il est arrivé à nous rencontrer et ce qui lui plaît dans notre modèle.",{"type":28,"tag":29,"props":215,"children":216},{},[217,219,224],{"type":46,"value":218},"C’est aussi le moment pour nous de poser les gardes fous. D’expliquer que malgré le côté super sympa de la boîte, on a des contraintes. On n’a pas encore réussi à créer le nouveau soft qui tue du coup nos plans de conquête du monde sont pour l’instant en pause. On est une NoSSII mais ça veut dire not ",{"type":28,"tag":68,"props":220,"children":221},{},[222],{"type":46,"value":223},"only",{"type":46,"value":225}," SSII et on fait donc de la prestation. On essaie aussi de présenter les aspects plus terre-à-terre d’une société qui est collaborative, par exemple le fait qu’on touche à tout, même la compta etc…",{"type":28,"tag":29,"props":227,"children":228},{},[229],{"type":46,"value":230},"C’est un exercice délicat où il faut d’un côté que la personne n’ait aucune “mauvaise surprise” si elle nous rejoint. Mais en même temps on ne doit pas se focaliser que là dessus car ce serait y donner trop d’importance. Ca reste génial et faut réussir à le faire passer.",{"type":28,"tag":198,"props":232,"children":234},{"id":233},"une-partie-présentation-orale",[235],{"type":46,"value":236},"une partie présentation orale",{"type":28,"tag":29,"props":238,"children":239},{},[240],{"type":46,"value":241},"Cette partie sert à mieux comprendre le candidat. On donne un sujet qui doit être très ouvert. On demande à la personne de préparer une réponse pendant 5 min et ensuite il y a présentation pendant 10 min comme si c’était devant des collègues ou des clients qu’il faut convaincre.",{"type":28,"tag":29,"props":243,"children":244},{},[245],{"type":46,"value":246},"Le sujet doit être ouvert. C’est-à-dire que volontairement on doit essayer de ne pas expliquer ce qu’on attend. Certains vont s’orienter vers une explication de solution technique, d’autre une explication plus sur la méthode, d’autres encore sur une façon de gérer la conduite du changement.",{"type":28,"tag":29,"props":248,"children":249},{},[250],{"type":46,"value":251},"Il n’y a aucune mauvaise approche. Cela permet juste de mieux connaître la personne. Et on juge aussi de la capacité à communiquer, qualité que l’on estime essentielle.",{"type":28,"tag":29,"props":253,"children":254},{},[255],{"type":46,"value":256},"Pour ne rien vous cacher, cette partie nécessite une vraie préparation pour ne pas trop diriger le candidat ou pour avoir des questions pertinentes ensuite pendant la présentation. On doit encore s’améliorer dessus.",{"type":28,"tag":198,"props":258,"children":260},{"id":259},"le-test-ping-pong",[261],{"type":46,"value":262},"Le test ping pong",{"type":28,"tag":29,"props":264,"children":265},{},[266],{"type":46,"value":267},"Ici c’est de la culture générale. On enchaîne des tas de questions sur des sujets très larges en mode ping pong. “C’est quoi le duck typing ?”, “Le language Java est-il interprété ou compilé ?”",{"type":28,"tag":29,"props":269,"children":270},{},[271],{"type":46,"value":272},"Etc… Une réponse doit prendre moins de 10 secondes, tu sais ou tu sais pas.",{"type":28,"tag":29,"props":274,"children":275},{},[276],{"type":46,"value":277},"Ça peut porter sur des langages, des concepts, de la data science, de l’admin sys, du réseau, des bases de données. Il n’y a aucune réponse éliminatoire. On veut juste parcourir de la culture G. Si on sent un domaine où la personne est à l’aise, on essaie de lui en poser plus. Ça permet aussi de la mettre en confiance.",{"type":28,"tag":29,"props":279,"children":280},{},[281],{"type":46,"value":282},"Je ne le vois pas comme un simple QCM technique mais comme une base de discussion ensuite. Cela nous permet aussi de cerner les centres d’intérêt de la personne",{"type":28,"tag":29,"props":284,"children":285},{},[286],{"type":46,"value":287},"Sous cette forme c’est efficace. On balaie plein de choses, on cible les préférences de la personne, on juge aussi la personne sur sa capacité à ne pas se démonter sur des questions qu’elle ne connaît pas.",{"type":28,"tag":198,"props":289,"children":291},{"id":290},"le-test-technique",[292],{"type":46,"value":293},"Le test technique",{"type":28,"tag":29,"props":295,"children":296},{},[297],{"type":46,"value":298},"Pour clore l’entretien on organise une session de code sur IDE.",{"type":28,"tag":29,"props":300,"children":301},{},[302],{"type":46,"value":303},"On file un exercice pas trop complexe, fizzbuzz, mastermind etc… et on regarde comment ça se passe.",{"type":28,"tag":29,"props":305,"children":306},{},[307],{"type":46,"value":308},"Bon, petit scoop, c’est la partie que j’aime le moins. En général on fait les entretiens vers 18h, cette partie arrive à la fin donc vers 19h30. C’est fatiguant, stressant. Ça ne reflète pas forcément les vrais qualités de la personne.",{"type":28,"tag":29,"props":310,"children":311},{},[312],{"type":46,"value":313},"Maintenant c’est vrai aussi que c’est une façon de débusquer d’éventuelles personnes qui seraient très fortes en culture G, très à l’aise à l’oral mais ne seraient pas capables de manipuler du code dans un IDE. En l’espace de 1 min on voit si la personne sait manipuler son environnement, maîtrise les raccourcis claviers, bref, si c’est son métier.",{"type":28,"tag":29,"props":315,"children":316},{},[317],{"type":46,"value":318},"Personnellement je me suis déjà fait mon avis dans les premières minutes de cet exercice. Mais par contre je me fous de savoir si la personne arrivera au bout de l’exo avec 4 ou 5 personnes qui regardent et jugent en même temps. C’est sans doute car je pense que je n’en serais pas moi-même capable :)",{"type":28,"tag":29,"props":320,"children":321},{},[322],{"type":46,"value":323},"On a aussi essayé de transformer cet exercice en test d’algorithmie avec des énigmes impliquant des parcours, des calculs de complexité etc… Je préfère mais ça peut avoir les mêmes défauts que précédemment. Et ça ne permet pas de voir si la personne sait utiliser un IDE, ce qui est quand même l’avantage du test technique.",{"type":28,"tag":198,"props":325,"children":327},{"id":326},"le-roti",[328],{"type":46,"value":329},"Le ROTI",{"type":28,"tag":29,"props":331,"children":332},{},[333],{"type":46,"value":334},"On demande à tout le monde d’exprimer son avis sur l’entretien, le candidat inclus. Est-ce que le moment passé était agréable. Est-ce qu’on peut améliorer des choses, est-ce que le candidat peut s’améliorer sur certains points.",{"type":28,"tag":106,"props":336,"children":338},{"id":337},"la-délibération",[339],{"type":46,"value":340},"La délibération",{"type":28,"tag":29,"props":342,"children":343},{},[344],{"type":46,"value":345},"Ça se passe à tête reposée, pendant la semaine qui suit. C’est le moment crucial où chaque membre vote +1, 0 ou -1 sur la candidature. -1 est éliminatoire même s’il n’y a qu’une personne. On peut argumenter, mais on ne doit pas faire pression. Le vote est ce qu’il est.",{"type":28,"tag":29,"props":347,"children":348},{},[349],{"type":46,"value":350},"On se pose toujours plein de questions, il en va de la survie de la boîte qui est en jeu avec chaque recrutement.",{"type":28,"tag":29,"props":352,"children":353},{},[354],{"type":46,"value":355},"Le niveau de la personne est loin d’être secondaire, on le regarde attentivement. Mais on regarde aussi beaucoup le potentiel humain et la capacité d’apprentissage. Pour l’instant nous n’avons pas eu d’échec de ce côté-là.",{"type":28,"tag":29,"props":357,"children":358},{},[359],{"type":46,"value":360},"Enfin si, nous avons eu un échec. Nous avons beaucoup de mal à recruter des personnes qui sont en dehors de notre propre zone de confort : le développement informatique.",{"type":28,"tag":29,"props":362,"children":363},{},[364],{"type":46,"value":365},"Une fois nous avons tenté d’intégrer une personne qui fait des jeux vidéos sous Unity. Et ça n’a pas fonctionné. Ça n’a pas fonctionné car personne n’a pu l’aider pour trouver des missions ensuite. Personne ne pouvait le coacher, le challenger. La bouture n’a pas pris.",{"type":28,"tag":29,"props":367,"children":368},{},[369],{"type":46,"value":370},"Et c’est un échec pour nous.",{"type":28,"tag":29,"props":372,"children":373},{},[374],{"type":46,"value":375},"Nous avons une petite blague entre nous car c’est vrai qu’en plus d’être exclusivement des développeurs, le groupe est en partie composé de plusieurs personnes de Centrale Nantes avec une forte composante Scala et Big Data (c’est pas mon cas pour préciser). Du coup j’appelle ça la guerre des clones et le challenge c’est de réussir à ramener des regards neufs avec des gens plus complémentaires : des scientifiques, des UX designer, des devs PHP ou que sais-je.",{"title":7,"searchDepth":377,"depth":377,"links":378},2,[379,380,388],{"id":108,"depth":377,"text":111},{"id":164,"depth":377,"text":167,"children":381},[382,384,385,386,387],{"id":200,"depth":383,"text":203},3,{"id":233,"depth":383,"text":236},{"id":259,"depth":383,"text":262},{"id":290,"depth":383,"text":293},{"id":326,"depth":383,"text":329},{"id":337,"depth":377,"text":340},"markdown","content:articles:2016:06:16:recruter-futurs-pairs-autour-dun-verre.md","content","articles/2016/06/16/recruter-futurs-pairs-autour-dun-verre.md","md",1699824933823]