[{"data":1,"prerenderedAt":764},["Reactive",2],{"/articles/2020/12/07/les-paralleles-entre-le-dessin-et-le-developpement":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"date":11,"categories":12,"tags":14,"img":18,"cover":19,"readingTime":20,"body":25,"_type":759,"_id":760,"_source":761,"_file":762,"_extension":763},"/articles/2020/12/07/les-paralleles-entre-le-dessin-et-le-developpement","07",false,"","Les parallèles entre le dessin et le développement","J'ai pas mal tourné autour du pot pour faire ce billet qui s'éloigne, un peu, de ce que je fais habituellement.   Il se trouve que j'ai un hobby en pl...","1662","2020-12-07",[13],"waza",[15,16,17],"conception","design","dessin","Dobby0001-4-1024x391.jpg","cover2.jpg",{"text":21,"minutes":22,"time":23,"words":24},"14 min read",13.265,795900,2653,{"type":26,"children":27,"toc":747},"root",[28,57,67,76,81,96,101,106,111,116,123,133,143,149,154,159,164,170,180,192,197,207,212,218,228,240,245,279,285,300,312,317,332,338,353,363,375,380,385,391,411,416,425,431,456,461,476,496,501,513,518,528,534,558,570,575,605,610,615,723,728,742],{"type":29,"tag":30,"props":31,"children":32},"element","p",{},[33,36,40,42,45,47,50,52,55],{"type":34,"value":35},"text","J'ai pas mal tourné autour du pot pour faire ce billet qui s'éloigne, un peu, de ce que je fais habituellement.",{"type":29,"tag":37,"props":38,"children":39},"br",{},[],{"type":34,"value":41},"\nIl se trouve que j'ai un hobby en plus de mon métier, heureusement me direz-vous, il s'agit du dessin.",{"type":29,"tag":37,"props":43,"children":44},{},[],{"type":34,"value":46},"\nJ'entends souvent que le dessin c'est réservé aux personnes qui ont du talent, que c'est inné etc… J'ai la conviction que, comme les capacités à concevoir et implémenter des systèmes, tout est lié à la pratique et à l'acquisition de certains fondamentaux.",{"type":29,"tag":37,"props":48,"children":49},{},[],{"type":34,"value":51},"\nLe dessin ça s'apprend. Il y a des techniques à assimiler et il faut exercer son œil et sa main pour se les approprier.",{"type":29,"tag":37,"props":53,"children":54},{},[],{"type":34,"value":56},"\nJe vous propose ici de faire quelques parallèles entre le dessin et le développement informatique. C'est parti :)",{"type":29,"tag":30,"props":58,"children":59},{},[60,62,65],{"type":34,"value":61},"Pour illustrer ce billet je vais me concentrer sur le dessin de personnage. Le dessin c'est un sujet très vaste, comme le développement informatique d'ailleurs, et on peut retrouver des spécialistes des décors, de la colorisation, de l'animation, des animaux, du character design etc…",{"type":29,"tag":37,"props":63,"children":64},{},[],{"type":34,"value":66},"\nIl existe plein de métiers différents, illustrateur, concept artist, keyframe animator, artiste 3D et des myriades de déclinaison en fonction des cibles. On peut être par exemple illustrateur jeunesse, illustrateur dans des revues scientifiques, illustrateur de couverture. Et enfin il y a une multitude d'outil, le numérique, l'aquarelle, l'acrylique etc…",{"type":29,"tag":68,"props":69,"children":70},"disclaimer",{},[71],{"type":29,"tag":30,"props":72,"children":73},{},[74],{"type":34,"value":75},"pour ma part je suis le début d'un embryon d'amateur en dessin, je raconterais sans doute pas mal de bêtises. Si vous cherchez un billet de spécialiste sur l'illustration, passez votre chemin.",{"type":29,"tag":30,"props":77,"children":78},{},[79],{"type":34,"value":80},"Bref, partons dans un premier temps de ces dessins :",{"type":29,"tag":30,"props":82,"children":83},{},[84],{"type":29,"tag":85,"props":86,"children":90},"a",{"href":87,"rel":88},"https://eventuallycoding.com/wp-content/uploads/2020/12/Dobby0001-4.jpg",[89],"nofollow",[91],{"type":29,"tag":92,"props":93,"children":95},"img",{"alt":7,"src":94},"/images/Dobby0001-4-1024x391.jpg",[],{"type":29,"tag":30,"props":97,"children":98},{},[99],{"type":34,"value":100},"Fan Arts sur Dobby (Harry Potter), Catwoman (Batman), Rayla (prince des Dragons), Cyclope (Xmen)",{"type":29,"tag":30,"props":102,"children":103},{},[104],{"type":34,"value":105},"Ce sont donc des illustrations de personnages faits sur support numérique ou bien sur papier. Ce sont ce qu'on appelle des Fan Art puisque ce sont des réinterprétations d'un dessin déjà existant et/ou d'un personnage connu.",{"type":29,"tag":30,"props":107,"children":108},{},[109],{"type":34,"value":110},"Les dessins ci-dessus sont des dessins que j'ai réalisés à partir de références. J'ai voulu parfois reprendre certaines techniques, comme l'encrage de Dobby que je trouvais très dynamique. Catwoman m'intéressait pour la pose du personnage par contre j'ai changé complètement l'encrage du dessin original.",{"type":29,"tag":30,"props":112,"children":113},{},[114],{"type":34,"value":115},"Plus loin je vais vous parler du processus de dessin d'un personnage. Mais avant cela commençons à faire des parallèles avec le domaine informatique.",{"type":29,"tag":117,"props":118,"children":120},"h2",{"id":119},"la-recherche-de-référence",[121],{"type":34,"value":122},"La recherche de référence",{"type":29,"tag":30,"props":124,"children":125},{},[126,128,131],{"type":34,"value":127},"Dans le dessin, il est très important de chercher des références. On peut rechercher des objets en particulier ou des photos montrant des personnages dans des poses spécifiques, ou bien des images d'un personnage en particulier qu'on veut reproduire.",{"type":29,"tag":37,"props":129,"children":130},{},[],{"type":34,"value":132},"\nLes bases d'un dessinateur viennent de sa capacité à comprendre ses références pour se les approprier. On peut rechercher à décortiquer ce qui fait qu'on apprécie un style en particulier sur le \"line\", la mise en couleur, la composition, le dynamisme des poses.",{"type":29,"tag":30,"props":134,"children":135},{},[136,138,141],{"type":34,"value":137},"Dans le développement informatique on ne demande pas non plus de partir d'une feuille blanche. Vous partez de référence pour concevoir un système. Cela peut être des livres de références sur des patterns de conception, des retours d'expériences de personnes ayant eu à travailler sur les mêmes problématiques que vous, des articles de blogs, conférences etc…",{"type":29,"tag":37,"props":139,"children":140},{},[],{"type":34,"value":142},"\nLes choix technologiques ou de design ne sont pas improvisés. On établit une vision, une stratégie de ou on veut aller, parfois en assemblant plusieurs références pour éviter de réinventer la roue ou bien en étant sûr de l'améliorer.",{"type":29,"tag":117,"props":144,"children":146},{"id":145},"plagiat-copycat",[147],{"type":34,"value":148},"Plagiat ? Copycat ?",{"type":29,"tag":30,"props":150,"children":151},{},[152],{"type":34,"value":153},"Dans le monde de l'illustration on marche sur des œufs puisque on doit se demander constamment, est-ce du plagiat ou de l'hommage ? A partir de quel moment l'interprétation est suffisamment personnelle pour être considéré comme originale ? Je ne vais pas m'étaler sur le sujet, il existe des tas d'affaires, y compris avec des professionnels reconnus épinglés et j'avoue que parfois la frontière entre \"utiliser une référence\", \"hommage\", \"parodie\", \"inspiration\" ou juste \"plagiat\" est très subjective.",{"type":29,"tag":30,"props":155,"children":156},{},[157],{"type":34,"value":158},"En logiciel c'est un peu différent. Globalement on ne vous reprochera pas de reprendre un pattern de conception ou une idée d'implémentation technique. Ca se corse quand il s'agit de librairie puisqu'il existe des systèmes de licenses avec parfois des nuances pas toujours simples à saisir : utilisation dans un cadre commercial ou non, contamination de la license dans votre code etc...",{"type":29,"tag":30,"props":160,"children":161},{},[162],{"type":34,"value":163},"Pour ce qui est des produits en eux mêmes, on va retrouver de très nombreux copycat dans la nature (dans le transport urbain, la livraison de bouffe à domicile et j'en passe). Certains copycat peuvent apparaitre des années après et pour autant prendre le marché grace à une meilleure execution. Bref, on n'utilisera très rarement la notion de plagiat dans le monde du logiciel. On accepte qu'un produit refasse la même chose qu'un autre (exemple les story sur Twitter). On l'utilisera s'il est efficace.",{"type":29,"tag":117,"props":165,"children":167},{"id":166},"les-katasles-études",[168],{"type":34,"value":169},"Les Katas/Les études",{"type":29,"tag":30,"props":171,"children":172},{},[173,175,178],{"type":34,"value":174},"En dessin il y a une pratique qui doit être presque journalière, il s'agit des études/study. On identifie un sujet qu'on veut travailler en particulier, ca peut être un objet (une épée par exemple) ou une partie du corps humain (les mains….). On cherche des références et on noircit des feuilles.",{"type":29,"tag":37,"props":176,"children":177},{},[],{"type":34,"value":179},"\nAvec une pratique très régulière, on finit forcément par s'améliorer. Encore une fois le dessin c'est une question de pratique.",{"type":29,"tag":30,"props":181,"children":182},{},[183],{"type":29,"tag":85,"props":184,"children":187},{"href":185,"rel":186},"https://eventuallycoding.com/wp-content/uploads/2020/12/Anatomy_study.jpg",[89],[188],{"type":29,"tag":92,"props":189,"children":191},{"alt":7,"src":190},"/images/Anatomy_study.jpg",[],{"type":29,"tag":30,"props":193,"children":194},{},[195],{"type":34,"value":196},"Etudes sur des mains, pieds, jambes, armes blanches",{"type":29,"tag":30,"props":198,"children":199},{},[200,202,205],{"type":34,"value":201},"Dans le développement informatique le parallèle est plus compliqué à faire. Je vois moins de professionnels pratiquer tous les jours des exercices pour s'améliorer sur un point.",{"type":29,"tag":37,"props":203,"children":204},{},[],{"type":34,"value":206},"\nIl y a cependant la possibilité de s'entrainer sur des Katas de code et on trouve quelques sites pour se donner des défis (codingame, codekata, codewars). Dans ce domaine l'artiste est sans doute plus exigeant sur ces fondamentaux.",{"type":29,"tag":30,"props":208,"children":209},{},[210],{"type":34,"value":211},"Passons à l'illustration d'un personnage étape par étape.",{"type":29,"tag":117,"props":213,"children":215},{"id":214},"la-ligne-daction",[216],{"type":34,"value":217},"La ligne d'action",{"type":29,"tag":30,"props":219,"children":220},{},[221,223,226],{"type":34,"value":222},"L'une des premières étapes pour camper un personnage c'est d'identifier la dynamique du corps, les points d'équilibres et de tensions. C'est ce qu'on appelle une ligne d'action, c'est à dire le mouvement du personnage.",{"type":29,"tag":37,"props":224,"children":225},{},[],{"type":34,"value":227},"\nDéjà à cette étape on peut essayer d'amplifier ce mouvement en déformant cette ligne.",{"type":29,"tag":30,"props":229,"children":230},{},[231],{"type":29,"tag":85,"props":232,"children":235},{"href":233,"rel":234},"https://eventuallycoding.com/wp-content/uploads/2020/12/ligne-action.jpg",[89],[236],{"type":29,"tag":92,"props":237,"children":239},{"alt":7,"src":238},"/images/ligne-action.jpg",[],{"type":29,"tag":30,"props":241,"children":242},{},[243],{"type":34,"value":244},"ligne d'action sur le personnage de Dazzler (Marvel Comics)",{"type":29,"tag":30,"props":246,"children":247},{},[248,250,253,255,258,260,263,265,268,270,277],{"type":34,"value":249},"La ligne d'action dans le développement informatique c'est ce qui se rapproche le plus d'une déclaration d'intention.",{"type":29,"tag":37,"props":251,"children":252},{},[],{"type":34,"value":254},"\nA quoi ça pourrait correspondre ?",{"type":29,"tag":37,"props":256,"children":257},{},[],{"type":34,"value":259},"\nPour un produit c'est par exemple la définition de la mission de ce produit ou de la proposition de valeur.",{"type":29,"tag":37,"props":261,"children":262},{},[],{"type":34,"value":264},"\nCa peut être également la définition de l'objectif à atteindre (+10% dans l'étape B du funnel de vente).",{"type":29,"tag":37,"props":266,"children":267},{},[],{"type":34,"value":269},"\nC'est également proche d'une ",{"type":29,"tag":85,"props":271,"children":274},{"href":272,"rel":273},"https://github.com/joelparkerhenderson/architecture_decision_record",[89],[275],{"type":34,"value":276},"ADR",{"type":34,"value":278}," (architecture decision record)",{"type":29,"tag":117,"props":280,"children":282},{"id":281},"la-représentation-en-figures-élémentaires",[283],{"type":34,"value":284},"La représentation en figures élémentaires.",{"type":29,"tag":30,"props":286,"children":287},{},[288,290,293,295,298],{"type":34,"value":289},"Une fois qu'on a la ligne d'action, on peut tracer un premier personnage très simple en fil de fer.",{"type":29,"tag":37,"props":291,"children":292},{},[],{"type":34,"value":294},"\nCette étape faite on peut ensuite décomposer le corps humain en figures géométriques simples.",{"type":29,"tag":37,"props":296,"children":297},{},[],{"type":34,"value":299},"\nIci on va commencer à faire intervenir quelques notions, de perspective si le corps est observé sur des angles exotiques, d'anatomie pour bien proportionner les différentes parties et on va devoir déformer certaines figures géométriques en fonction de la ligne d'action.",{"type":29,"tag":30,"props":301,"children":302},{},[303],{"type":29,"tag":85,"props":304,"children":307},{"href":305,"rel":306},"https://eventuallycoding.com/wp-content/uploads/2020/12/pose1.jpg",[89],[308],{"type":29,"tag":92,"props":309,"children":311},{"alt":7,"src":310},"/images/pose1.jpg",[],{"type":29,"tag":30,"props":313,"children":314},{},[315],{"type":34,"value":316},"Etude d'après une photo",{"type":29,"tag":30,"props":318,"children":319},{},[320,322,325,327,330],{"type":34,"value":321},"En développement on va commencer à poser les bases. C'est l'étape du prototype permettant de \"bloquer les formes\". Ce n'est pas un produit fini mais on pose les bases d'une architecture.",{"type":29,"tag":37,"props":323,"children":324},{},[],{"type":34,"value":326},"\nComme en dessin, il est important de maitriser certains fondamentaux pour cette étape. Ici il n'est pas question d'anatomie, de perspective etc… Mais d'identifier des workflows, de modèle de données, de cas d'usage. Et il faut savoir les adapter(déformer) en fonction de notre intention.",{"type":29,"tag":37,"props":328,"children":329},{},[],{"type":34,"value":331},"\nCette étape en apparence simple est celle qui pose les bases pour la suite. C'est la fondation d'un produit (et d'un dessin) réussi.",{"type":29,"tag":117,"props":333,"children":335},{"id":334},"le-sketchcroquisesquisse",[336],{"type":34,"value":337},"Le sketch/croquis/esquisse",{"type":29,"tag":30,"props":339,"children":340},{},[341,343,346,348,351],{"type":34,"value":342},"A partir de cette étape il convient de faire un avertissement.",{"type":29,"tag":37,"props":344,"children":345},{},[],{"type":34,"value":347},"\nLes étapes que je cite ici correspondent à une méthode de dessin.",{"type":29,"tag":37,"props":349,"children":350},{},[],{"type":34,"value":352},"\nIl existe des illustrateurs qui avec la pratique sautent les premières étapes. Certains ne font pas de sketch, d'autres utilisent plutôt des couleurs pour bloquer des formes. Bref, il existe de nombreuses techniques différentes et rendu différents et je n'en décris ici qu'une seule, celle que j'utilise la majorité du temps.",{"type":29,"tag":30,"props":354,"children":355},{},[356,358,361],{"type":34,"value":357},"Reprenons. A partir de là, on va pouvoir tracer un croquis (sketch, esquisse) sur la structure existante. Sur un support traditionnel on va utiliser un crayon de papier par exemple.",{"type":29,"tag":37,"props":359,"children":360},{},[],{"type":34,"value":362},"\nCe sketch n'a pas pour vocation d'être ultra détaillée mais il apporte une couche de détail sur les figures géométriques existantes. Il permet de rajouter les vêtements (l'étape précédente n'en comporte pas), objets, cheveux, éléments de visage, positions des mains etc…",{"type":29,"tag":30,"props":364,"children":365},{},[366],{"type":29,"tag":85,"props":367,"children":370},{"href":368,"rel":369},"https://eventuallycoding.com/wp-content/uploads/2020/12/Illustration_sans_titre-34.jpg",[89],[371],{"type":29,"tag":92,"props":372,"children":374},{"alt":7,"src":373},"/images/Illustration_sans_titre-34.jpg",[],{"type":29,"tag":30,"props":376,"children":377},{},[378],{"type":34,"value":379},"Différents sketchs réalisés à partir de photos. J'aurais pu aller plus loin sur les visages et les mains",{"type":29,"tag":30,"props":381,"children":382},{},[383],{"type":34,"value":384},"Cette étape, dans le développement on pourrait considérer qu'il s'agit du moment où on réalise des wireframes ou des maquettes interactives (Figmap, Zeplin, Sketch etc...). On commence à ajouter des détails notamment sur les parcours utilisateurs. C'est également le moment de définition des user stories.",{"type":29,"tag":117,"props":386,"children":388},{"id":387},"le-lineartencrage",[389],{"type":34,"value":390},"Le lineart/encrage",{"type":29,"tag":30,"props":392,"children":393},{},[394,396,399,401,404,406,409],{"type":34,"value":395},"Passé le sketch, on peut passer à l'encrage (ou line art) qui consiste à mettre au propre le sketch et détailler ce qui doit l'être.",{"type":29,"tag":37,"props":397,"children":398},{},[],{"type":34,"value":400},"\nC'est une des phases que je préfère. Les étapes précédentes sont les plus difficiles. L'encrage nécessite d'être méticuleux et ça peut être assez long mais si les bases sont solides c'est une partie plutôt reposante. C'est aussi le moment où le dessin se révèle. On commence à faire apparaitre du volume en jouant sur l'épaisseur des traits ou des hachurages. On peut commencer à faire apparaitre des textures également.",{"type":29,"tag":37,"props":402,"children":403},{},[],{"type":34,"value":405},"\nSur cette étape on trouvera de nombreuses approches assez différentes. Certains illustrateurs ne font pas d'encrage et passent directement à la peinture par dessus le croquis. Certains auront des traits très fins, peu de hachures. D'autres au contraire auront un line très marqué avec un hachurage (cross hatching) très marqué. A cette étape une grande partie de l'âme du dessin apparait.",{"type":29,"tag":37,"props":407,"children":408},{},[],{"type":34,"value":410},"\nC'est d'ailleurs un métier à part entière dans l'industrie de l'illustration et vous avez des personnes spécialisées sur l'encrage qui encrent le dessin des autres.",{"type":29,"tag":30,"props":412,"children":413},{},[414],{"type":34,"value":415},"Pour récapituler ces étapes, je vous invite à découvrir Akihito Yoshitomi qui illustre dans cette vidéo les étapes de découpage en forme simple, sketch puis encrage. Et si vous êtes fan d'ASMR c'est également une vidéo pour vous :)",{"type":29,"tag":30,"props":417,"children":418},{},[419],{"type":29,"tag":85,"props":420,"children":423},{"href":421,"rel":422},"https://www.youtube.com/watch?v=uv2d8nzSgGU",[89],[424],{"type":34,"value":421},{"type":29,"tag":117,"props":426,"children":428},{"id":427},"la-mise-en-couleur",[429],{"type":34,"value":430},"La mise en couleur",{"type":29,"tag":30,"props":432,"children":433},{},[434,436,439,441,444,446,449,451,454],{"type":34,"value":435},"Passé l'encrage on peut aborder la mise en couleur.",{"type":29,"tag":37,"props":437,"children":438},{},[],{"type":34,"value":440},"\nLà encore la mise en couleurs c'est une étape cruciale. Elle peut vraiment mettre en valeur une illustration ou au contraire la rendre terne.",{"type":29,"tag":37,"props":442,"children":443},{},[],{"type":34,"value":445},"\nC'est également un métier à part entière et vous retrouverez les noms des coloristes sur les crédits d'une BD. Il y a des styles très reconnaissables dans la mise en valeur des lumières ou des textures.",{"type":29,"tag":37,"props":447,"children":448},{},[],{"type":34,"value":450},"\nIl y a de nombreux fondamentaux à maitriser sur la lumière, l'anatomie (qui va conditionner les éléments qui sont plus exposés à la lumière), les lumières de réflexions, les matériaux (tout les matériaux ne renvoient pas la lumière de la même façon). Il faut également maitriser l'harmonie des couleurs (complémentaire, triadique, analogique etc…).",{"type":29,"tag":37,"props":452,"children":453},{},[],{"type":34,"value":455},"\nUn même dessin avec des choix de colorisations différents rendra des ambiances radicalement opposés.",{"type":29,"tag":30,"props":457,"children":458},{},[459],{"type":34,"value":460},"Ici il y aura deux écoles :",{"type":29,"tag":462,"props":463,"children":464},"ul",{},[465,471],{"type":29,"tag":466,"props":467,"children":468},"li",{},[469],{"type":34,"value":470},"ceux qui vont d'abord travailler en valeurs (nuances de gris) pour représenter directement les lumières et ombres puis appliqueront la couleur par dessus (technique essentiellement pour de l'illustration numérique)",{"type":29,"tag":466,"props":472,"children":473},{},[474],{"type":34,"value":475},"ceux qui vont travailler par aplats de couleurs et appliqueront les ombres et lumières par la suite.",{"type":29,"tag":30,"props":477,"children":478},{},[479,481,484,486,489,491,494],{"type":34,"value":480},"J'utilise plutot la seconde technique.",{"type":29,"tag":37,"props":482,"children":483},{},[],{"type":34,"value":485},"\nCe que je pratique le plus souvent, dans l'idée c'est d'utiliser des couleurs pas trop saturé pour remplir les zones du dessin par ce qu'on appelle des aplats de couleurs.",{"type":29,"tag":37,"props":487,"children":488},{},[],{"type":34,"value":490},"\nA cette étape, on pourrait déjà s'arrêter et vous avez déjà vu de nombreux dessins utilisant uniquement des aplats de couleurs.",{"type":29,"tag":37,"props":492,"children":493},{},[],{"type":34,"value":495},"\nEnsuite on peut prendre une couleur plus foncé (je passe sur la méthode pour le faire) et repasser sur les ombres en utilisant soit du cell shading (ombre très marqué) soit des brosses flous pour une ombre mélangé. Enfin on apporte les touches de lumières en jouant également sur les lumières de réflexions.",{"type":29,"tag":30,"props":497,"children":498},{},[499],{"type":34,"value":500},"(Je simplifie grandement cette partie car je trouve que c'est l'une des plus larges en termes de techniques possibles)",{"type":29,"tag":30,"props":502,"children":503},{},[504],{"type":29,"tag":85,"props":505,"children":508},{"href":506,"rel":507},"https://eventuallycoding.com/wp-content/uploads/2020/12/seya_1.jpg",[89],[509],{"type":29,"tag":92,"props":510,"children":512},{"alt":7,"src":511},"/images/seya_1-1024x255.jpg",[],{"type":29,"tag":30,"props":514,"children":515},{},[516],{"type":34,"value":517},"Illustration des étapes de mises en couleurs sur Seiya de la série Saint Seiya et d'ailleurs cette fois en utilisant des valeurs",{"type":29,"tag":30,"props":519,"children":520},{},[521,523,526],{"type":34,"value":522},"A cette étape, si je reprends mon fil rouge et reparle de développement informatique, on vient de passer plusieurs étapes qui correspondent à la mise au propre de notre prototype. On est passé progressivement de notre déclaration d'intention, de nos wireframes, ADR, use case, user stories à une implémentation.",{"type":29,"tag":37,"props":524,"children":525},{},[],{"type":34,"value":527},"\nA mon sens, dans notre métier aussi cette implémentation est influencé par des notions de style (ou de paradigmes de programmation et d'architecture). La maturité, ou l'absence de maturité de l'équipe, peut avoir \"sublimé\" l'intention initiale ou au contraire l'avoir dénaturé. En effet une mauvaise UX (ergonomie), une mauvaise gestion des cas aux limites, une mauvaise séparation des responsabilités, un non respect des bonnes pratiques de développement peut créer des produits non utilisables et qui échouent à rendre service à ces utilisateurs.",{"type":29,"tag":117,"props":529,"children":531},{"id":530},"le-background-la-composition",[532],{"type":34,"value":533},"Le background, la composition",{"type":29,"tag":30,"props":535,"children":536},{},[537,539,542,544,547,549,556],{"type":34,"value":538},"J'aurais du le mentionner dès le début mais notre personnage va s'intégrer dans une composition. La composition correspond à la façon dont il représenté. Donc déjà le fait que l'on voit uniquement le visage, 2/3 du corps, la totalité, en contre-plongée ou de face, c'est un choix de composition.",{"type":29,"tag":37,"props":540,"children":541},{},[],{"type":34,"value":543},"\nDans la composition il y a également l'environnement qui va influer sur les lumières, le dynamisme, la mise en valeur.",{"type":29,"tag":37,"props":545,"children":546},{},[],{"type":34,"value":548},"\nJe vous invite à regarder ",{"type":29,"tag":85,"props":550,"children":553},{"href":551,"rel":552},"http://designspartan.com/tutoriels/8-conseils-de-compositions-pour-vos-prochaines-illustrations/",[89],[554],{"type":34,"value":555},"ce billet",{"type":34,"value":557}," qui parle des techniques de composition avec des exemples d'illustration.",{"type":29,"tag":30,"props":559,"children":560},{},[561],{"type":29,"tag":85,"props":562,"children":565},{"href":563,"rel":564},"https://eventuallycoding.com/wp-content/uploads/2020/12/C180001.jpg",[89],[566],{"type":29,"tag":92,"props":567,"children":569},{"alt":7,"src":568},"/images/C180001.jpg",[],{"type":29,"tag":30,"props":571,"children":572},{},[573],{"type":34,"value":574},"C-18 de la série Dragon Ball, avec l'encrage initial puis le dessin repris sur tablette avec un background. Ca illustre justement que c'est pas du tout mon point fort cette dernière étape :)",{"type":29,"tag":30,"props":576,"children":577},{},[578,580,583,585,588,590,593,595,598,600,603],{"type":34,"value":579},"Pour un produit, la composition, le background, c'est la façon de promouvoir et mettre en avant ce que vous avez réalisé. C'est le story telling qui explique le cheminement entre votre mission et la façon dont vous avez souhaité y répondre. C'est le rôle du PMM (Product Marketing) qui travaille sur la promotion du produit et fais le pont avec les équipes commerciales pour que le produit soit adapté au discours commercial et vice versa. C'est en fait toutes les méthodes de distribution de votre produit, les canaux sur lesquels vous communiquez, votre force commerciale.",{"type":29,"tag":37,"props":581,"children":582},{},[],{"type":34,"value":584},"\nUn dessin peut se suffire à lui même sur fond blanc et l'étape de la composition est parfois très délicate (elle me pose beaucoup de soucis).",{"type":29,"tag":37,"props":586,"children":587},{},[],{"type":34,"value":589},"\nMais un background et une bonne composition peuvent radicalement changer l'illustration et la sublimer. Je déconseille de le négliger.",{"type":29,"tag":37,"props":591,"children":592},{},[],{"type":34,"value":594},"\nDe la même façon, négliger la mise en valeur de son produit (via le marketing) c'est une erreur que fait beaucoup de produits.",{"type":29,"tag":37,"props":596,"children":597},{},[],{"type":34,"value":599},"\nLa mise en valeur c'est ce qui fait que Mongodb a du succès malgré un produit perfectible. C'est ce qui fait que Slack est valorisé 27 Milliards de dollars alors qu'IRC faisait déjà grossièrement le même boulot il y a 30 ans.",{"type":29,"tag":37,"props":601,"children":602},{},[],{"type":34,"value":604},"\nSi vous faites du produit, ne le négligez pas, vraiment.",{"type":29,"tag":30,"props":606,"children":607},{},[608],{"type":34,"value":609},"Je vais m'arrêter ici. Forcément les comparaisons ont leurs limites. Il s'agissait plus d'une interprétation imagé (pour le coup on peut pas faire plus imagé que des dessins) de mon métier et j'en ai profité pour parler d'un sujet qui me plait en dehors de mon monde professionnel. Evidemment l'une des différences fondamentales entre un dessin et un produit c'est que le produit évolue constamment alors que le dessin reste figé (Par contre un personnage au sein d'une histoire peut évoluer).",{"type":29,"tag":30,"props":611,"children":612},{},[613],{"type":34,"value":614},"Si vous voulez voir des dessins d'artistes incroyables, voici une petite liste que je vous propose (Je suis plus de 200 artistes sur instagram donc je vais pas tous les lister)",{"type":29,"tag":30,"props":616,"children":617},{},[618,620,627,630,637,639,642,649,651,654,661,663,666,673,675,678,685,687,690,697,699,702,709,711,714,721],{"type":34,"value":619},"Jim Lee, artiste Comics pour ces encrages qu'on peut retrouver régulièrement Twitch et ",{"type":29,"tag":85,"props":621,"children":624},{"href":622,"rel":623},"https://www.youtube.com/channel/UCngjNs-Ml8-EmqnlOE3OMMQ",[89],[625],{"type":34,"value":626},"sur cette chaine youtube",{"type":29,"tag":37,"props":628,"children":629},{},[],{"type":29,"tag":85,"props":631,"children":634},{"href":632,"rel":633},"https://www.instagram.com/mikedeodato/",[89],[635],{"type":34,"value":636},"Mike Deodato",{"type":34,"value":638},", artiste comics, également pour ces encrages",{"type":29,"tag":37,"props":640,"children":641},{},[],{"type":29,"tag":85,"props":643,"children":646},{"href":644,"rel":645},"https://www.instagram.com/dfinchartist/?hl=fr",[89],[647],{"type":34,"value":648},"David Finch",{"type":34,"value":650},", artiste comics, encrage et texture incroyables",{"type":29,"tag":37,"props":652,"children":653},{},[],{"type":29,"tag":85,"props":655,"children":658},{"href":656,"rel":657},"https://www.instagram.com/wlop/?hl=fr",[89],[659],{"type":34,"value":660},"Wlop",{"type":34,"value":662},", digital painter, software engineer dans la vie :)",{"type":29,"tag":37,"props":664,"children":665},{},[],{"type":29,"tag":85,"props":667,"children":670},{"href":668,"rel":669},"https://www.instagram.com/rossdraws/?hl=fr",[89],[671],{"type":34,"value":672},"Ross Draws",{"type":34,"value":674},", digital painting, pour ces couleurs",{"type":29,"tag":37,"props":676,"children":677},{},[],{"type":29,"tag":85,"props":679,"children":682},{"href":680,"rel":681},"https://www.artstation.com/dgreco",[89],[683],{"type":34,"value":684},"Dave Grego",{"type":34,"value":686},", concept artist,",{"type":29,"tag":37,"props":688,"children":689},{},[],{"type":29,"tag":85,"props":691,"children":694},{"href":692,"rel":693},"https://www.youtube.com/watch?v=MGbvhyTZXfs&feature=emb_title",[89],[695],{"type":34,"value":696},"Kim Jung Gi",{"type":34,"value":698},", qui dessine des fresques de 4m, de tête, à l'encre directement…",{"type":29,"tag":37,"props":700,"children":701},{},[],{"type":29,"tag":85,"props":703,"children":706},{"href":704,"rel":705},"https://www.artstation.com/marcbrunet",[89],[707],{"type":34,"value":708},"Marc Brunet",{"type":34,"value":710},", Digital painting, concept artist",{"type":29,"tag":37,"props":712,"children":713},{},[],{"type":29,"tag":85,"props":715,"children":718},{"href":716,"rel":717},"https://www.nadiaxel.com/",[89],[719],{"type":34,"value":720},"Nadiaxel",{"type":34,"value":722},", freelance illustrator",{"type":29,"tag":30,"props":724,"children":725},{},[726],{"type":34,"value":727},"Evidemment je ne pouvais pas tous les citer, il y a aussi des artistes qui ne sont plus en activité aujourd'hui (Frazetta, Moebius par exemple). Si ca vous intéresse il suffit d'aller sur artstation, Pinterest, deviantart, Instagram et de proche en proche vous en découvrirez d'autres.",{"type":29,"tag":30,"props":729,"children":730},{},[731,733,740],{"type":34,"value":732},"Ah oui j'oubliais, vous pouvez aussi ",{"type":29,"tag":85,"props":734,"children":737},{"href":735,"rel":736},"https://www.instagram.com/corwinhakanai/",[89],[738],{"type":34,"value":739},"me retrouver sur Instagram",{"type":34,"value":741},". Mais c'est très loin du niveau des précédents artistes que je viens de citer.",{"type":29,"tag":30,"props":743,"children":744},{},[745],{"type":34,"value":746},"A bientôt",{"title":7,"searchDepth":748,"depth":748,"links":749},2,[750,751,752,753,754,755,756,757,758],{"id":119,"depth":748,"text":122},{"id":145,"depth":748,"text":148},{"id":166,"depth":748,"text":169},{"id":214,"depth":748,"text":217},{"id":281,"depth":748,"text":284},{"id":334,"depth":748,"text":337},{"id":387,"depth":748,"text":390},{"id":427,"depth":748,"text":430},{"id":530,"depth":748,"text":533},"markdown","content:articles:2020:12:07:les-paralleles-entre-le-dessin-et-le-developpement.md","content","articles/2020/12/07/les-paralleles-entre-le-dessin-et-le-developpement.md","md",1699949899284]