[{"data":1,"prerenderedAt":545},["Reactive",2],{"/articles/2020/07/20/rewrite-from-scratch":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"date":11,"categories":12,"tags":14,"img":18,"cover":19,"readingTime":20,"body":25,"_type":540,"_id":541,"_source":542,"_file":543,"_extension":544},"/articles/2020/07/20/rewrite-from-scratch","20",false,"","Rewrite from scratch ?","![](/images/rewrite-goodness-matrix1.png)\nJe souhaite partager aujourd'hui un retour d'expérience issu de multiples entretiens d'embauche que j'ai pu...","1546","2020-07-20",[13],"waza",[15,16,17],"architecture","recrutement","rewrite","rewrite-goodness-matrix1.png","cover6.jpg",{"text":21,"minutes":22,"time":23,"words":24},"12 min read",11.395,683700,2279,{"type":26,"children":27,"toc":533},"root",[28,38,50,57,67,87,107,112,122,128,133,197,203,228,258,273,308,318,324,339,349,354,364,405,425,435,442,467,480,485,495,513,518,523],{"type":29,"tag":30,"props":31,"children":32},"element","p",{},[33],{"type":29,"tag":34,"props":35,"children":37},"img",{"alt":7,"src":36},"/images/rewrite-goodness-matrix1.png",[],{"type":29,"tag":30,"props":39,"children":40},{},[41,44,48],{"type":42,"value":43},"text","Je souhaite partager aujourd'hui un retour d'expérience issu de multiples entretiens d'embauche que j'ai pu faire passer.",{"type":29,"tag":45,"props":46,"children":47},"br",{},[],{"type":42,"value":49},"\nJ'ai utilisé pendant plusieurs années un scénario qui servait lors d'une des phases de l'entretien. C'était entre 2011 et 2018.\nCe scénario avait de multiples avantages et j'aimerais le partager aujourd'hui, mais surtout partager la grille de lecture que j'en tirais.",{"type":29,"tag":51,"props":52,"children":54},"h2",{"id":53},"un-peu-de-contexte",[55],{"type":42,"value":56},"Un peu de contexte",{"type":29,"tag":30,"props":58,"children":59},{},[60,62,65],{"type":42,"value":61},"Pour remettre un peu de contexte, je ne suis pas recruteur, cependant, j'ai calculé récemment que j'avais lu plus de 550 CV, réalisé environ 150 appels (téléphone ou vidéo) de préentretien et fait passer entre 80 et 100 premiers entretiens. Je ne compte pas les tours suivants.",{"type":29,"tag":45,"props":63,"children":64},{},[],{"type":42,"value":66},"\nEt bien sûr j'ai moi-même passé de nombreux entretiens également dans ma carrière.",{"type":29,"tag":30,"props":68,"children":69},{},[70,72,75,77,80,82,85],{"type":42,"value":71},"Bref, sans être expert, j'ai appris à écouter, lire, et poser des questions.",{"type":29,"tag":45,"props":73,"children":74},{},[],{"type":42,"value":76},"\nJ'ai itéré sur le format, la durée, le contenu…",{"type":29,"tag":45,"props":78,"children":79},{},[],{"type":42,"value":81},"\nPendant un moment j'ai utilisé un scénario qui demandait à la personne candidate de se glisser dans un rôle. Ce petit jeu durait environ 15 minutes.",{"type":29,"tag":45,"props":83,"children":84},{},[],{"type":42,"value":86},"\nLes consignes étaient simples :",{"type":29,"tag":88,"props":89,"children":90},"ul",{},[91,97,102],{"type":29,"tag":92,"props":93,"children":94},"li",{},[95],{"type":42,"value":96},"Les 5 premières minutes je décris la situation et la personne peut poser des questions.",{"type":29,"tag":92,"props":98,"children":99},{},[100],{"type":42,"value":101},"5 minutes sont ensuite utilisables pour réfléchir de son côté, je sors de la pièce en laissant le candidat mettre ses idées sur papier",{"type":29,"tag":92,"props":103,"children":104},{},[105],{"type":42,"value":106},"10 minutes sont ensuites utilisées pour la restitution. Je me place dans la peau d'une personne fictive pour challenger les idées et voir les réactions.",{"type":29,"tag":30,"props":108,"children":109},{},[110],{"type":42,"value":111},"Comme je réalise majoritairement mes entretiens à plusieurs, nous pouvions nous répartir des rôles.",{"type":29,"tag":30,"props":113,"children":114},{},[115,117,120],{"type":42,"value":116},"Dans cet exercice, il n'y avait pas de bonne réponse académique. Il s'agissait d'une situation inspirée d'un cas réel et ce n'est pas en 5 minutes que l'on peut trouver la bonne réponse, si tant qu'il y en ait une.",{"type":29,"tag":45,"props":118,"children":119},{},[],{"type":42,"value":121},"\nUne caractéristique de cet exercice était qu'il était volontairement très ouvert. Si la personne faisait bien attention, elle pouvait partir dans de nombreuses directions. Et justement, c'était la direction prise et l'approche empruntée qui était riche d'enseignement, sans même parler de la capacité de compréhension.",{"type":29,"tag":51,"props":123,"children":125},{"id":124},"le-fameux-scénario",[126],{"type":42,"value":127},"Le fameux scénario",{"type":29,"tag":30,"props":129,"children":130},{},[131],{"type":42,"value":132},"Voici en simplifié le scénario :",{"type":29,"tag":134,"props":135,"children":136},"blockquote",{},[137,167],{"type":29,"tag":30,"props":138,"children":139},{},[140,142,145,147,150,152,155,157,160,162,165],{"type":42,"value":141},"\"Vous arrivez aujourd'hui dans la société XXX qui est éditeur de logiciel dans un domaine financier. Vous êtes ici en tant que YY (ça dépendait du candidat) et vous rencontrez les personnes du comité de pilotage qui souhaitent que vous regardiez la situation avec un oeil neuf pour donner des préconisations d'entreprise. Oui la situation est un peu étrange mais passons.",{"type":29,"tag":45,"props":143,"children":144},{},[],{"type":42,"value":146},"\nLe coeur de métier de la société XXX est la finance comme indiqué plus haut. Le logiciel vendue aux clients a évolué depuis les années 80 et a été écrit dans un vieux langage. Ce langage n'est plus utilisée aujourd'hui dans le monde que par la société XXX et la société qui édite ce langage, son compilateur et son environnement d'execution.",{"type":29,"tag":45,"props":148,"children":149},{},[],{"type":42,"value":151},"\nCe langage est un langage de haut niveau, destiné à des experts métiers qui sont capable de développer des programmes fonctionnels plutot complexes sur de la valorisation d'actifs financiers.",{"type":29,"tag":45,"props":153,"children":154},{},[],{"type":42,"value":156},"\nOn pourrait le comparer à COBOL dans une certaine mesure.",{"type":29,"tag":45,"props":158,"children":159},{},[],{"type":42,"value":161},"\nD'ailleurs il faut travailler sur mainframe et il ne tourne que sur Mainframe.",{"type":29,"tag":45,"props":163,"children":164},{},[],{"type":42,"value":166},"\nLa société éditrice du langage ferme ses portes. La société XXX peut encore utiliser le compilateur actuel et l'outillage associée mais il ne peut plus évoluer.",{"type":29,"tag":30,"props":168,"children":169},{},[170,172,175,177,180,182,185,187,190,192,195],{"type":42,"value":171},"La société fait 200 personnes, dont 90 qui travaillent sur ce langage métier, 15 sur du socle technique et 10 sur l'expertise technique nécessaire aux déploiements clients (base de données, systèmes etc…).",{"type":29,"tag":45,"props":173,"children":174},{},[],{"type":42,"value":176},"\nLes 90 développeurs ont un background plutot métier. Ce sont avant tout des experts métiers.",{"type":29,"tag":45,"props":178,"children":179},{},[],{"type":42,"value":181},"\nIl y a également 5 personnes qui travaillent sur le test du logiciel.",{"type":29,"tag":45,"props":183,"children":184},{},[],{"type":42,"value":186},"\nLa base de code actuelle est supérieur a 10M de lignes de code. Chaque programme est indépendant et inclut de très nombreuses librairies écrites sur les 40 dernières années. Certains programmes font donc plus de 10 000 lignes à eux tout seul.",{"type":29,"tag":45,"props":188,"children":189},{},[],{"type":42,"value":191},"\nD'ailleurs parfois le compilateur échoue car le nombre de lignes de code est devenu trop important. Il faut supprimer certaines parties pour faire passer la compilation (compilateur qui n'est plus maintenu).",{"type":29,"tag":45,"props":193,"children":194},{},[],{"type":42,"value":196},"\nLe logiciel est vendu on premise, déployé chez les clients. Les clients grognent un peu de devoir maintenir un parc Mainframe qui est couteux pour eux (le mainframe est couteux mais l'expertise pour le maintenir aussi). La nature même des clients, évoluant dans la banque, fait qu'il est nécessaire de maintenir de nombreuses versions car ils ne mettent pas à jour régulièrement leur parc. \"",{"type":29,"tag":51,"props":198,"children":200},{"id":199},"de-nombreux-sujets-de-discussion-possibles",[201],{"type":42,"value":202},"De nombreux sujets de discussion possibles",{"type":29,"tag":30,"props":204,"children":205},{},[206,208,211,213,216,218,221,223,226],{"type":42,"value":207},"Le scénario pouvait évoluer en fonction des candidats ou de notre imagination du moment.",{"type":29,"tag":45,"props":209,"children":210},{},[],{"type":42,"value":212},"\nSi vous lisez entre les lignes il y a de nombreux thèmes abordables : RH, conduite du changement, problématiques technique, d'organisation etc…",{"type":29,"tag":45,"props":214,"children":215},{},[],{"type":42,"value":217},"\nUne personne orientée process pourrait parler de la séparation actuelle des équipes et de la communication entre équipes socle, déploiement et métier.",{"type":29,"tag":45,"props":219,"children":220},{},[],{"type":42,"value":222},"\nCertains vont parler des tests. D'autres vont parler du déploiement etc…",{"type":29,"tag":45,"props":224,"children":225},{},[],{"type":42,"value":227},"\nPeu importe, il n'y a pas de bonnes réponses mais ce qui est intéressant c'est de voir l'angle choisie.",{"type":29,"tag":30,"props":229,"children":230},{},[231,233,236,238,241,243,246,248,251,253,256],{"type":42,"value":232},"Peu importe le sujet et les différentes variations que nous y avons apporté au cours du temps, c'est ici que les choses intéressantes commencent.",{"type":29,"tag":45,"props":234,"children":235},{},[],{"type":42,"value":237},"\nCertains candidats vont poser beaucoup de questions, d'autres aucune.",{"type":29,"tag":45,"props":239,"children":240},{},[],{"type":42,"value":242},"\nCertains, rares, décideront de présenter leur proposition sans prendre aucun temps de réflexion préalable.",{"type":29,"tag":45,"props":244,"children":245},{},[],{"type":42,"value":247},"\nRien que ces étapes peut en apprendre beaucoup sur les personnes, leur mode de réflexion, leurs méthodologies.",{"type":29,"tag":45,"props":249,"children":250},{},[],{"type":42,"value":252},"\nJe ne vais pas faire d'analyse basique du type : s'il pose trop de question alors… s'il n'en pose pas alors…",{"type":29,"tag":45,"props":254,"children":255},{},[],{"type":42,"value":257},"\nCet exercice faisait partie d'un entretien en 4 étapes. C'est sur la totalité de l'entretien que l'on se fait un avis.",{"type":29,"tag":30,"props":259,"children":260},{},[261,263,266,268,271],{"type":42,"value":262},"Si on parle technique il est très intéressant de noter que les \"juniors\" proposent tous systématiquement de recoder la totalité de l'application dans un langage récents et de faire tourner cela sur le cloud.",{"type":29,"tag":45,"props":264,"children":265},{},[],{"type":42,"value":267},"\nLes plus seniors adoptent souvent des approches plus modulaires pour essayer d'extraire des fonctionnalités (les fameux programmes) quitte à avoir deux applications différentes et une migration longue dans le temps.",{"type":29,"tag":45,"props":269,"children":270},{},[],{"type":42,"value":272},"\nQuelque soit l'expérience, le mot legacy fait flipper 90% des gens.",{"type":29,"tag":30,"props":274,"children":275},{},[276,278,281,283,289,291,294,296,299,301,306],{"type":42,"value":277},"Il y a de très nombreuses questions possibles ensuite pour le candidat. Elles ne sont pas là pour piéger mais pour voir comment il/elle réagit et réfléchit.",{"type":29,"tag":45,"props":279,"children":280},{},[],{"type":42,"value":282},"\nPar exemple \"",{"type":29,"tag":284,"props":285,"children":286},"em",{},[287],{"type":42,"value":288},"Selon toi, combien de temps cela prendra de migrer 10M de lignes de code ?",{"type":42,"value":290},"\" peut entraîner de super discussions sur la faisabilité même de ce type d'approche.",{"type":29,"tag":45,"props":292,"children":293},{},[],{"type":42,"value":295},"\nCertains vont parler des solutions de transpilage, d'autres de couches d'anti corruption, de tests boite noire pour mesurer les effets de bord etc…",{"type":29,"tag":45,"props":297,"children":298},{},[],{"type":42,"value":300},"\n\"",{"type":29,"tag":284,"props":302,"children":303},{},[304],{"type":42,"value":305},"Mais que vont devenir les 90 développeurs métiers si vous changez leur langage en Java/Scala/C++ etc.. ?",{"type":42,"value":307},"\" n'a rien à voir avec de la technique mais peut apprendre des choses sur la personne.",{"type":29,"tag":30,"props":309,"children":310},{},[311,313,316],{"type":42,"value":312},"Bref, l'exercice peut être très riche. Ce n'était pas une condition sine qua non pour réussir. J'ai eu des candidats qui n'ont pas été brillants sur cette partie mais qui ont été pris car sur l'ensemble ils ont su tiré leur épingle du jeu.",{"type":29,"tag":45,"props":314,"children":315},{},[],{"type":42,"value":317},"\nMais pour certains ca a été le petit truc en plus ou en moins lors de la décision finale.",{"type":29,"tag":51,"props":319,"children":321},{"id":320},"que-sest-il-passé-en-vrai",[322],{"type":42,"value":323},"Que s'est-il passé en vrai ?",{"type":29,"tag":30,"props":325,"children":326},{},[327,329,332,334,337],{"type":42,"value":328},"Petit bonus pour ceux qui ont suivi jusque là, j'ai promis à ceux qui ont passé le test de leur dire un jour comment cette situation a été abordé dans la vie réelle par la société dont je me suis inspiré.",{"type":29,"tag":45,"props":330,"children":331},{},[],{"type":42,"value":333},"\nC'est le moment.",{"type":29,"tag":45,"props":335,"children":336},{},[],{"type":42,"value":338},"\nJe vais cependant rester assez flou pour ne trahir aucun secret industriel. Je ne vous dirais pas si j'ai directement bossé pour cette société ou seulement observé de l'extérieur. Je ne vous donnerais pas mon rôle sur ces sujets. Je ne vous donnerais pas sa localisation, ni de noms et si vous la reconnaissez, merci de ne pas l'indiquer.",{"type":29,"tag":30,"props":340,"children":341},{},[342,344,347],{"type":42,"value":343},"Cette société XXX a donc bien existé. Son logiciel est effectivement très ancien et dans les grandes lignes, la description technique était relativement fidèle. En pratique la société XXX proposait aussi son logiciel en mode hébergé mais c'est sans importance pour la suite.",{"type":29,"tag":45,"props":345,"children":346},{},[],{"type":42,"value":348},"\nCe n'était pas du Mainframe mais quelque chose de relativement équivalent (gros serveur tout en un) et je continuerais à parler de Mainframe pour la suite.",{"type":29,"tag":30,"props":350,"children":351},{},[352],{"type":42,"value":353},"Comme vous l'aurez deviné dans l'énoncé initial, l'un des gros sujets c'était l'utilisation de ce langage ancien. Il y avait de nombreux autres challenges mais l'énoncé insistait particulièrement sur celui-ci.",{"type":29,"tag":30,"props":355,"children":356},{},[357,359,362],{"type":42,"value":358},"Le problème n'était cependant pas que ce soit un vieux langage, en soit, ce n'est pas un problème.",{"type":29,"tag":45,"props":360,"children":361},{},[],{"type":42,"value":363},"\nUn langage ne devient pas inadapté parce qu'il est ancien. Il devient risqué par contre s'il n'est plus maintenu. Et le compilateur commençait à montrer des signes de faiblesse au regard de la taille du code. De même, le fait qu'il ne soit plus maintenu indiquait qu'il ne pouvait tourner que sur des machines obsolètes, elles aussi plus maintenues et là commence le cercle vicieux, quid des bases de données, des standards de chiffrement etc…",{"type":29,"tag":30,"props":365,"children":366},{},[367,369,372,374,377,379,382,384,387,389,398,400,403],{"type":42,"value":368},"Pour situer le contexte, cette entreprise est très importante sur son marché. Et cette position dominante s'est, en partie, construite sur l'échec de certains concurrents à se moderniser.",{"type":29,"tag":45,"props":370,"children":371},{},[],{"type":42,"value":373},"\nDe nombreux concurrents dans des situations similaires ont tenté de tout refaire de zéro et ont échoué ce qui a permis a XXX de prendre le marché.",{"type":29,"tag":45,"props":375,"children":376},{},[],{"type":42,"value":378},"\nJe caricature bien sûr. Je fais ce que je veux c'est mon billet de blog ;)",{"type":29,"tag":45,"props":380,"children":381},{},[],{"type":42,"value":383},"\nToujours est-il que cela a provoqué bien sûr une certaine réticence, fondée, sur l'approche \"rewrite from scratch\".",{"type":29,"tag":45,"props":385,"children":386},{},[],{"type":42,"value":388},"\nJe vous invite ",{"type":29,"tag":390,"props":391,"children":395},"a",{"href":392,"rel":393},"https://www.joelonsoftware.com/2000/04/06/things-you-should-never-do-part-i/",[394],"nofollow",[396],{"type":42,"value":397},"à lire Joel Spolsky",{"type":42,"value":399}," sur le même sujet : )",{"type":29,"tag":45,"props":401,"children":402},{},[],{"type":42,"value":404},"\nPour autant, il fallait trouver des solutions.",{"type":29,"tag":30,"props":406,"children":407},{},[408,410,413,415,418,420,423],{"type":42,"value":409},"La première initiative de cette société a été de rétro ingéniéré l'environnement d'execution pour comprendre ce que faisait chaque instruction machine et les recoder dans un autre système. Une machine virtuelle a été reconstruite (un peu comme une JVM) en Python capable de faire fonctionner un executable produit par le compilateur.",{"type":29,"tag":45,"props":411,"children":412},{},[],{"type":42,"value":414},"\nC'est déjà un tour de force en soit qui a permis de faire fonctionner ce vieux progiciel ailleurs que sur mainframe et même mieux, sur tout système supportant python : redhat, sunos, aix, osf1, hpux etc… Le code restant inchangé.",{"type":29,"tag":45,"props":416,"children":417},{},[],{"type":42,"value":419},"\nC'est déjà une étape très importante, mais imaginez les autres possibilités. A partir de là, vous pouvez reprendre la main par exemple sur tout les appels à la base de données pour les faire passer par un pool de connexion, concept inexistant jusque là. Et c'est un exemple parmi d'autres.",{"type":29,"tag":45,"props":421,"children":422},{},[],{"type":42,"value":424},"\nA cette étape, les développeurs continuaient par contre de travailler sur Mainframe car la compilation et la définition de l'interface se passait toujours là.",{"type":29,"tag":30,"props":426,"children":427},{},[428,430,433],{"type":42,"value":429},"Seconde étape, l'idée était de sortir de la logique classique mainframe pour éviter que chaque utilisateur final n'ait à se connecter à des gros serveurs applicatifs. C'était en effet une époque ou chaque utilisateur se connectait sur un terminal qui n'était qu'une fenêtre sur un processus qui s’exécutait sur un serveur central.",{"type":29,"tag":45,"props":431,"children":432},{},[],{"type":42,"value":434},"\nSi vous n'avez jamais vu des écrans type AS400 ou Mainframe, ca ressemble à ca :",{"type":29,"tag":30,"props":436,"children":437},{},[438],{"type":29,"tag":34,"props":439,"children":441},{"alt":7,"src":440},"/images/03ep051.png",[],{"type":29,"tag":30,"props":443,"children":444},{},[445,447,450,452,455,457,460,462,465],{"type":42,"value":446},"Il faut voir chaque programme comme étant un ensemble : écran noir et blanc, zone de saisie, logique applicative. Certains écrans ne servant à rien d'autre qu'à lancer un batch.",{"type":29,"tag":45,"props":448,"children":449},{},[],{"type":42,"value":451},"\nUn écran => un programme.",{"type":29,"tag":45,"props":453,"children":454},{},[],{"type":42,"value":456},"\nC'est donc totalement modulaire quand on regarde de plus près.",{"type":29,"tag":45,"props":458,"children":459},{},[],{"type":42,"value":461},"\nLe challenge était de transposer ces écrans en autre chose. Il a été possible de traduire ces écrans (qui ressemblaient finalement beaucoup à des fichiers textes en ascii art) en fichier .class correspondant à des fichiers compilés pour Java et utilisant Swing.",{"type":29,"tag":45,"props":463,"children":464},{},[],{"type":42,"value":466},"\nEnsuite la machine virtuelle Python discutait avec une appli Swing en Java déployé sur les postes clients en JNLP, et pilotait littéralement cette application de facon très simple :",{"type":29,"tag":88,"props":468,"children":469},{},[470,475],{"type":29,"tag":92,"props":471,"children":472},{},[473],{"type":42,"value":474},"ouvre le programme MACHIN forcait le chargement distant d'une classe représentant l'interface via un class loader http",{"type":29,"tag":92,"props":476,"children":477},{},[478],{"type":42,"value":479},"chaque instruction : \"met le focus sur un champ\", \"saisie un champ\", \"controle le champ\", \"valide un bouton\" correspondait à des échanges de protocoles Java \u003C-> Python \u003C-> ancien langage dont il faut taire le nom sur http et tcp.",{"type":29,"tag":30,"props":481,"children":482},{},[483],{"type":42,"value":484},"Bref, il devenait possible de faire travailler les utilisateurs sur une interface Java qui pouvait tourner sur n'importe quel OS. Et la on parle d'utilisateurs finaux donc en réalité, cela tournait majoritairement sur windows.",{"type":29,"tag":30,"props":486,"children":487},{},[488,490,493],{"type":42,"value":489},"L'étape suivante était de reprendre la main sur le compilateur lui même. Et pour cela, il y a eu en premier lieu un parseur syntaxique qui a permis de monter les programmes dans un arbre AST.",{"type":29,"tag":45,"props":491,"children":492},{},[],{"type":42,"value":494},"\nCe tout premier bout a déjà permis une énorme évolution, il a été possible de construire un plugin Eclipse qui permettait de lire le code et de bénéficier de tout les outillages classiques :",{"type":29,"tag":88,"props":496,"children":497},{},[498],{"type":29,"tag":92,"props":499,"children":500},{},[501,503,506,508,511],{"type":42,"value":502},"controle syntaxique et mise en couleur, suivi des appels de fonction etc…",{"type":29,"tag":45,"props":504,"children":505},{},[],{"type":42,"value":507},"\nLe plugin téléchargeait le code en local, effectuait des synchonisation régulière avec le serveur mainframe, lancait la compilation sur mainframe et rapatriait les rapports d'erreurs éventuels sur le poste client pour souligner les erreurs de compil.",{"type":29,"tag":45,"props":509,"children":510},{},[],{"type":42,"value":512},"\nBref, plus besoin de passer par le mainframe (enfin presque mais je passe les détails).",{"type":29,"tag":30,"props":514,"children":515},{},[516],{"type":42,"value":517},"Je ne connais pas la suite de l'histoire hormis que Java/Swing/JNLP a été abandonné pour faire du pur web. Le compilateur semble avoir été finalisé depuis. Et vu les personnes qui étaient dessus, je suis sûr que le boulot est super.",{"type":29,"tag":30,"props":519,"children":520},{},[521],{"type":42,"value":522},"Ces solutions ont mis des années à se mettre en place. Elles ont nécessité de grandes discussions, ont eu des conséquences importantes de conduite de changement, autant en interne qu'en externe. Je passe des détails mais cela reste de très bonnes références à mes yeux en terme de savoir faire, de décisions technologiques etc… Et bien sûr l'entretien mentionné plus haut ne visait pas à résumer tout cela en 15 minutes.",{"type":29,"tag":30,"props":524,"children":525},{},[526,528,531],{"type":42,"value":527},"Et sinon, oui le legacy ca peut faire peur, tout autant que le mot TMA. Sur le papier, pour beaucoup, c'est moins sexy que de créer une nouvelle appli TODO list avec le énième framework à la mode déployé sur GCP.",{"type":29,"tag":45,"props":529,"children":530},{},[],{"type":42,"value":532},"\nEt pourtant, sur ce projet vous auriez vu un grand panel de sujets techniques et humains pointus. C'est justement dans un produit qui vit, qui a des utilisateurs que l'on peut rencontrer les meilleurs challenges.",{"title":7,"searchDepth":534,"depth":534,"links":535},2,[536,537,538,539],{"id":53,"depth":534,"text":56},{"id":124,"depth":534,"text":127},{"id":199,"depth":534,"text":202},{"id":320,"depth":534,"text":323},"markdown","content:articles:2020:07:20:rewrite-from-scratch.md","content","articles/2020/07/20/rewrite-from-scratch.md","md",1699824929819]