[{"data":1,"prerenderedAt":515},["Reactive",2],{"/articles/2020/07/27/produit-versus-side-project":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"date":11,"categories":12,"tags":14,"cover":16,"readingTime":17,"body":22,"_type":510,"_id":511,"_source":512,"_file":513,"_extension":514},"/articles/2020/07/27/produit-versus-side-project","27",false,"","Produit versus Side Project","Après maintenant quelques années sur Malt, j'aimerais revenir sur un sujet qui revient souvent sur l...","1552","2020-07-27",[13],"waza",[15],"product","Refaire_facebook_en_best_effort.jpg",{"text":18,"minutes":19,"time":20,"words":21},"9 min read",8.735,524100,1747,{"type":23,"children":24,"toc":501},"root",[25,35,78,88,93,100,125,131,141,147,152,172,187,193,198,213,218,238,258,263,276,281,296,301,310,325,330,343,348,354,374,394,399,414,421,427,442,452,471,496],{"type":26,"tag":27,"props":28,"children":29},"element","p",{},[30],{"type":26,"tag":31,"props":32,"children":34},"img",{"alt":7,"src":33},"/images/Refaire_facebook_en_best_effort.jpg",[],{"type":26,"tag":27,"props":36,"children":37},{},[38,41,45,47,50,52,55,57,66,68,71,73,76],{"type":39,"value":40},"text","Après maintenant quelques années sur Malt, j'aimerais revenir sur un sujet qui revient souvent sur la différence entre side project et produit.",{"type":26,"tag":42,"props":43,"children":44},"br",{},[],{"type":39,"value":46},"\nEn 2010, j'avais lancé un side project, Localizeyourapps, et j'ai voulu en faire un produit.",{"type":26,"tag":42,"props":48,"children":49},{},[],{"type":39,"value":51},"\nTout ne s'est pas passé comme prévu, mais pour être franc, avec le recul, c'était plutôt prévisible.",{"type":26,"tag":42,"props":53,"children":54},{},[],{"type":39,"value":56},"\nEn 2013, je tentais d'en faire un retour d'expérience et je présentais \"",{"type":26,"tag":58,"props":59,"children":63},"a",{"href":60,"rel":61},"https://humantalks.com/talks/256-epic-fail",[62],"nofollow",[64],{"type":39,"value":65},"Epic Fail",{"type":39,"value":67},"\" lors d'un Human Talk.",{"type":26,"tag":42,"props":69,"children":70},{},[],{"type":39,"value":72},"\nEn fin de compte, c'était trop tôt. Et je reste sur ma faim quant à cette présentation que je trouve très partielle et peu aboutie.",{"type":26,"tag":42,"props":74,"children":75},{},[],{"type":39,"value":77},"\nJe propose donc de revenir dessus, mais en insistant sur un angle en particulier, la différence entre side project et produit.",{"type":26,"tag":27,"props":79,"children":80},{},[81,83,86],{"type":39,"value":82},"Retour en 2010, Localizeyourapps était une application en SAAS permettant de localiser son application. Vous pouviez y déverser vos fichiers de ressources et les traduire en ligne. Il y avait peu d'applications similaires à l'époque.",{"type":26,"tag":42,"props":84,"children":85},{},[],{"type":39,"value":87},"\nAujourd'hui, ce serait l'équivalent d'un Phraseapp, Crowdin ou Transifex, mais avec quelques années d'avance ;)",{"type":26,"tag":27,"props":89,"children":90},{},[91],{"type":39,"value":92},"Si le projet n'a pas fonctionné, on pourrait citer de nombreuses raisons. Je vais commencer par les plus triviales.",{"type":26,"tag":94,"props":95,"children":97},"h2",{"id":96},"ce-nétait-pas-assez-novateur",[98],{"type":39,"value":99},"Ce n'était pas assez novateur",{"type":26,"tag":27,"props":101,"children":102},{},[103,105,108,110,113,115,118,120,123],{"type":39,"value":104},"Non je plaisante.",{"type":26,"tag":42,"props":106,"children":107},{},[],{"type":39,"value":109},"\nCe n'était pas le premier produit de cette nature je pense. Mais ce n'est pas vraiment le sujet. A l'époque, j'ai bien eu des personnes pour me dire que, bon, il y avait des outils desktop comme Poeditor et qu'un SAAS ça servirait à personne.",{"type":26,"tag":42,"props":111,"children":112},{},[],{"type":39,"value":114},"\nVous aurez toujours des personnes pour dire que \"ça existe déjà\". Mais le sujet n'est pas là, enfin, pas uniquement.",{"type":26,"tag":42,"props":116,"children":117},{},[],{"type":39,"value":119},"\nJe reviendrais plus tard dans un autre billet sur le sujet des remake/copycat.",{"type":26,"tag":42,"props":121,"children":122},{},[],{"type":39,"value":124},"\nDonc oubliez cette raison, d'autant que, sans me jeter des fleurs, c'était au contraire plutôt bien pensé pour l'époque et que des produits similaires ont fini par s'imposer et faire de belles boîtes par la suite.",{"type":26,"tag":94,"props":126,"children":128},{"id":127},"techniquement-il-manquait-quelques-finitions",[129],{"type":39,"value":130},"Techniquement il manquait quelques finitions",{"type":26,"tag":27,"props":132,"children":133},{},[134,136,139],{"type":39,"value":135},"Non plus. A l'époque je le pensais oui. Mais ce n'était pas le cas. Comme beaucoup de techs, j'avais à cœur d'avoir un produit parfait et je passais de version alpha, à bêta, bêta 2, bêta 3...",{"type":26,"tag":42,"props":137,"children":138},{},[],{"type":39,"value":140},"\nPour l'anecdote, j'ai eu plusieurs sociétés qui sont venues pro-activement me voir et qui ont utilisé le SAAS pour leurs besoins. C'était des agences mobiles/agences web ou des personnes qui bossaient à Bruxelles et Strasbourg pour des entités gouvernementales. Et de mon côté, je n'écoutais pas vraiment ce qu'ils avaient à dire, je ne facturais rien car je visais une énième version beta. Autrement, je ne me serais senti pas à l'aise de facturer un produit que je considérais non fini.",{"type":26,"tag":94,"props":142,"children":144},{"id":143},"en-réalité-cétait-un-side-project",[145],{"type":39,"value":146},"En réalité c'était un side project",{"type":26,"tag":27,"props":148,"children":149},{},[150],{"type":39,"value":151},"La véritable raison, c'est que j'en faisais un side project et non un produit.",{"type":26,"tag":27,"props":153,"children":154},{},[155,157,160,162,165,167,170],{"type":39,"value":156},"Un side project c'est un projet qu'on réalise à côté, le soir, le week end. C'est un extra en dehors d'une autre activité.",{"type":26,"tag":42,"props":158,"children":159},{},[],{"type":39,"value":161},"\nOn le fait sans contraintes en mode best effort.",{"type":26,"tag":42,"props":163,"children":164},{},[],{"type":39,"value":166},"\nEt si j'arrive à une conclusion désormais, c'est que dans beaucoup de sujets, le mode best effort c'est le meilleur moyen d'échouer.",{"type":26,"tag":42,"props":168,"children":169},{},[],{"type":39,"value":171},"\nEt ça vaut pour les projets persos ou les projets en entreprise.",{"type":26,"tag":27,"props":173,"children":174},{},[175,177,180,182,185],{"type":39,"value":176},"Donc la première leçon que j'en ai tirée, un produit ça demande un investissement permanent.",{"type":26,"tag":42,"props":178,"children":179},{},[],{"type":39,"value":181},"\nIl faut être dessus à 100% et se lever chaque matin en se demandant comment en faire un succès.",{"type":26,"tag":42,"props":183,"children":184},{},[],{"type":39,"value":186},"\nEt pour çà, il faut des contraintes.",{"type":26,"tag":94,"props":188,"children":190},{"id":189},"la-contrainte",[191],{"type":39,"value":192},"La contrainte",{"type":26,"tag":27,"props":194,"children":195},{},[196],{"type":39,"value":197},"Les éléments les plus importants quand on veut réussir, c'est :",{"type":26,"tag":199,"props":200,"children":201},"ul",{},[202,208],{"type":26,"tag":203,"props":204,"children":205},"li",{},[206],{"type":39,"value":207},"de fixer un objectif ambitieux",{"type":26,"tag":203,"props":209,"children":210},{},[211],{"type":39,"value":212},"avoir des contraintes",{"type":26,"tag":27,"props":214,"children":215},{},[216],{"type":39,"value":217},"Fixer un objectif ambitieux, je ne m'étendrais pas dessus. Mais globalement je reprends la citation d'Oscar Wilde : \"Il faut toujours viser la lune, car même en cas d’échec, on atterrit dans les étoiles \"",{"type":26,"tag":27,"props":219,"children":220},{},[221,223,226,228,231,233,236],{"type":39,"value":222},"Avoir des contraintes, c'est se poser les bases pour être efficace et inventif.",{"type":26,"tag":42,"props":224,"children":225},{},[],{"type":39,"value":227},"\nPar exemple travailler à 100% sur un produit sans salaire mais avec un matelas financier pour tenir 6 mois, ça vous force à penser efficacité et revenu financier.",{"type":26,"tag":42,"props":229,"children":230},{},[],{"type":39,"value":232},"\nCette contrainte va vous obliger à faire des choix et vous forcera à trouver rapidement un modèle de revenus.",{"type":26,"tag":42,"props":234,"children":235},{},[],{"type":39,"value":237},"\nVous éviterez d'itérer sur des versions bêta à n'en plus finir et vous allez vous concentrer sur l'essentiel.",{"type":26,"tag":27,"props":239,"children":240},{},[241,243,246,248,251,253,256],{"type":39,"value":242},"A l'inverse, j'ai fait l'erreur pour Localizeyourapps de me dire que j'allais continuer à bosser par ailleurs en gagnant bien ma vie, et utiliser cet argent pour financer mon temps libre sur mon side project.",{"type":26,"tag":42,"props":244,"children":245},{},[],{"type":39,"value":247},"\nCombien de personnes j'ai croisé depuis 20 ans qui me disent la même chose, \"je fais du freelancing/presta qui ne m'intéresse pas pour travailler sur un side project 1 jour par semaine et en vivre dans 1 an\" ? Beaucoup, assurément.",{"type":26,"tag":42,"props":249,"children":250},{},[],{"type":39,"value":252},"\nSi vous gagnez bien votre vie par ailleurs, qu'est ce qui vous motivera à dédier vraiment du temps sur votre side project ?",{"type":26,"tag":42,"props":254,"children":255},{},[],{"type":39,"value":257},"\nSi vous passez un jour par semaine, comment allez-vous éviter la lassitude au bout de 6 mois à avancer comme une tortue sans en voir le bout ? Ou le burnout d'ailleurs, si vous y passez vos week ends et congés.",{"type":26,"tag":27,"props":259,"children":260},{},[261],{"type":39,"value":262},"Une contrainte ça peut être une date.",{"type":26,"tag":199,"props":264,"children":265},{},[266,271],{"type":26,"tag":203,"props":267,"children":268},{},[269],{"type":39,"value":270},"Vous vous donnez 6 mois pour prendre une décision.",{"type":26,"tag":203,"props":272,"children":273},{},[274],{"type":39,"value":275},"Vous avez une contrainte pour sortir l'application pour le 30 février au plus tard",{"type":26,"tag":27,"props":277,"children":278},{},[279],{"type":39,"value":280},"Cela force à faire des choix, couper des choses, garder l'essentiel. Et cela force à être inventif.",{"type":26,"tag":27,"props":282,"children":283},{},[284,286,289,291,294],{"type":39,"value":285},"Cette notion de contrainte est cruciale, y compris pour une entreprise déjà implantée.",{"type":26,"tag":42,"props":287,"children":288},{},[],{"type":39,"value":290},"\nJ'ai participé à certains projets pharaoniques, largement financé, sans date, avec un scope très large. Et ce qui devait arriver arriva, rien n'est sorti malgré des armées de gens talentueux dessus.",{"type":26,"tag":42,"props":292,"children":293},{},[],{"type":39,"value":295},"\nMême une \"petite\" équipe projet de 5 personnes pendant 6 mois, ça représente entre 250 et 500k. Entre 1/4 et 1/2 millions d'euros. Ne pas avoir de date, de scope, d'objectifs chiffrés, c'est un risque de perte d'argent plutôt important.",{"type":26,"tag":27,"props":297,"children":298},{},[299],{"type":39,"value":300},"A l'opposé, dans des contextes d'intraprenariat, vous avez des sociétés qui fonctionnent avec des systèmes de bourse et de contraintes.",{"type":26,"tag":302,"props":303,"children":304},"disclaimer",{},[305],{"type":26,"tag":27,"props":306,"children":307},{},[308],{"type":39,"value":309},"Je vais citer ici des entreprise, et je suis conscient qu'il y a le mythe (ce qu'elles ont raconté dans la presse) et la réalité. Ne me tenez pas rigueur si jamais ce n'est plus comme ça ou si ça ne l'a jamais été, c'est le concept qui nous intéresse ici.",{"type":26,"tag":27,"props":311,"children":312},{},[313,315,318,320,323],{"type":39,"value":314},"Chez Gore (exemple issu du livre \"future of management\" de Gary Hamel), il est possible pour chaque employé de proposer une idée d'innovation et si on est convaincant, d'obtenir un budget pour tester un projet sur X mois. Au bout de ce délai, si le projet réussit, l'entreprise continue d'investir, sinon on jette. C'est ainsi que l'entreprise Gore s'est lancé dans la fabrication de cordes de guitares.",{"type":26,"tag":42,"props":316,"children":317},{},[],{"type":39,"value":319},"\nChez Valve, idem, un employé doit convaincre ses collègues de travailler sur une idée et s'il réussit, ils vont avoir un temps/budget limité pour démontrer un résultat.",{"type":26,"tag":42,"props":321,"children":322},{},[],{"type":39,"value":324},"\nSur beta.gouv.fr, l'idée est d'avoir une enveloppe de 6 mois, à 5, pour présenter un MVP qui aura des utilisateurs, sinon, le projet est abandonné.",{"type":26,"tag":27,"props":326,"children":327},{},[328],{"type":39,"value":329},"Bref, pour caricaturer, il y a donc deux extrêmes qui ne marchent pas :",{"type":26,"tag":199,"props":331,"children":332},{},[333,338],{"type":26,"tag":203,"props":334,"children":335},{},[336],{"type":39,"value":337},"le mode best effort, sans moyen, sans temps alloué",{"type":26,"tag":203,"props":339,"children":340},{},[341],{"type":39,"value":342},"la profusion de moyens et l'absence de contraintes",{"type":26,"tag":27,"props":344,"children":345},{},[346],{"type":39,"value":347},"Et pour transformer un side project en produit, il faut viser la solution médiane : être à 100% et avoir des contraintes.",{"type":26,"tag":94,"props":349,"children":351},{"id":350},"différence-entre-prototype-technologique-et-produit-vendu",[352],{"type":39,"value":353},"Différence entre prototype technologique et produit vendu",{"type":26,"tag":27,"props":355,"children":356},{},[357,359,362,364,367,369,372],{"type":39,"value":358},"Je disais plus haut que si Localizeyourapps a échoué, c'est parce qu'il n'était qu'un side project.",{"type":26,"tag":42,"props":360,"children":361},{},[],{"type":39,"value":363},"\nJ'ai insisté sur l'investissement en temps et sur le fait de se fixer des contraintes.",{"type":26,"tag":42,"props":365,"children":366},{},[],{"type":39,"value":368},"\nJ'insisterais également sur le fait qu'un produit fait par des tech/devs ressemble souvent plus à un prototype technologique, une vitrine de savoir faire, bien avant d'être un produit à vendre.",{"type":26,"tag":42,"props":370,"children":371},{},[],{"type":39,"value":373},"\nC'est aussi une leçon que j'ai appris durant cette période où je continuais à faire évoluer cette application.",{"type":26,"tag":27,"props":375,"children":376},{},[377,379,382,384,387,389,392],{"type":39,"value":378},"En 2011, je co-fondais Lateral-thoughts. C'est une ESN un peu particulière, fondée sur des principes d'entreprise libéré. Un des objectifs était justement de financer des produits par la prestation faite à côté. Exactement ce que je disais plus haut qui ne marche pas :)",{"type":26,"tag":42,"props":380,"children":381},{},[],{"type":39,"value":383},"\nEt sans surprise, LT n'est pas devenu éditeur de logiciels.",{"type":26,"tag":42,"props":385,"children":386},{},[],{"type":39,"value":388},"\nPourtant au sein de LT (pour les intimes), de nombreux side project de qualité ont été créés.",{"type":26,"tag":42,"props":390,"children":391},{},[],{"type":39,"value":393},"\nEn fait si, l'un d'entre eux a fonctionné : Hopwork, le futur Malt.",{"type":26,"tag":27,"props":395,"children":396},{},[397],{"type":39,"value":398},"Sa particularité, c'est qu'il a été démarré avec une personne externe à LT, Vincent Huguet, qui a amené l'idée mais aussi des compétences complémentaires.",{"type":26,"tag":27,"props":400,"children":401},{},[402,404,407,409,412],{"type":39,"value":403},"Et s'il y a un autre point qui différencie side project et produit, c'est celui là. Un produit a besoin de compétences diverses pour se vendre. Pour dépasser le cadre du prototype technologique, il a besoin de personnes pour savoir le mettre en valeur, réfléchir aux canaux d'acquisition des clients, au financement, bref, le vendre.",{"type":26,"tag":42,"props":405,"children":406},{},[],{"type":39,"value":408},"\nCombien de fois là encore j'ai vu de super protos technologiques mal vendus. J'ai vu de nombreuses fois des très bonnes idées mais dont la seule méthode pour en faire la promotion est restée Twitter.",{"type":26,"tag":42,"props":410,"children":411},{},[],{"type":39,"value":413},"\nIl y a une certaine forme de naïveté, que j'ai eu également avec Localizeyourapps, qu'en faisant un bon produit et en communiquant dessus sur son réseau et celui de ses amis sur Twitter, c'était le succès assuré.",{"type":26,"tag":27,"props":415,"children":416},{},[417],{"type":26,"tag":31,"props":418,"children":420},{"alt":7,"src":419},"/images/Illustration_sans_titre-647x1024.jpg",[],{"type":26,"tag":94,"props":422,"children":424},{"id":423},"un-produit-demande-plusieurs-corps-de-métier-à-loeuvre",[425],{"type":39,"value":426},"Un produit demande plusieurs corps de métier à l'oeuvre.",{"type":26,"tag":27,"props":428,"children":429},{},[430,432,435,437,440],{"type":39,"value":431},"Si on parle de création de société, je ne suis pas en train de dire qu'il n'est pas possible de créer une société seul. Une personne peut cumuler toutes ces casquettes, c'est possible. Ça reste rare car ça demande une énergie folle et des compétences très variées mais c'est possible. Et c'est pourquoi bien souvent on va se faire assister.",{"type":26,"tag":42,"props":433,"children":434},{},[],{"type":39,"value":436},"\nCa n'est pas obligatoirement par un second associé, ça peut aussi être par des premiers employés.",{"type":26,"tag":42,"props":438,"children":439},{},[],{"type":39,"value":441},"\nIl y a en tout cas plusieurs exemples de solo entrepreneurs : Larry Ellison, Elon Musk, Mark Zuckerberg, Jeff Bezos pour ne citer qu'eux.",{"type":26,"tag":27,"props":443,"children":444},{},[445,447,450],{"type":39,"value":446},"Mais ce sera la seconde leçon que j'ai tiré de Localizeyourapps, il ne faut pas négliger ces autres corps de métier.",{"type":26,"tag":42,"props":448,"children":449},{},[],{"type":39,"value":451},"\nSans produit, on ne vend rien. Mais sans efforts sur la vente, le produit ne se vend pas.",{"type":26,"tag":27,"props":453,"children":454},{},[455,457,460,462,469],{"type":39,"value":456},"Et au-delà la vente, pour certains produits, cela peut demander des compétences financières, légales, etc…",{"type":26,"tag":42,"props":458,"children":459},{},[],{"type":39,"value":461},"\nJe vous invite à lire ce ",{"type":26,"tag":58,"props":463,"children":466},{"href":464,"rel":465},"https://www.makery.info/2020/07/23/quentin-adam-lopen-source-medical-est-une-idee-qui-fera-son-chemin/",[62],[467],{"type":39,"value":468},"très bon retour d'expérience sur la fabrication des machines MakAir",{"type":39,"value":470}," qui illustre plutôt bien ce propos.",{"type":26,"tag":27,"props":472,"children":473},{},[474,476,479,481,484,486,489,491,494],{"type":39,"value":475},"Je termine ici ce billet qui est pour moi un mini rétrospective.",{"type":26,"tag":42,"props":477,"children":478},{},[],{"type":39,"value":480},"\nLocalizeyourapps s'est clos progressivement au cours des premières années de Malt. Ce side project pour lequel j'avais quelques ambitions mais pour lequel je n'avais pas mis les moyens m'a permis d'apprendre beaucoup de choses.",{"type":26,"tag":42,"props":482,"children":483},{},[],{"type":39,"value":485},"\nTout d'abord il m'a rappelé à quel point je reste passionné par le fait de créer un produit et pas juste faire du consulting.",{"type":26,"tag":42,"props":487,"children":488},{},[],{"type":39,"value":490},"\nIl m'a fait comprendre l'importance d'être focalisé sur un objectif, d'accepter d'avoir des contraintes pour sortir de sa zone de confort.",{"type":26,"tag":42,"props":492,"children":493},{},[],{"type":39,"value":495},"\nIl m'a également fait réaliser ce qui ne fonctionne pas quand on raisonne uniquement en terme de produit technologique en négligeant le reste.",{"type":26,"tag":27,"props":497,"children":498},{},[499],{"type":39,"value":500},"A bientôt",{"title":7,"searchDepth":502,"depth":502,"links":503},2,[504,505,506,507,508,509],{"id":96,"depth":502,"text":99},{"id":127,"depth":502,"text":130},{"id":143,"depth":502,"text":146},{"id":189,"depth":502,"text":192},{"id":350,"depth":502,"text":353},{"id":423,"depth":502,"text":426},"markdown","content:articles:2020:07:27:produit-versus-side-project.md","content","articles/2020/07/27/produit-versus-side-project.md","md",1700639688501]