[{"data":1,"prerenderedAt":361},["Reactive",2],{"/articles/2023/03/amenez-ingenieurs-dans-la-salle":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"date":11,"tags":12,"cover":16,"book":17,"language":18,"alternates":19,"readingTime":22,"body":27,"_type":356,"_id":357,"_source":358,"_file":359,"_extension":360},"/articles/2023/03/amenez-ingenieurs-dans-la-salle","03",false,"","Amenez des ingénieurs dans la salle","Les produits de demain ne peuvent se concevoir sans les ingénieurs qui les réalisent, et ce, dès les premières étapes. On ne peut pas vivre dans un monde technologique et ne pas le comprendre.","16","2023-03-01",[13,14,15],"innovation","product","engineering","team-table.jpg","impactfulSoftwareEngineering","fr",[20],{"en":21},"https://eventuallycoding.com/en/2023/03/being-in-the-room",{"text":23,"minutes":24,"time":25,"words":26},"8 min read",7.425,445500,1485,{"type":28,"children":29,"toc":347},"root",[30,38,49,62,69,100,105,110,115,120,126,136,142,147,153,158,164,169,179,193,203,208,236,246,252,266,271,281,286,291,321,326],{"type":31,"tag":32,"props":33,"children":34},"element","p",{},[35],{"type":36,"value":37},"text","J'ai commencé ma carrière par un premier stage dans une startup Web en 2001. Je crois m'être ensuite créé une solide expérience en tant que Développeur. Mais tout au long de ma carrière j'ai eu plusieurs expériences qui m'ont fait comprendre qu'il y avait un problème dans la façon dont beaucoup d'entreprises abordent le développement produit.",{"type":31,"tag":32,"props":39,"children":40},{},[41,43,47],{"type":36,"value":42},"Est-ce que vous avez déjà connu ces fameuses décisions produit & tech qui étaient clairement à ne pas faire et qui auraient été évitées facilement en ayant une personne tech dans la salle ?",{"type":31,"tag":44,"props":45,"children":46},"br",{},[],{"type":36,"value":48},"\nC'était trop cher, irréaliste techniquement, totalement opposé à ce qui se pratique sur le marché, pas en adéquation avec les attentes des utilisateurs, ne profitant pas d'une innovation récente. Bref, on aurait pu faire mieux et faire gagner du temps ou de l'argent à l'entreprise.",{"type":31,"tag":50,"props":51,"children":52},"image",{},[53],{"type":31,"tag":32,"props":54,"children":55},{},[56],{"type":31,"tag":57,"props":58,"children":61},"img",{"alt":59,"src":60},"Software engineer not in the room where important decisions are made","/images/not-in-the-room.jpg",[],{"type":31,"tag":63,"props":64,"children":66},"h2",{"id":65},"software-is-eating-the-world",[67],{"type":36,"value":68},"Software is eating the world",{"type":31,"tag":32,"props":70,"children":71},{},[72,74,77,79,82,84,87,89,98],{"type":36,"value":73},"Vous connaissez sans doute cette expression “Software is eating the world”. Le logiciel s'insère partout aujourd'hui dans notre quotidien. Il vous suit sur votre mobile, au travail, dans les transports.",{"type":31,"tag":44,"props":75,"children":76},{},[],{"type":36,"value":78},"\nSi certaines entreprises parlent encore à tort de centre de coût lorsqu'elles parlent des équipes produit, combien d'entre elles seraient totalement inopérantes sans ces équipes ?",{"type":31,"tag":44,"props":80,"children":81},{},[],{"type":36,"value":83},"\nRégulièrement, on entend parler d'un nouveau secteur qui se voit transformer radicalement par un nouveau Pure player. Nos vies changent continuellement sous cette forte pression technologique depuis quelques décennies. Et je pense que nous ne sommes pas encore prêts aux futures évolutions liées à l'IA.",{"type":31,"tag":44,"props":85,"children":86},{},[],{"type":36,"value":88},"\nSur ce thème, je vous invite à lire le livre de Kai-Fu Lee, ",{"type":31,"tag":90,"props":91,"children":95},"a",{"href":92,"rel":93},"https://www.aisuperpowers.com/",[94],"nofollow",[96],{"type":36,"value":97},"AI superpowers",{"type":36,"value":99},", disponible aussi en français.",{"type":31,"tag":32,"props":101,"children":102},{},[103],{"type":36,"value":104},"Mais comment ça se fait, que malgré cela, on continue de voir des équipes Produits qui travaillent sans impliquer les ingénieurs qui vont réaliser ces solutions ?",{"type":31,"tag":32,"props":106,"children":107},{},[108],{"type":36,"value":109},"Dans certains environnements la tech exécute et c'est tout. C'est bien dommage, car bien au-delà de savoir écrire du code ou de monter des usines logicielles, la première compétence d'un(e) \"Ingénieur logiciel\" (je ne parle pas de diplôme, mais de rôle), c'est de résoudre des problèmes, et de concevoir des solutions.",{"type":31,"tag":32,"props":111,"children":112},{},[113],{"type":36,"value":114},"Les produits de demain ne peuvent se concevoir sans les ingénieurs qui les réalisent, et ce, dès les premières étapes. On ne peut pas vivre dans un monde technologique et ne pas le comprendre. Les équipes qui ne le saisissent pas partent avec un sérieux désavantage. Je ne parle pas de respecter un état de l'art ou de qualité logicielle, je parle de se procurer un avantage concurrentiel sur un marché qui évolue rapidement et qui est rempli d'incertitudes. Ces dernières années nous ont montré à quel point le monde peut changer radicalement en très peu de temps.",{"type":31,"tag":32,"props":116,"children":117},{},[118],{"type":36,"value":119},"Mais pour ça, il faut que les équipes Engineering soient présentes dans cette fameuse salle où on prend des décisions. Et j'ai connu plusieurs situations où ce n'était pas le cas, pour de multiples raisons.",{"type":31,"tag":63,"props":121,"children":123},{"id":122},"des-seniors-pas-conscient-de-leur-rôle",[124],{"type":36,"value":125},"Des Seniors pas conscient de leur rôle",{"type":31,"tag":32,"props":127,"children":128},{},[129,131,134],{"type":36,"value":130},"Si on considère uniquement les compétences techniques, j'ai connu de très bons ingénieurs, mais qui ne comprenaient pas leur rôle. Ces personnes ne voyaient pas l'entreprise dans son ensemble et n'arrivaient pas à voir comment créer de l'impact. La gestion de leur temps était problématique, que ce soit sur la façon de l'organiser, de le prioriser. Elles finissaient quelques fois par se cramer, tout en ne travaillant jamais sur les sujets importants.",{"type":31,"tag":44,"props":132,"children":133},{},[],{"type":36,"value":135},"\nParfois, ces personnes avaient les bonnes intuitions, voyaient ce qu'il fallait faire, mais ne savaient pas communiquer, voire considéraient que ce n'était pas leur job de faire aboutir ces idées.",{"type":31,"tag":63,"props":137,"children":139},{"id":138},"des-équipes-engineering-patchwork",[140],{"type":36,"value":141},"Des équipes engineering patchwork",{"type":31,"tag":32,"props":143,"children":144},{},[145],{"type":36,"value":146},"Parfois l'action des équipes Engineering est trop floue. Elle semble ne pas avoir de direction claire définie au-delà du RUN. Les équipes ne scalent pas, car le management est trop présent et s'est transformé en Single point of failure, parfois c'est l'inverse les équipes sont autonomes, mais ne suivent aucune vision commune. Le leadership n'arrive pas à créer des équipes efficaces, et là encore il ne parvient pas à s'imposer comme un acteur fiable qui doit participer à la construction du produit.",{"type":31,"tag":63,"props":148,"children":150},{"id":149},"des-organisations-produit-malade",[151],{"type":36,"value":152},"Des organisations produit malade",{"type":31,"tag":32,"props":154,"children":155},{},[156],{"type":36,"value":157},"Dans certains cas, c'est l'organisation toute entière de l'entreprise qui pose souci. Elles parlent d'agilité, mais continuent à faire du waterfall déguisé où l'Engineering est délocalisé, dans un autre immeuble, une autre ville, un autre pays, et jamais consulté. Ce sont aussi des entreprises qui ont parfois trop cédé à la complexité pour faire face à leur croissance, poussé en cela par des armées de consultants certifiés, expert en Scrum, ou pire, SaFe, CMMI et autres horreurs.",{"type":31,"tag":63,"props":159,"children":161},{"id":160},"construire-des-équipes-engineering-qui-créent-de-limpact",[162],{"type":36,"value":163},"Construire des équipes Engineering qui créent de l'impact",{"type":31,"tag":32,"props":165,"children":166},{},[167],{"type":36,"value":168},"Tout cela a formé le terreau de mes convictions personnelles sur la façon d'animer une organisation produit.",{"type":31,"tag":32,"props":170,"children":171},{},[172,174,177],{"type":36,"value":173},"Lorsque j'ai participé à la création de Malt, j'avais deux motivations principales.\nLa première était de bousculer les codes du marché du Consulting/Freelancing, changer les pratiques pour les rendre plus transparentes, déboulonner les intermédiaires, simplifier la vie des freelances.",{"type":31,"tag":44,"props":175,"children":176},{},[],{"type":36,"value":178},"\nMais la seconde raison, c'était de construire une entreprise, dans laquelle j'aurais aimé travailler moi-même en tant que salarié. Et l'un des facteurs, c'était pour moi de créer une culture Engineering et Produit forte, efficace, qui soit le vecteur principal de notre croissance.",{"type":31,"tag":32,"props":180,"children":181},{},[182,184,191],{"type":36,"value":183},"C'est cela que j'ai envie de partager sur les futurs chapitres de ",{"type":31,"tag":90,"props":185,"children":188},{"href":186,"rel":187},"https://eventuallycoding.com/2023/02/impactful-software-engineering",[94],[189],{"type":36,"value":190},"Impactful Software Engineering",{"type":36,"value":192}," dont ce billet de blog est l'introduction. Je souhaite partager ce que j'ai appris durant toutes ces années et permettre à d'autres leaders techniques d'en profiter.",{"type":31,"tag":32,"props":194,"children":195},{},[196,198,201],{"type":36,"value":197},"Je souhaite m'adresser en particulier aux “Tech Leads”, quel qu'ils soient (CTO, Staff Engineer, Senior Engineer). Par ricochet cela peut être utile aux Engineering Managers (VP, Eng Manager, Directors of eng…) dont l'aide est nécessaire.",{"type":31,"tag":44,"props":199,"children":200},{},[],{"type":36,"value":202},"\nMais cela peut servir bien sûr à d'autres personnes intéressées par la construction d'entreprise produit/tech efficace.",{"type":31,"tag":32,"props":204,"children":205},{},[206],{"type":36,"value":207},"Dans les chapitres suivants je vais parler des qualités attendues des Software Engineer pour apporter de l'impact individuellement.\nJe souhaite discuter des notions de leadership pour démultiplier son impact au sein d'une équipe.\nJe vais décrire ce que je considère être une organisation Engineering efficace et les pièges dans lesquels ne pas tomber.\nJe décrirais également la manière que je considère la plus efficace pour faire du produit, et le rôle de l'Engineering dans ces deux phases clés, la Discovery et la Delivery.",{"type":31,"tag":32,"props":209,"children":210},{},[211,213,216,218,225,227,234],{"type":36,"value":212},"A l'inverse, je ne parlerai pas ou peu de management. Ce livre traitera bien sûr des notions de career path, d'engineering manager, mais ce sera fait à destination des contributeurs individuels.",{"type":31,"tag":44,"props":214,"children":215},{},[],{"type":36,"value":217},"\nDe même, je parlerais de produit, mais j'irais moins dans le détail que ",{"type":31,"tag":90,"props":219,"children":222},{"href":220,"rel":221},"https://www.svpg.com/team/marty-cagan/",[94],[223],{"type":36,"value":224},"Marty Cagan",{"type":36,"value":226}," ou ",{"type":31,"tag":90,"props":228,"children":231},{"href":229,"rel":230},"https://www.producttalk.org/",[94],[232],{"type":36,"value":233},"Teresa Torres",{"type":36,"value":235}," dont je recommande les lectures.",{"type":31,"tag":32,"props":237,"children":238},{},[239,241,244],{"type":36,"value":240},"Enfin, ce n'est pas destiné à devenir le futur support d'une méthode de coaching. Si un jour je devais chercher une nouvelle aventure, ce ne serait pas en tant que coach ou conseiller. Je sais qu'il faut se méfier de ce type de prédictions qui s'avèrent souvent fausses. Mais je sais, pour l'avoir fait, que je suis beaucoup trop frustré dans ces situations et que j'ai besoin de mettre les mains dans le cambouis.",{"type":31,"tag":44,"props":242,"children":243},{},[],{"type":36,"value":245},"\nDe toute façon ce livre ne vous donnera pas clé en main une méthode à appliquer, mais parle plutôt de recherche d'impact et d'attitude.",{"type":31,"tag":63,"props":247,"children":249},{"id":248},"avertissement",[250],{"type":36,"value":251},"Avertissement",{"type":31,"tag":32,"props":253,"children":254},{},[255,257,264],{"type":36,"value":256},"Cela fait 11 ans au moment où j'écris ces lignes que j'occupe le rôle de CTO et co-fondateur de ",{"type":31,"tag":90,"props":258,"children":261},{"href":259,"rel":260},"https://www.malt.com",[94],[262],{"type":36,"value":263},"Malt",{"type":36,"value":265},". Nous avons commencé à 3 et nous sommes désormais plus de 600, sur 6 pays avec un demi million de freelances inscrits. J'ai contribué à créer une équipe produit d'environ 130 personnes et j'ai appris de nombreuses choses durant ces années.",{"type":31,"tag":32,"props":267,"children":268},{},[269],{"type":36,"value":270},"J'aimerais commencer par un avertissement. Nous avons tous des biais. Et c'est important de comprendre mes biais pour comprendre ce que je vais raconter dans ce livre. De plus, je suis conscient que j'ai encore à apprendre. Chez Malt, j'ai commis des erreurs et j'en commets encore.",{"type":31,"tag":32,"props":272,"children":273},{},[274,276,279],{"type":36,"value":275},"J'ai travaillé plusieurs années en tant que Consultant ou Freelance. Dans ce cadre, j'ai travaillé pour des très grandes entreprises, dans les télécoms (Bougues Télécom) , la banque (Société Générale), l'assurance (Axa), le voyage (Groupe Expedia), la sécurité (groupe Airbus), l'énergie (Enedis).",{"type":31,"tag":44,"props":277,"children":278},{},[],{"type":36,"value":280},"\nJ'ai également travaillé chez un éditeur de logiciel dans la finance (Sungard).\nEnfin, je travaille depuis plus de 10 ans chez Malt, qui est devenu une Scale-up Européenne majeure.",{"type":31,"tag":32,"props":282,"children":283},{},[284],{"type":36,"value":285},"Je suis plutôt fier de mon parcours. Et malgré tout je sais bien que je ne connais qu'une partie de l'industrie.",{"type":31,"tag":32,"props":287,"children":288},{},[289],{"type":36,"value":290},"Mes biais sont donc les suivants :",{"type":31,"tag":292,"props":293,"children":294},"ul",{},[295,301,306,311,316],{"type":31,"tag":296,"props":297,"children":298},"li",{},[299],{"type":36,"value":300},"Je me considère surtout comme un contributeur individuel (en opposition à manager)",{"type":31,"tag":296,"props":302,"children":303},{},[304],{"type":36,"value":305},"J'ai une forte expérience en tant que Développeur Backend, et aujourd'hui plutôt Développeur Web",{"type":31,"tag":296,"props":307,"children":308},{},[309],{"type":36,"value":310},"Je pense avoir un esprit entrepreneurial, peu averse aux risques et changements",{"type":31,"tag":296,"props":312,"children":313},{},[314],{"type":36,"value":315},"J'ai travaillé dans de très grandes entreprises, mais jamais dans une Big Tech",{"type":31,"tag":296,"props":317,"children":318},{},[319],{"type":36,"value":320},"Même si je travaille au jour le jour en anglais dans un contexte international, j'ai travaillé uniquement en France.",{"type":31,"tag":32,"props":322,"children":323},{},[324],{"type":36,"value":325},"Enfin, second avertissement, il y a une différence entre les opinions que je peux exprimer ici, la direction que je souhaite prendre et la réalité de mon quotidien qui peut être plus contrastée. Malt a des dysfonctionnements, comme partout ailleurs. Mes opinions s'adressent parfois à moi-même et me fixent une direction où aller.",{"type":31,"tag":327,"props":328,"children":329},"tip",{},[330],{"type":31,"tag":32,"props":331,"children":332},{},[333,335,340,342,345],{"type":36,"value":334},"Ce billet de blog fait partie du livre ",{"type":31,"tag":90,"props":336,"children":338},{"href":337},"/2023/02/impactful-software-engineering",[339],{"type":36,"value":190},{"type":36,"value":341},".",{"type":31,"tag":44,"props":343,"children":344},{},[],{"type":36,"value":346},"\nN'hésitez pas à lire les autres chapitres.",{"title":7,"searchDepth":348,"depth":348,"links":349},2,[350,351,352,353,354,355],{"id":65,"depth":348,"text":68},{"id":122,"depth":348,"text":125},{"id":138,"depth":348,"text":141},{"id":149,"depth":348,"text":152},{"id":160,"depth":348,"text":163},{"id":248,"depth":348,"text":251},"markdown","content:articles:2023:03:amenez-ingenieurs-dans-la-salle.md","content","articles/2023/03/amenez-ingenieurs-dans-la-salle.md","md",1700640034845]