[{"data":1,"prerenderedAt":129},["Reactive",2],{"/articles/2015/11/04/lentreprise-liberee-pas-faite-pour-les-freelances":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"date":11,"categories":12,"tags":14,"img":7,"cover":18,"readingTime":19,"body":24,"_type":124,"_id":125,"_source":126,"_file":127,"_extension":128},"/articles/2015/11/04/lentreprise-liberee-pas-faite-pour-les-freelances","04",false,"","L'entreprise libérée, pas faite pour les freelances ?","Récemment je suis tombé sur [un billet parlant des entreprises libérée](http://www.touilleur-express.fr/2015/11/04/lentreprise-liberee-pour-le-develop...","1216","2015-11-04",[13],"waza",[15,16,17],"freelance","malt","lateralthoughts","cover5.jpg",{"text":20,"minutes":21,"time":22,"words":23},"4 min read",3.31,198600,662,{"type":25,"children":26,"toc":121},"root",[27,46,51,91,96,101,106,111,116],{"type":28,"tag":29,"props":30,"children":31},"element","p",{},[32,35,44],{"type":33,"value":34},"text","Récemment je suis tombé sur ",{"type":28,"tag":36,"props":37,"children":41},"a",{"href":38,"rel":39},"http://www.touilleur-express.fr/2015/11/04/lentreprise-liberee-pour-le-developpeur/",[40],"nofollow",[42],{"type":33,"value":43},"un billet parlant des entreprises libérée",{"type":33,"value":45}," et qui disait en substance qu'un freelance ne pouvait pas devenir participant d'une telle entreprise. Forcément je me devais de réagir sur un tel sujet ^^",{"type":28,"tag":29,"props":47,"children":48},{},[49],{"type":33,"value":50},"Bon déjà pour commencer, l'article que je cite plus haut est très bien (en dehors de la section qui me chagrine), comme les nombreux autres du même blog alors si vous voulez un retour d'expérience sur l'entreprise libéré, allez le lire !",{"type":28,"tag":29,"props":52,"children":53},{},[54,56,63,65,72,74,81,83,89],{"type":33,"value":55},"Cependant je tenais à faire une réponse de plus de 140 caractères pour exprimer mon point de vue concernant le freelancing. Tout d'abord pour rappel, je fais partie de ",{"type":28,"tag":36,"props":57,"children":60},{"href":58,"rel":59},"http://www.lateral-thoughts.com/",[40],[61],{"type":33,"value":62},"Lateral-Thoughts",{"type":33,"value":64},", ",{"type":28,"tag":36,"props":66,"children":69},{"href":67,"rel":68},"http://www.lateral-thoughts.com/blog/2015/02/26/Hello%20world/",[40],[70],{"type":33,"value":71},"une société libérée justement",{"type":33,"value":73}," et de ",{"type":28,"tag":36,"props":75,"children":78},{"href":76,"rel":77},"http://www.eventuallycoding.com/index.php/siffler-en-teletravaillant/",[40],[79],{"type":33,"value":80},"Hopwork assez libérée aussi",{"type":33,"value":82},". Or justement, si je prends Lateral-Thoughts, il y a des salariés et des freelances. Certains salariés sont actionnaires, d'autres non, certains freelances sont actionnaires, d'autres non. Nous avons toujours vu le statut de la personne comme un ",{"type":28,"tag":84,"props":85,"children":86},"strong",{},[87],{"type":33,"value":88},"\"détail d'implémentation\"",{"type":33,"value":90},".",{"type":28,"tag":29,"props":92,"children":93},{},[94],{"type":33,"value":95},"Selon moi, dans une société, ce qui compte c'est ce que tu apportes, c'est ton envie de faire bouger les lignes, de travailler avec les autres. Je me fous royalement que tu cotises au RSI ou au régime général. Je me fous de savoir que tu reçois une fiche de salaire ou que tu m'envoies une facture.",{"type":28,"tag":29,"props":97,"children":98},{},[99],{"type":33,"value":100},"J'ai effectivement croisé des personnes lors de ma carrière de freelance qui pensait qu'un salarié c'était celui qui prenait les décisions tandis qu'un freelance c'était de la main d'oeuvre corvéable qui ne pouvait pas avoir droit au chapitre (c'est ce que j'entends par le mot \"commodité\" utilisé dans l'article).  A côté de ça j'ai aussi vu des freelances qui étaient de purs mercenaires il faut bien l'avouer. Pourtant en parralèle j'ai vu des leads techs freelance, des recruteurs freelances, des directeurs commerciaux freelance ou même une fois un DSI freelance (dans une filiale d'un grand groupe du CAC 40). En plus connaissant Nicolas (l'auteur du blog ci-dessus), je suis convaincu qu'il ne partage pas ce point de vue lui-même puisqu'il a une belle carrière en freelance. Ce qui me surprend d'autant plus.",{"type":28,"tag":29,"props":102,"children":103},{},[104],{"type":33,"value":105},"Bref, oui le freelance peut s'impliquer autant qu'un salarié dans une société, il peut participer aux décisions de celle-ci, être force de proposition pour les choix de la boîte etc... Tout du moins on l'a démontré avec Lateral-Thoughts. Et avec Hopwork ? Eh bien chez Hopwork dans l'équipe de dev par exemple nous avons Maxime Gaudin qui est freelance et a exactement tout les mêmes droits que ceux qui sont salariés. Il est tout autant force de proposition pour améliorer la société que n'importe qui d'autre.",{"type":28,"tag":29,"props":107,"children":108},{},[109],{"type":33,"value":110},"De toute façon j'ai tendance à croire qu'il faut s'y faire, le freelancing est en plein essor (40% de l'emploi US sera prochainement constitué de freelances). Il est en plein essor car les générations d'aujourd'hui (X,Y, Z etc...) ont des envies d'indépendance, de gestion de leur temps, d'autonomie. Quand aux entreprises, elles font face à des marchés très volatiles ou des pans entiers d'industrie peuvent sauter en moins de 5 ans. Pour ces entreprises, la capacité à pivoter et innover est primordiale et c'est justement en restant ouvert sur le monde, en ayant recours à des cellules grises venant de l'extérieur qu'elle sauront le faire. Oui ok ca s'applique moins à EDF qui planifie ces créations d'EPR sur 10 ans c'est vrai, je ne parle que de mon secteur d'activité.",{"type":28,"tag":29,"props":112,"children":113},{},[114],{"type":33,"value":115},"L'entreprise de demain je la vois comme une sorte de hub qui sera constitué d'un coeur fixe mais très réduit et qui sera capable de rassembler des personnes peu importe leur statut. Ces personnes seront peut-être plus mobiles, elles pourront naviguer entre les hubs et/ou faire partie de plusieurs hubs, je crois même que c'est une richesse. Et bien sûr j'ai la faiblesse de penser que les hubs qui sauront le mieux s'en tirer seront ceux qui font participer tout ces membres à son développement, salariés ou non.",{"type":28,"tag":29,"props":117,"children":118},{},[119],{"type":33,"value":120},"Bon ça se trouve je finirais esclave de la World Company, on s'en fout, mais laissez moi rêver un peu.",{"title":7,"searchDepth":122,"depth":122,"links":123},2,[],"markdown","content:articles:2015:11:04:lentreprise-liberee-pas-faite-pour-les-freelances.md","content","articles/2015/11/04/lentreprise-liberee-pas-faite-pour-les-freelances.md","md",1699798340034]