[{"data":1,"prerenderedAt":149},["Reactive",2],{"/articles/2012/05/01/p-r-o-f-s":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"date":11,"categories":12,"tags":14,"cover":17,"readingTime":18,"body":23,"_type":144,"_id":145,"_source":146,"_file":147,"_extension":148},"/articles/2012/05/01/p-r-o-f-s","01",false,"","P.R.O.F.S","![](/images/profs.png \"profs\")Une semaine après Devoxx, quoi de mieux que de parler de formation. Mais plutôt que de parler de formation professionnel...","534","2012-05-01",[13],"waza",[15,16],"cours","formation","profs.png",{"text":19,"minutes":20,"time":21,"words":22},"5 min read",4.97,298200,994,{"type":24,"children":25,"toc":141},"root",[26,40,45,50,66,71,76,81,96,116,121,126,131,136],{"type":27,"tag":28,"props":29,"children":30},"element","p",{},[31,37],{"type":27,"tag":32,"props":33,"children":36},"img",{"alt":7,"src":34,"title":35},"/images/profs.png","profs",[],{"type":38,"value":39},"text","Une semaine après Devoxx, quoi de mieux que de parler de formation. Mais plutôt que de parler de formation professionnelle, cette fois je tiens à parler de formation académique. Et justement je donne des cours dans un IUT depuis septembre dernier (2011) et je me permet un petit retour d'expérience.",{"type":27,"tag":28,"props":41,"children":42},{},[43],{"type":38,"value":44},"En fait j'aimerais bien tenter de convaincre une partie des quelques lecteurs qui suivent ce blog de l'intérêt de la démarche et en quoi cela peut vous être bénéfique à vous aussi.",{"type":27,"tag":28,"props":46,"children":47},{},[48],{"type":38,"value":49},"Allez, ne partez pas tout de suite et accrochez-vous un peu pour la suite de ce billet.",{"type":27,"tag":28,"props":51,"children":52},{},[53,55,64],{"type":38,"value":54},"Tout d'abord l'enseignement ça veut dire quoi pour un professionnel en activité ? Eh bien c'est ce qu'on appelle être ",{"type":27,"tag":56,"props":57,"children":61},"a",{"href":58,"rel":59},"http://fr.wikipedia.org/wiki/Enseignant_vacataire",[60],"nofollow",[62],{"type":38,"value":63},"vacataire",{"type":38,"value":65},". Un vacataire, aussi appelé intervenant extérieur, peut assurer des cours/TD/TP en 3ème cycle ou IUT. La position de vacataire est ouverte aux salariés ainsi qu'aux entrepreneurs et travailleurs indépendants mais pas aux chomeurs. Vous devez avoir une activité.",{"type":27,"tag":28,"props":67,"children":68},{},[69],{"type":38,"value":70},"Le volume horaire annuel max que vous pouvez dispenser est de 64 h de cours / 96 h de TD et 144h de TP.",{"type":27,"tag":28,"props":72,"children":73},{},[74],{"type":38,"value":75},"Et pour conclure sur le côté pratique, l'heure de TD est rémunéré aux alentours de 30 euros et l'heure de TP aux alentours de 40 euros, les deux en brut. Pour un salarié \"classique\" de SSII ou chez un éditeur, il n'y a donc pas de perte de salaire sachant que les charges sociales sont moins élevés. Je dirais même que c'est même relativement intéressant ce qui permet de prendre du sans solde pour ne pas gréver votre solde de congé. Petit bémol toutefois, il faut bien compter une heure de préparation pour une heure de TP/TD. Et sans doute que le ratio est encore plus important pour un cours magistral. De plus vous aurez des évaluations à faire qui prennent elles aussi un temps non négligeable.",{"type":27,"tag":28,"props":77,"children":78},{},[79],{"type":38,"value":80},"Pour moi qui suis freelance, c'est une perte importante sur une journée de facturation standard mais :",{"type":27,"tag":82,"props":83,"children":84},"ul",{},[85,91],{"type":27,"tag":86,"props":87,"children":88},"li",{},[89],{"type":38,"value":90},"je le compte sur le budget veille qui d'habitude ne rapporte rien",{"type":27,"tag":86,"props":92,"children":93},{},[94],{"type":38,"value":95},"je n'ai aucune problématique de jours de congés à prendre",{"type":27,"tag":28,"props":97,"children":98},{},[99,101,107,109,114],{"type":38,"value":100},"De leur côté, ce que les écoles recherchent chez un vacataire peut se résumer en deux choses, la flexibilité (ça c'est pour le côté bassement matériel) et les compétences \"",{"type":27,"tag":102,"props":103,"children":104},"em",{},[105],{"type":38,"value":106},"pros de la vraie vie",{"type":38,"value":108},"\". Parlons-en de ces compétences \"",{"type":27,"tag":102,"props":110,"children":111},{},[112],{"type":38,"value":113},"de la vraie vie",{"type":38,"value":115},"\". Justement ma motivation première c'était de pouvoir apporter un oeil externe aux futurs diplomés. Lorsque j'étais étudiant j'avais beaucoup apprécié certains intervenants externes car on sentait que leur discours avait été façonné par de vrais expériences et je souhaitais redonner cela à mon tour. Tiens, ça ne vous rappelle pas (un peu) cette notion d'apprentis du software craftmanship ?",{"type":27,"tag":28,"props":117,"children":118},{},[119],{"type":38,"value":120},"Vous pensez que c'est de tout repos et qu'il suffit de reprendre votre bonne vieille édition de \"The C++ Programming Language\" de Bjarne Stroustrup pour en lire les chapitres un par un ? Dans ce cas vous vous fourrez le doigt dans l'oeil. Tout d'abord c'est pas ce qu'on attend de vous et ensuite vous risquez d'être surpris si vous tentez d'enseigner l'informatique à papa. Et oui, la génération actuelle est né avec Internet, le téléphone portable et elle parle web 2.0 et pas l'architecture client serveur des années 90. Enfin je vous rassure, ils leur reste plein de choses à apprendre tout baigné dans la technologie qu'ils peuvent l'être ^^",{"type":27,"tag":28,"props":122,"children":123},{},[124],{"type":38,"value":125},"Et cela me permet d'enchainer sur la principale plus-value pour le professionnel que vous êtes : la veille et l'approfondissement des connaissances. Donner un cours sur une appli web en Java par exemple va vous forcer à vous remettre à jour sur l'état de l'art au moment de faire votre cours. Vous sortez d'une mission avec spring 2.5 (et son fameux HibernateTemplate), Struts 1.3.9 et hibernate 3.2 ? Désolé mais n'allez pas enseigner ça, vous avez déjà 5 ans de retard et en 5 ans ca bouge vite. JPA 2.0 a fait son trou, Spring propose une bien meilleure intégration avec JPA (et avec Hibernate si vous êtes un irréductible) et Struts ne fait plus l'unanimité. Moralité, va falloir faire un peu de veille. Et faire de la veille ca veut aussi dire épluchez les annonces pour savoir ce que les recruteurs vont exiger de vos futurs diplomés car la finalité c'est quand même de lâcher vos élèves dans le monde du travail. Sur ce dernier point, il faut cependant faire la part des choses entre le marché du travail qui peut être en retard sur les technos et celles qui seront utilisés dans 1 an ou deux.",{"type":27,"tag":28,"props":127,"children":128},{},[129],{"type":38,"value":130},"Et puis il faut aussi approfondir vos connaissances. C'est bien beau d'avoir suivi le tutoriel officiel et de faire marcher TrucSuperChouette 3.1 mais vous ne pouvez pas vous permettre de connaitre votre super framework superficiellement. Vous allez devoir expliquer ces concepts et aider vos étudiants quand ils vont coder dessus. Pour le coup, un conseil, partez du principe qu'il faut repartir de zéro, reprenez la doc officielle, refaites les tutoriaux en essayant chaque variante et vérifiez bien que vous comprenez chaque ligne écrite.",{"type":27,"tag":28,"props":132,"children":133},{},[134],{"type":38,"value":135},"Outre les connaissances techniques c'est aussi un moyen de faire passer des valeurs agiles et une conception plus moderne de l'informatique. Personnellement j'ai mis en place des cycles d'apprentissage par itération qui alternent cours théoriques de 20 min et TP de 1h, une évaluation qui prend en compte la valeur business d'une fonctionnalité décorrellé de sa complexité, des indicateurs sur la qualité du code et nous avons fait une rétrospective a mi trimestre. Les supports sont faits sur google docs et les exemples de code sont stockés sur bitbucket.",{"type":27,"tag":28,"props":137,"children":138},{},[139],{"type":38,"value":140},"Pour conclure, je ne saurais que trop vous inciter à tenter l'aventure. C'est pour vous un super moyen de faire de la veille et d'approfondir vos connaissances. C'est aussi une satisfaction personnelle de participer à la formation de vos peut être futurs collègues. Et finalement c'est un espace de liberté encadré dans lequel on trouve plus de sens que dans bien des missions où l'objectif est de faire la 62ème refonte d'une application dont personne ne sait à quoi elle sert.",{"title":7,"searchDepth":142,"depth":142,"links":143},2,[],"markdown","content:articles:2012:05:01:p-r-o-f-s.md","content","articles/2012/05/01/p-r-o-f-s.md","md",1703146569360]