[{"data":1,"prerenderedAt":552},["Reactive",2],{"/articles/2016/05/16/entretiens-recrutements-et-pensees-diverses":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"date":11,"categories":12,"tags":14,"img":16,"cover":17,"readingTime":18,"body":23,"_type":547,"_id":548,"_source":549,"_file":550,"_extension":551},"/articles/2016/05/16/entretiens-recrutements-et-pensees-diverses","16",false,"","Entretiens, recrutements et pensées diverses","[![image06](/images/05b46-image06.png)](http://eventuallycoding.com/wp-content/uploads/2016/05/05b46-image06.png)Au cours de mes différents jobs, j'ai...","1257","2016-05-16",[13],"waza",[15],"recrutement","05b46-image06.png","cover6.jpg",{"text":19,"minutes":20,"time":21,"words":22},"14 min read",13.895,833700,2779,{"type":24,"children":25,"toc":537},"root",[26,47,52,65,70,75,82,87,92,104,109,114,139,151,156,161,174,179,184,189,202,207,213,218,223,228,233,238,250,255,260,273,279,293,298,303,308,313,318,323,328,341,347,352,357,362,367,372,385,391,396,401,406,411,416,421,426,439,445,450,455,460,466,514,519,532],{"type":27,"tag":28,"props":29,"children":30},"element","p",{},[31,44],{"type":27,"tag":32,"props":33,"children":37},"a",{"href":34,"rel":35},"http://eventuallycoding.com/wp-content/uploads/2016/05/05b46-image06.png",[36],"nofollow",[38],{"type":27,"tag":39,"props":40,"children":43},"img",{"alt":41,"src":42},"image06","/images/05b46-image06.png",[],{"type":45,"value":46},"text","Au cours de mes différents jobs, j'ai été amené à faire pas mal de recrutements. Je ne parle pas de un ou deux recrutements mais bien de plusieurs dizaines. Et évidemment j'ai moi-même passé des entretiens. Certains ont été plutôt \"subis\", d'autres vraiment appréciés. Dans tous les cas, intégrer une nouvelle personne pour travailler avec soi est véritablement un art difficile, sur lequel je me suis parfois planté. Parlons-en.",{"type":27,"tag":28,"props":48,"children":49},{},[50],{"type":45,"value":51},"A travers deux billets, j’avais envie de revenir sur cette étape cruciale pour chacun dans sa carrière, en tant que recruté (pour ce premier billet) ou recruteur (pour le suivant).",{"type":27,"tag":53,"props":54,"children":55},"disclaimer",{},[56],{"type":27,"tag":28,"props":57,"children":58},{},[59],{"type":27,"tag":60,"props":61,"children":62},"em",{},[63],{"type":45,"value":64},"En me lançant sur ce billet, je pensais juste parler en tant que recruteur. Et puis finalement j’ai eu envie de parler de plein de choses, d’inclure des pensées diverses et variées. C’est un peu différent de mes billets habituels. J’espère ne pas m’être trop perdu et que cela apporte quelque chose.",{"type":27,"tag":28,"props":66,"children":67},{},[68],{"type":45,"value":69},"14 ans que je travaille, c'est peu et c'est beaucoup à la fois. J'ai changé de carrière quelques fois : startup (en 2001), SSII, gros éditeur de logiciel, freelance et enfin créateur de deux entreprises. J’ai vu de nombreux secteurs, les télécoms, la finance, l’assurance, la banque de détail, l’énergie, le voyage, la cuisine.",{"type":27,"tag":28,"props":71,"children":72},{},[73],{"type":45,"value":74},"Et pour cela j'ai passé d'innombrables entretiens qu'on peut décomposer en plusieurs catégories.",{"type":27,"tag":76,"props":77,"children":79},"h2",{"id":78},"les-entretiens-peu-glorieux",[80],{"type":45,"value":81},"Les entretiens peu glorieux",{"type":27,"tag":28,"props":83,"children":84},{},[85],{"type":45,"value":86},"Ceux-là sont essentiellement situés en début de carrière. J'étais relativement jeune, pas forcément convaincu de ce que je cherchais. Bon enfin à cet âge-là on cherche surtout un salaire pour gagner un peu d'autonomie et pouvoir ne plus dire qu'on dort chez maman en soirée.",{"type":27,"tag":28,"props":88,"children":89},{},[90],{"type":45,"value":91},"J'avais peu d'expérience, je ne savais pas bien jauger les gens que je rencontrais. Je suis même venu en jean baskets pour un entretien rue des Champs Elysées (Ok là j'ai peut-être un peu cherché).",{"type":27,"tag":28,"props":93,"children":94},{},[95,97,102],{"type":45,"value":96},"Je me rappelle d'une question que je détestais \"",{"type":27,"tag":60,"props":98,"children":99},{},[100],{"type":45,"value":101},"vous vous voyez où dans 5 ans ?",{"type":45,"value":103},"\".",{"type":27,"tag":28,"props":105,"children":106},{},[107],{"type":45,"value":108},"Mais bon sang je sors juste de l'école ! J'ai fait de la physique quantique, du traitement d'image, des calculs d'intégrales et j'ai codé des arbres binaires en C, j'en sais foutre rien de ce que c'est que le monde du travail. Je suis une sorte d'éponge humaine capable d'absorber des annales d'examen de plusieurs kilos. Quand j'ai choisi mon école je pensais faire des jeux vidéos. Je suis face à un type en costard cravate qui à mon avis n'a jamais codé de sa vie et je dois savoir ce que je vais faire dans 5 ans...",{"type":27,"tag":28,"props":110,"children":111},{},[112],{"type":45,"value":113},"De toute façon à chaque fois que j'ai dit un truc, j'ai fait le contraire.",{"type":27,"tag":115,"props":116,"children":117},"ul",{},[118,124,129,134],{"type":27,"tag":119,"props":120,"children":121},"li",{},[122],{"type":45,"value":123},"J’aimerais partir à l’étranger, raté",{"type":27,"tag":119,"props":125,"children":126},{},[127],{"type":45,"value":128},"Je veux pas prendre de responsabilités, reraté",{"type":27,"tag":119,"props":130,"children":131},{},[132],{"type":45,"value":133},"Je veux pas créer de boites, fail",{"type":27,"tag":119,"props":135,"children":136},{},[137],{"type":45,"value":138},"Je veux pas créer une boite ou j'embaucherais des gens, boum.",{"type":27,"tag":140,"props":141,"children":142},"blockquote",{},[143],{"type":27,"tag":28,"props":144,"children":145},{},[146],{"type":27,"tag":60,"props":147,"children":148},{},[149],{"type":45,"value":150},"J'envie les gens qui sont capables sans erreur de dire ce qu'ils feront dans 5 ans. Ou pas d'ailleurs...",{"type":27,"tag":28,"props":152,"children":153},{},[154],{"type":45,"value":155},"Bref, j'ai dû faire au moins une douzaine d'entretiens pour décrocher ce foutu job, symbole de mon entrée dans la vie active. J'avais choisi de cibler des SSII. J'avais bossé dans une startup un an plus tôt en stage. J'avais adoré c'est vrai. Mais c'était le moment de l'explosion de la bulle Internet. Cette boite était morte comme pas mal d'autres. La mode n'était plus aux startups. Une SSII me paraissait être le bon endroit pour se faire une expérience, découvrir les différents métiers, avoir une variété de missions et puis je verrais plus tard. C'est bien ce qu’il s'est passé, je ne regrette rien sur ce plan.",{"type":27,"tag":28,"props":157,"children":158},{},[159],{"type":45,"value":160},"Pour l'anecdote, la bulle Internet était en cours d'explosion, par contre les SSII étaient en train de se gaver. Elles sortaient d'immenses chantiers autour du bug de l'an 2000, c'était le moment du passage à l'euro et dans les télécoms l'arrivée de la data. Elles avaient embauché à tour de bras au-delà des frontières de l’info. Ma première mission de 3 mois, je me retrouvais avec un ex-agent immobilier, une chercheuse en géologie et un électronicien !",{"type":27,"tag":28,"props":162,"children":163},{},[164,166,172],{"type":45,"value":165},"Et  j'ai pris de l'expérience avec ces entretiens. Douze entretiens, ",{"type":27,"tag":167,"props":168,"children":169},"strong",{},[170],{"type":45,"value":171},"c'est 12 occasions de comprendre les questions types, les réponses types, les QCM types",{"type":45,"value":173},". Pour quelqu’un qui a appris à apprendre, c’est du pain béni.",{"type":27,"tag":28,"props":175,"children":176},{},[177],{"type":45,"value":178},"Je me suis relancé en recherche en 2003 sans succès car la période était vraiment tendue suite à la fin des chantiers pour l'Euro, le krach boursier de 2001/2002 et l'explosion de la bulle Internet.",{"type":27,"tag":28,"props":180,"children":181},{},[182],{"type":45,"value":183},"J'ai encore pris de l'expérience. Cette fois je n'étais plus junior, j'avais 1 an d'expérience (!!). Je savais répondre aux questions RH bateaux ! Je me prenais pour un personnage de jeu de rôle qui vient de grimper d'un niveau. Bon ok j'étais toujours un noob, toujours piégé de nombreuses fois mais un peu plus à l'aise quand même.",{"type":27,"tag":28,"props":185,"children":186},{},[187],{"type":45,"value":188},"Et puis finalement je suis resté, j'ai progressé dans mon métier, j'ai apprécié mes collègues, j'ai vu des environnements très enrichissants (Bouygues Télécom, SFR, Orange, Société Générale). Oui je le dis, j'ai aimé bossé en SSII pendant 4 ans. Je m'en suis lassé, il y a des mauvais côtés, mais j'ai aimé.",{"type":27,"tag":28,"props":190,"children":191},{},[192],{"type":27,"tag":32,"props":193,"children":196},{"href":194,"rel":195},"http://eventuallycoding.com/wp-content/uploads/2016/05/84086-image01.png",[36],[197],{"type":27,"tag":39,"props":198,"children":201},{"alt":199,"src":200},"image01","/images/84086-image01.png",[],{"type":27,"tag":28,"props":203,"children":204},{},[205],{"type":45,"value":206},"Round suivant, 2006.",{"type":27,"tag":76,"props":208,"children":210},{"id":209},"les-entretiens-que-je-suis-ravi-davoir-réussi",[211],{"type":45,"value":212},"Les entretiens que je suis ravi d'avoir réussi",{"type":27,"tag":28,"props":214,"children":215},{},[216],{"type":45,"value":217},"2006 je n'ai postulé qu'à un seul endroit. Ça y est, je savais ce que je voulais, je voulais entrer chez un éditeur. C'était le saint graal pour nombre de développeurs en SSII. J'étais devenu bon dans ce que je faisais et un des chasseurs de tête contacté en 2003 (!) me recontactait pour une opportunité.",{"type":27,"tag":28,"props":219,"children":220},{},[221],{"type":45,"value":222},"Comme quoi certains ne vous mentent pas quand ils vous disent qu'ils vous rappelleront. Moralité, ne changez pas de téléphone.",{"type":27,"tag":28,"props":224,"children":225},{},[226],{"type":45,"value":227},"Et cette opportunité c'était chez un éditeur. Et pas n'importe lequel, 15000 personnes, une boite du Fortune 500 US. Peu connue du grand public Français mais présente sur tous les continents. Ça donne envie.",{"type":27,"tag":28,"props":229,"children":230},{},[231],{"type":45,"value":232},"J'ai passé l'entretien le plus sympa de ma carrière. Deux heures d'entretien, des discussions techniques, un passage au tableau pour détailler une solution, des questions étranges comme \"A ton avis, combien de noms de familles disparaissent chaque année en France ?\".",{"type":27,"tag":28,"props":234,"children":235},{},[236],{"type":45,"value":237},"J'avais en face de moi une personne avec qui j'avais envie de bosser, pointue, dont on sentait une vraie intelligence et son projet d'équipe qui m'emballait.",{"type":27,"tag":28,"props":239,"children":240},{},[241,243,248],{"type":45,"value":242},"Bref, cet entretien, je suis ravi de l'avoir réussi. J'ai dû plaire sur quelques points, je ne sais pas lesquels pour être honnête, mais ",{"type":27,"tag":167,"props":244,"children":245},{},[246],{"type":45,"value":247},"si je l'ai réussi, je pense que c'est aussi parce que j'en ai raté 15 avant celui-là",{"type":45,"value":249},".",{"type":27,"tag":28,"props":251,"children":252},{},[253],{"type":45,"value":254},"Et j'ai passé 4 super années. J'ai bossé avec des gens très bons. Je salue d'ailleurs mes anciens collègues si jamais il y a en qui se perdent par ici. J'ai eu la chance de voyager au Luxembourg (non je déconne j'ai pas aimé cet endroit :)), au Maroc, aux USA.",{"type":27,"tag":28,"props":256,"children":257},{},[258],{"type":45,"value":259},"Round suivant, 2009",{"type":27,"tag":28,"props":261,"children":262},{},[263],{"type":27,"tag":32,"props":264,"children":267},{"href":265,"rel":266},"http://eventuallycoding.com/wp-content/uploads/2016/05/a8f99-image02.png",[36],[268],{"type":27,"tag":39,"props":269,"children":272},{"alt":270,"src":271},"image02","/images/a8f99-image02.png",[],{"type":27,"tag":76,"props":274,"children":276},{"id":275},"lentretien-que-jai-encore-sur-la-patate-mais-qui-va-tout-changer",[277],{"type":45,"value":278},"L'entretien que j'ai encore sur la patate mais qui va tout changer",{"type":27,"tag":28,"props":280,"children":281},{},[282,284,291],{"type":45,"value":283},"En 2009 ",{"type":27,"tag":32,"props":285,"children":288},{"href":286,"rel":287},"https://www.atlassian.com/",[36],[289],{"type":45,"value":290},"Atlassian",{"type":45,"value":292}," ouvre une campagne de recrutement. C'est un éditeur que j'apprécie, ils ont des produits que j'utilise, ils ont une image dans le monde des devs qui est vraiment au top. Et là, ils lancent une campagne de 32 postes sur Sydney.",{"type":27,"tag":28,"props":294,"children":295},{},[296],{"type":45,"value":297},"Je me dis que c'est fou, mais je tente. J'y crois pas, au début.",{"type":27,"tag":28,"props":299,"children":300},{},[301],{"type":45,"value":302},"Je passe la première étape, la plus simple, mon CV entièrement refait en Anglais pour l'occasion les intéresse. Enfin la plus simple... C'est déjà pas mal d'avoir un CV de frenchy qui passe la sélection pour une boite à Sydney. Je passe de 1 à 5 sur l'échelle de l'excitation.",{"type":27,"tag":28,"props":304,"children":305},{},[306],{"type":45,"value":307},"Seconde étape, je dois remplir des tests papiers à leur renvoyer. Les questions sont sympa, on est loin des questions bateaux habituelles. J'ai plus le détail mais j'apprécie. Je crois que je réussis pas trop mal. Et apparemment ça passe.",{"type":27,"tag":28,"props":309,"children":310},{},[311],{"type":45,"value":312},"Troisième étape, l'entretien téléphonique à 9h du mat. Et là, c'est le drame. Je ne sais pas à quoi l'imputer. Sur la forme on est loin des entretiens à la Française. C'est un tech et il attaque bien. Il est très demandeur sur le parallélisme et la concurrence. Le téléphone et l'accent australien n'aident pas, je dois passer pour un type un peu lent, en fait je comprends pas tout ce qu'il dit.",{"type":27,"tag":28,"props":314,"children":315},{},[316],{"type":45,"value":317},"Je me fais avoir sur des questions simples. Avec le recul je ne comprends toujours pas comment j'ai pu passer à côté. J'étais peut être juste pas au niveau à ce moment-là.",{"type":27,"tag":28,"props":319,"children":320},{},[321],{"type":45,"value":322},"Ça fait désormais 8 ans que je travaille. Je commence à avoir un beau CV. J'ai progressé mais cet entretien me fait penser, à tort ou à raison, que je commence à stagner. Je décide de passer en freelance suite à ma rencontre avec Lilians Auvigne. Il me fait découvrir les conférences, les user groups, le Paris JUG. Il cite des noms de types dont j'ai jamais entendu parler, me parle de techniques que je ne connais pas. Pourtant j'avais l'impression de faire beaucoup de veille, de bosser beaucoup mais j'ai l'impression que le gap est énorme. C'est un putain de pro. Il y a une vie communautaire dehors, des développeurs stars. Bon sang, faut que j'aille voir ça.",{"type":27,"tag":28,"props":324,"children":325},{},[326],{"type":45,"value":327},"Round suivant, 2010",{"type":27,"tag":28,"props":329,"children":330},{},[331],{"type":27,"tag":32,"props":332,"children":335},{"href":333,"rel":334},"http://eventuallycoding.com/wp-content/uploads/2016/05/2ad85-image05.png",[36],[336],{"type":27,"tag":39,"props":337,"children":340},{"alt":338,"src":339},"image05","/images/2ad85-image05.png",[],{"type":27,"tag":76,"props":342,"children":344},{"id":343},"lentretien-exotique",[345],{"type":45,"value":346},"L’entretien exotique",{"type":27,"tag":28,"props":348,"children":349},{},[350],{"type":45,"value":351},"Je me lance en Freelance. Lilians me fait rentrer dans le groupe très fermé des zindeps, me coache un peu. Et je démarre un nouveau round d'entretiens.",{"type":27,"tag":28,"props":353,"children":354},{},[355],{"type":45,"value":356},"J'ai quand même bien la pression. Je suis pressé par le temps, faut retrouver des revenus et je deviens papa sur la période d’une enfant qui naît à 900 grammes (!). Non, c'est plus du stress à ce niveau-là. Je dois être à 10 sur l'échelle de Richter (qui s'arrête à 9). Et là je tombe sur une opportunité exotique. L'entretien se passe bien. C'est loin de celui que j'ai passé pour aller chez Sungard en 2006 mais on me propose de changer un peu de boulot. On me propose de venir faire du coaching agile sur une DSI d'une centaine de personnes chez un gros assureur. Le challenge est intéressant, je m'entends bien avec la personne qui me le propose, je sens de bonnes qualités, je tente. Oui le courant est bien passé et on se revoit encore mais avec le recul je ne comprends toujours pas comment il a pu me faire confiance pour ce poste par contre :)",{"type":27,"tag":28,"props":358,"children":359},{},[360],{"type":45,"value":361},"Je ferais peut-être un billet sur cette expérience une autre fois. Ça durera un an et demi. Ce sera ma seule expérience de coaching agile. Je vais repasser développeur ensuite.",{"type":27,"tag":28,"props":363,"children":364},{},[365],{"type":45,"value":366},"Bref, je suis lancé en tant que freelance et ça va durer 4 ans. Quatre ans SSII, Quatre ans éditeur, Quatre ans freelance, décidément ce chiffre me suit.",{"type":27,"tag":28,"props":368,"children":369},{},[370],{"type":45,"value":371},"Et des entretiens j'en ferai encore des tas.",{"type":27,"tag":28,"props":373,"children":374},{},[375],{"type":27,"tag":32,"props":376,"children":379},{"href":377,"rel":378},"https://eventuallycoding.com/wp-content/uploads/2019/10/469b2-image00.png",[36],[380],{"type":27,"tag":39,"props":381,"children":384},{"alt":382,"src":383},"image00","/images/469b2-image00.png",[],{"type":27,"tag":76,"props":386,"children":388},{"id":387},"les-entretiens-où-jétais-une-star-sans-comprendre-pourquoi",[389],{"type":45,"value":390},"Les entretiens où j'étais une star (sans comprendre pourquoi)",{"type":27,"tag":28,"props":392,"children":393},{},[394],{"type":45,"value":395},"Mais désormais les rôles se sont inversés. Leurs questions je les connais par coeur. Les gens qui m'interviewent, je me rends compte que désormais je suis plus vieux qu'eux pour la plupart. Oui, l’inexpérience existe aussi de leur côté. Je les interviewe tout autant que l'inverse, voire plus.",{"type":27,"tag":28,"props":397,"children":398},{},[399],{"type":45,"value":400},"Et j'avoue que je ne comprends pas toujours. Je tombe sur des gens qui semblent me juger surtout sur le CV (qui est relativement sympa à lire) mais ils ne me connaissent pas ! Je crois qu’ils jouent aux Bingo avec les mots clés et se font une idée super positive sur moi, je n'ai qu'à dérouler. Ça reste plutôt perturbant. J'ai une sorte de \"statut\", incompréhensible en partie. J'imagine que des développeurs qui restent développeurs pendant autant de temps, on doit se dire qu'ils doivent être pas mal quand même. Tu m'étonnes, dans un métier ou t'es considéré senior avec 4 ans d'expérience, en avoir plus de 10 tu fais dinosaure. \"Eh papy, t'as connu avant Internet, t'as connu avant les portables, avant Eclipse, respect\".",{"type":27,"tag":28,"props":402,"children":403},{},[404],{"type":45,"value":405},"C’est grisant, un peu gênant aussi et stressant bien sûr car il faut répondre aux attentes.",{"type":27,"tag":28,"props":407,"children":408},{},[409],{"type":45,"value":410},"Parfois je plaisante avec les recruteurs, on me fait passer des QCM faux, des questionnaires ou t'as envie d'aller voir le type qui l'a pondu pour le remettre à niveau. Parfois à l'inverse t'as l'impression d'être revenu à l'école tellement le questionnaire te paraît parler de choses incroyables pour toi. Mais le recruteur t'explique que personne répond jamais. Ça sert à quoi ? Je sais toujours pas.",{"type":27,"tag":28,"props":412,"children":413},{},[414],{"type":45,"value":415},"Bon après tu te rappelles que dans ton secteur c'est quand même plutôt porteur, qu'on te parle sans arrêt de pénurie sur certaines technos que t'as eu de la chance de choisir. Et ça te remet les pieds sur Terre. T’es là au bon endroit, au bon moment. Il faut en avoir conscience tout le temps pour pas choper la grosse tête, un risque majeur dans notre métier.",{"type":27,"tag":28,"props":417,"children":418},{},[419],{"type":45,"value":420},"Et j'ai même parfois des échecs, comme avec Antoine C. chez Orange Business Services qui me remettent encore un peu plus la tête sur les épaules.",{"type":27,"tag":28,"props":422,"children":423},{},[424],{"type":45,"value":425},"Dans l’ensemble ça se passe bien, c'est une très bonne période.",{"type":27,"tag":28,"props":427,"children":428},{},[429],{"type":27,"tag":32,"props":430,"children":433},{"href":431,"rel":432},"http://eventuallycoding.com/wp-content/uploads/2016/05/ebb05-image03.png",[36],[434],{"type":27,"tag":39,"props":435,"children":438},{"alt":436,"src":437},"image03","/images/ebb05-image03.png",[],{"type":27,"tag":76,"props":440,"children":442},{"id":441},"ce-que-ça-ma-appris-humainement",[443],{"type":45,"value":444},"Ce que ça m’a appris humainement",{"type":27,"tag":28,"props":446,"children":447},{},[448],{"type":45,"value":449},"Si je suis passé de \"jeune troll sorti de l'école\" à \"professionnel apprécié\", à tort ou à raison, c'est lié à une suite de supers opportunités que j'ai eu la chance d'avoir. Il faut savoir les saisir, prendre les risques d'y aller. C'est la difficulté sans doute. Mais une fois qu'on accepte de se prendre des gamelles, c'est génial. J'ai rencontré des gens qui m'ont fait confiance, qui m'ont fait progresser. Je ne les cite pas, j'ai pas la place et je ne veux pas en oublier. Si certains lisent, ils reconnaîtront les situations que je décris.",{"type":27,"tag":28,"props":451,"children":452},{},[453],{"type":45,"value":454},"Ce dont je suis sûr, c’est que c’est une question d’état d’esprit. Tout le monde m’a appris quelque chose. Même les gens avec qui je me suis fritté, ceux qui étaient plus jeunes, plus vieux, qui faisaient d’autres métiers etc…",{"type":27,"tag":28,"props":456,"children":457},{},[458],{"type":45,"value":459},"Si vous n’êtes pas ouvert aux autres, si vous pensez tout savoir, changez. Maintenant. Pour votre bien.",{"type":27,"tag":76,"props":461,"children":463},{"id":462},"maintenant-quelques-conseils-pour-toi-qui-va-passer-des-entretiens",[464],{"type":45,"value":465},"Maintenant, quelques conseils pour toi qui va passer des entretiens",{"type":27,"tag":467,"props":468,"children":469},"ol",{},[470,475,480,485,490,504,509],{"type":27,"tag":119,"props":471,"children":472},{},[473],{"type":45,"value":474},"Les questions \"RH\" du type : tes qualités, tes défauts, tu te vois où dans 5 ans etc... Ça ne sert à rien. Si ça n'est pas vraiment inséré correctement dans une discussion c'est juste que votre interlocuteur n'a rien à dire. Mais voilà, il faut jouer le jeu.",{"type":27,"tag":119,"props":476,"children":477},{},[478],{"type":45,"value":479},"On vous sert une question bateau, apprenez des réponses bateaux. Les entretiens RH existent depuis des dizaines d'années, il n'y a aucun renouvellement, vous trouverez ces questions sur Google sans souci. Entraînez-vous chez vous à avoir un discours prêt pour les questions les plus courantes. Entraînez-vous vraiment, faut que ça devienne fluide. Faites court, que la discussion puisse enfin passer à la suite.",{"type":27,"tag":119,"props":481,"children":482},{},[483],{"type":45,"value":484},"Sachez dire \"je ne sais pas\". Lors des entretiens techniques, parfois vous ne saurez pas répondre. Il n'y a rien de pire qu'une personne qui tente la méthode \"ninja\" en lançant la petite boule de fumée au sol et noie son interlocuteur de gloubiboulga technique pour simuler une réponse. Dites : \"je ne sais pas\". Vous avez le droit de ne pas tout savoir.",{"type":27,"tag":119,"props":486,"children":487},{},[488],{"type":45,"value":489},"A l'inverse, ça devient gênant si c'est votre seule réponse bien-sûr. Préparez-vous techniquement. Vous connaissez des choses, relisez des articles pour vérifier que vous utilisez le vocabulaire standard. Approfondissez sur des blogs, de la doc de votre framework préféré. Améliorez votre culture générale. Oui ça prend du temps. Du temps vous en avez, dans le métro, à la pause midi, 5 minutes pendant une pause café, le soir même parfois. Ne voyez pas cela comme du \"boulot\", c'est une façon de vous enrichir personnellement. Et c'est la richesse de votre personne qui vous servira ensuite tous les jours, en entretien mais aussi dans la vie courante. Car oui, il y a plein de parallèles à faire avec le monde \"réel\" si vous savez lire entre les lignes.",{"type":27,"tag":119,"props":491,"children":492},{},[493,495,502],{"type":45,"value":494},"Faites-vous aussi une liste des choses qui sont importantes à demander. L’entretien c’est dans les deux sens. N’allez pas dans une boite qui ne partage aucune de vos valeurs ou tout du moins, pas les plus importantes. Vous pouvez vous inspirer du ",{"type":27,"tag":32,"props":496,"children":499},{"href":497,"rel":498},"http://www.joelonsoftware.com/articles/fog0000000043.html",[36],[500],{"type":45,"value":501},"Test Joel",{"type":45,"value":503}," pour trouver des idées de questions à poser (et à vous poser).",{"type":27,"tag":119,"props":505,"children":506},{},[507],{"type":45,"value":508},"Entraînez-vous ! Votre premier entretien, il y a des chances qu’il soit mauvais. Et le second, et le 3ème… Dans l’idéal, ne visez pas la boite que vous adorez en premier entretien. Passez-en d’autres d’abord pour en apprendre sur vous-même. Êtes-vous capable de supporter le stress, les questions absurdes, êtes-vous patient, êtes-vous calme, où sont vos limites en termes de connaissances.",{"type":27,"tag":119,"props":510,"children":511},{},[512],{"type":45,"value":513},"Si t’es jeune, ta grande force c’est ton enthousiasme, ta curiosité, ton côté aventurier. Ne t’aventure pas à tenter de faire croire que tu est fort partout. J’ai croisé deux, trois personnes sortant d’école me vantant le fait d’avoir fait uniquement des “piscines” pendant 2 ou 3 ans et d’être expert en code. Sois humble, le métier ce n’est pas que ça.",{"type":27,"tag":28,"props":515,"children":516},{},[517],{"type":45,"value":518},"Et un dernier pour la route, pompé honteusement sur Twitter car il m’a bien fait rire :",{"type":27,"tag":28,"props":520,"children":521},{},[522],{"type":27,"tag":32,"props":523,"children":526},{"href":524,"rel":525},"http://eventuallycoding.com/wp-content/uploads/2016/05/98fd5-image04.png",[36],[527],{"type":27,"tag":39,"props":528,"children":531},{"alt":529,"src":530},"image04","/images/98fd5-image04.png",[],{"type":27,"tag":28,"props":533,"children":534},{},[535],{"type":45,"value":536},"Voilà, terminé pour cette première partie. Depuis 2013 je n’ai plus passé d’entretien de recrutement. J’ai créé ma boîte. Et ce sera l’occasion du prochain billet ou je reparlerai recrutement mais sous l’angle du recruteur.",{"title":7,"searchDepth":538,"depth":538,"links":539},2,[540,541,542,543,544,545,546],{"id":78,"depth":538,"text":81},{"id":209,"depth":538,"text":212},{"id":275,"depth":538,"text":278},{"id":343,"depth":538,"text":346},{"id":387,"depth":538,"text":390},{"id":441,"depth":538,"text":444},{"id":462,"depth":538,"text":465},"markdown","content:articles:2016:05:16:entretiens-recrutements-et-pensees-diverses.md","content","articles/2016/05/16/entretiens-recrutements-et-pensees-diverses.md","md",1699798338098]