[{"data":1,"prerenderedAt":735},["Reactive",2],{"/articles/2021/06/24/senior-avec-6-ans-dexperience-et-apres":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"date":11,"categories":12,"tags":14,"img":20,"cover":21,"readingTime":22,"body":27,"_type":730,"_id":731,"_source":732,"_file":733,"_extension":734},"/articles/2021/06/24/senior-avec-6-ans-dexperience-et-apres","24",false,"","Senior avec 6 ans d'expérience, et après ?","Le sujet récurrent dans l'IT : si on est senior après 6 ans d'expérience, quel est l'avenir du développeur(euse) passé 10 ans ?","1764","2021-06-24",[13],"waza",[15,16,17,18,19],"career-path","delivery","discovery","engineering","senior","Dual_ladder-1024x1024.jpg","cover8.jpg",{"text":23,"minutes":24,"time":25,"words":26},"14 min read",13.415,804900,2683,{"type":28,"children":29,"toc":719},"root",[30,37,42,47,52,57,62,69,85,90,104,109,114,119,139,144,149,162,167,172,178,183,188,193,198,203,236,241,246,251,256,261,266,272,277,282,287,292,297,302,307,312,317,345,350,362,367,380,385,390,395,400,405,411,416,421,426,431,436,441,446,451,457,462,467,472,477,482,487,493,498,503,508,513,518,523,528,533,538,550,555,560,566,571,576,581,586,591,604,616,621,626,631,636,641,646,651,656,661,667],{"type":31,"tag":32,"props":33,"children":34},"element","p",{},[35],{"type":36,"value":9},"text",{"type":31,"tag":32,"props":38,"children":39},{},[40],{"type":36,"value":41},"Les vieux et vieilles développeurs(euses) sont-ils voué(e)s à partir élever des chèvres dans l'Ardèche ou pire, deviennent-ils tous manager ?",{"type":31,"tag":32,"props":43,"children":44},{},[45],{"type":36,"value":46},"S'il est vrai que la voie vers le management reste dans beaucoup d'entreprises la voie privilégiée, il y a d'autres modèles aujourd'hui.",{"type":31,"tag":32,"props":48,"children":49},{},[50],{"type":36,"value":51},"Ce billet sera fait en deux parties assez distinctes.",{"type":31,"tag":32,"props":53,"children":54},{},[55],{"type":36,"value":56},"Dans un premier temps je vous propose de parler des rôles de Staff Engineer, Principal Engineer, Fellow, Distinguished, de la notion d'impact et de fameuse question, faut-il devenir manager pour progresser ?",{"type":31,"tag":32,"props":58,"children":59},{},[60],{"type":36,"value":61},"Ensuite j'aimerais aller au-delà de ça. Je souhaite aborder comment un(e) Software Engineer peut apporter beaucoup d'impact. Ce sera directement illustré via ce que nous faisons chez Malt.",{"type":31,"tag":63,"props":64,"children":66},"h2",{"id":65},"la-double-ladder-ou-dual-ladder",[67],{"type":36,"value":68},"La double ladder ou dual ladder",{"type":31,"tag":32,"props":70,"children":71},{},[72,74,83],{"type":36,"value":73},"Au début des années 10 (2010 ^^) en France le chemin de progression était systématiquement le même, la technique devait conduire à l'expertise mais ensuite au management et tant pis si cela finissait par créer des mauvais managers via ",{"type":31,"tag":75,"props":76,"children":80},"a",{"href":77,"rel":78},"https://en.wikipedia.org/wiki/Peter_principle",[79],"nofollow",[81],{"type":36,"value":82},"le fameux principe de Peter",{"type":36,"value":84},".",{"type":31,"tag":32,"props":86,"children":87},{},[88],{"type":36,"value":89},"C'est vers la seconde moitié des années 10 en France que j'ai commencé à voir dans certaines entreprises des chemins de progression possible pour l'expertise technique. C'est resté rare, et si on parle salaire le plafond était plus vite atteint pour un expert technique qu'un manager.",{"type":31,"tag":32,"props":91,"children":92},{},[93,95,102],{"type":36,"value":94},"En fondant Malt, je savais déjà que je souhaitais innover sur ce point lorsqu'on a fait nos premiers recrutements tech en 2014, car il était évident pour moi que l'impact d'un très bon dev pouvait être crucial dans une entreprise. Si on s'accorde à dire que \"",{"type":31,"tag":75,"props":96,"children":99},{"href":97,"rel":98},"https://a16z.com/2011/08/20/why-software-is-eating-the-world/",[79],[100],{"type":36,"value":101},"software is eating the world",{"type":36,"value":103},"\", alors avoir les meilleurs développeurs est un avantage concurrentiel, ce que les GAFAM ont d'ailleurs bien compris.",{"type":31,"tag":32,"props":105,"children":106},{},[107],{"type":36,"value":108},"Mais c'est en 2017 après une discussion avec Pierre-Yves Ricau de Square à SF que j'ai pu poser des mots et des concepts dessus.",{"type":31,"tag":32,"props":110,"children":111},{},[112],{"type":36,"value":113},"Je découvrais alors chez Square le concept de double ladder (ou dual ladder) et l'expression \"contributeur individuel\" (que je nommerais IC - individual contributor - par la suite).",{"type":31,"tag":32,"props":115,"children":116},{},[117],{"type":36,"value":118},"Les principes sont simples :",{"type":31,"tag":120,"props":121,"children":122},"ul",{},[123,129,134],{"type":31,"tag":124,"props":125,"children":126},"li",{},[127],{"type":36,"value":128},"on peut évoluer vers le haut de l'échelle dans tous les métiers, soit en tant que manager, soit en tant que contributeur individuel",{"type":31,"tag":124,"props":130,"children":131},{},[132],{"type":36,"value":133},"on peut évoluer en horizontal via les barreaux de l'échelle pour passer manager ou contributeur individuel",{"type":31,"tag":124,"props":135,"children":136},{},[137],{"type":36,"value":138},"un barreau correspond à un niveau d'impact attendu et un niveau de salaire, qui sera donc équivalent pour un manager ou un contributeur individuel",{"type":31,"tag":32,"props":140,"children":141},{},[142],{"type":36,"value":143},"En 2017 chez Malt on introduisait donc ce concept de dual ladder et de career path (chemin d'évolution de carrière) qui donnait la part belle à l'évolution pour un contributeur individuel.",{"type":31,"tag":32,"props":145,"children":146},{},[147],{"type":36,"value":148},"La version actualisée 2021 de ce career path ressemble à cela :",{"type":31,"tag":32,"props":150,"children":151},{},[152],{"type":31,"tag":75,"props":153,"children":156},{"href":154,"rel":155},"https://eventuallycoding.com/wp-content/uploads/2021/06/Dual_ladder.jpg",[79],[157],{"type":31,"tag":158,"props":159,"children":161},"img",{"alt":7,"src":160},"/images/Dual_ladder-1024x1024.jpg",[],{"type":31,"tag":32,"props":163,"children":164},{},[165],{"type":36,"value":166},"Dans cette version 2021, vous noterez une branche “leadership”. C’est toujours une évolution de la branche IC mais nous avons souhaité mettre en avant le fait que les engineering leaders créent leurs succès avec les autres.",{"type":31,"tag":32,"props":168,"children":169},{},[170],{"type":36,"value":171},"C’est tout l’enjeu des IC passé le cap de Senior, c’est d’être capable de rendre tout le monde plus productif et c’est là où l’expression 10x engineer prend tout son sens.",{"type":31,"tag":63,"props":173,"children":175},{"id":174},"la-notion-dimpact",[176],{"type":36,"value":177},"La notion d'impact",{"type":31,"tag":32,"props":179,"children":180},{},[181],{"type":36,"value":182},"Si on parle d'expérience à travers le nombre d'années, on s'attend globalement à passer Senior entre 6 et 10 ans d'exp.",{"type":31,"tag":32,"props":184,"children":185},{},[186],{"type":36,"value":187},"Il serait même totalement illogique d'être encore Junior après 3 ans d'expérience ou de ne pas être senior après 10 ans.",{"type":31,"tag":32,"props":189,"children":190},{},[191],{"type":36,"value":192},"Mais passé le statut de Senior Software Engineer, la progression n'est plus automatique. On peut rester des années Senior et ce sera totalement normal (même si la rémunération peut augmenter).",{"type":31,"tag":32,"props":194,"children":195},{},[196],{"type":36,"value":197},"Pour évoluer il faut changer son niveau d'impact ce qui est loin d’être simple d’une part, et correspond presque à un nouveau métier d’autre part.",{"type":31,"tag":32,"props":199,"children":200},{},[201],{"type":36,"value":202},"Si je simplifie, le niveau d'impact est le suivant (chaque niveau implique un impact sur les niveaux précédents) :",{"type":31,"tag":120,"props":204,"children":205},{},[206,211,216,221,226,231],{"type":31,"tag":124,"props":207,"children":208},{},[209],{"type":36,"value":210},"Junior Software engineer : individuel, c'est une phase d'apprentissage personnel",{"type":31,"tag":124,"props":212,"children":213},{},[214],{"type":36,"value":215},"Software engineer : phase de contribution au sein d'une petite équipe (la squad par exemple)",{"type":31,"tag":124,"props":217,"children":218},{},[219],{"type":36,"value":220},"Senior Software Engineer : un impact sur l’équipe et les guildes (communautés de pratique)",{"type":31,"tag":124,"props":222,"children":223},{},[224],{"type":36,"value":225},"Staff et Senior Staff : une influence majeure sur l’équipe produit avec un relais en dehors",{"type":31,"tag":124,"props":227,"children":228},{},[229],{"type":36,"value":230},"Principal : l'impact est désormais étendu à l'ensemble de l'entreprise",{"type":31,"tag":124,"props":232,"children":233},{},[234],{"type":36,"value":235},"Fellow/Distinguished : un impact externe avec une reconnaissance en dehors de l'entreprise (sur sa propre industrie par exemple)",{"type":31,"tag":32,"props":237,"children":238},{},[239],{"type":36,"value":240},"Les notions de Staff, Principal, Fellow et Distinguished ne vous sont pas familières ?",{"type":31,"tag":32,"props":242,"children":243},{},[244],{"type":36,"value":245},"C'est sans doute normal car ces appellations sont encore assez peu courantes en France. Pour autant, ces appellations sont de plus en plus répandues et standardisées dans la tech mondiale (source en fin de billet).",{"type":31,"tag":32,"props":247,"children":248},{},[249],{"type":36,"value":250},"Si vous avez un doute, je vous invite à rechercher sur linkedin et vous trouverez des exemples, y compris en France. On va les aborder un peu plus loin.",{"type":31,"tag":32,"props":252,"children":253},{},[254],{"type":36,"value":255},"Si on s'attarde sur la notion d'impact on peut noter schématiquement que l'évolution de carrière passe par une ouverture de plus en plus grande vers l'extérieur et une nécessité d'influence au sein de groupes de plus en plus larges. Le raccourci est simple entre cette ouverture vers l'extérieur, la gestion des rapports humains, la coordination et le management.",{"type":31,"tag":32,"props":257,"children":258},{},[259],{"type":36,"value":260},"Mais alors, est-ce qu'effectivement être développeur expérimenté passe par le management, y compris chez Malt ?",{"type":31,"tag":32,"props":262,"children":263},{},[264],{"type":36,"value":265},"Est-ce que c'est effectivement une fatalité de devenir de moins en moins hands-on (les mains dans le cambouis) ?",{"type":31,"tag":63,"props":267,"children":269},{"id":268},"les-contributeurs-individuels-pas-des-managers",[270],{"type":36,"value":271},"Les contributeurs individuels, pas des managers ?",{"type":31,"tag":32,"props":273,"children":274},{},[275],{"type":36,"value":276},"Tout d'abord j'aime bien rappeler la définition du management.",{"type":31,"tag":32,"props":278,"children":279},{},[280],{"type":36,"value":281},"Wikipedia nous dit :",{"type":31,"tag":32,"props":283,"children":284},{},[285],{"type":36,"value":286},"\"Le management se définit comme l'ensemble des techniques d'organisation et de gestion pour conduire, piloter l'action des individus.\"",{"type":31,"tag":32,"props":288,"children":289},{},[290],{"type":36,"value":291},"Bref, lorsque vous mettez en œuvre des actions pour vous coordonner (méthode agile par exemple), pour améliorer la qualité (pair programming, peer review etc...), vous utilisez \"des techniques d'organisation et de gestion\", donc du management.",{"type":31,"tag":32,"props":293,"children":294},{},[295],{"type":36,"value":296},"Selon moi, la caractéristique de la progression de junior vers senior et plus, c'est en premier l'acquisition des compétences de bases pour son métier, les fameuses hard skills (IDE, languages, concepts etc...) et c'est cela qui fait passer au statut de senior en 6 à 10 ans.",{"type":31,"tag":32,"props":298,"children":299},{},[300],{"type":36,"value":301},"(Je souris d'ailleurs toujours un peu quand je vois des leads tech avec 2 ans d'expérience...)",{"type":31,"tag":32,"props":303,"children":304},{},[305],{"type":36,"value":306},"On ne s'arrête jamais d'apprendre ces fameuses hard skills par la suite, loin s'en faut. La veille technologique reste fondamentale pour rester au niveau. Mais l'étape suivante avec les années passe par l'acquisition des techniques d'organisation et de gestion, donc du management. Penser qu’on peut se passer de savoir communiquer, négocier, convaincre et que l’expertise technique suffit, c’est très réducteur.",{"type":31,"tag":32,"props":308,"children":309},{},[310],{"type":36,"value":311},"La branche \"IC\"qui passe par Staff, Principal et Fellow n'est pas une branche de (people) management. Mais pour autant, à partir de Staff engineer on attend un impact large. Et pour cela, à partir de ces niveaux, il faut aussi développer des compétences en management : pilotage, organisation et coordination d'équipe, développement des autres (coaching, mentorat), animation, négociation, etc.",{"type":31,"tag":32,"props":313,"children":314},{},[315],{"type":36,"value":316},"On attend donc des personnes à ces niveaux d’être capable de",{"type":31,"tag":120,"props":318,"children":319},{},[320,325,330,335,340],{"type":31,"tag":124,"props":321,"children":322},{},[323],{"type":36,"value":324},"communiquer sur les buts à atteindre",{"type":31,"tag":124,"props":326,"children":327},{},[328],{"type":36,"value":329},"embarquer les autres autour de leurs idées",{"type":31,"tag":124,"props":331,"children":332},{},[333],{"type":36,"value":334},"créer de l’alignement et faciliter la prise de décision collective",{"type":31,"tag":124,"props":336,"children":337},{},[338],{"type":36,"value":339},"coordonner les efforts",{"type":31,"tag":124,"props":341,"children":342},{},[343],{"type":36,"value":344},"se sentir propriétaire de ces résultats",{"type":31,"tag":32,"props":346,"children":347},{},[348],{"type":36,"value":349},"Le métier à partir de Staff engineer évolue, et la part passée à ne plus développer en solo augmente. On attend d'un(e) Staff Engineer (et plus), une excellence technique, une vision technologique mais aussi une capacité à faire grandir des équipes entières. Si je caricature, je dirais qu'on développe, mais on développe aussi de plus en plus de l'humain et des groupes d'humains. Et c'est ça aussi être hands-on.",{"type":31,"tag":32,"props":351,"children":352},{},[353],{"type":31,"tag":75,"props":354,"children":357},{"href":355,"rel":356},"https://eventuallycoding.com/wp-content/uploads/2021/06/Coding_the_company.jpg",[79],[358],{"type":31,"tag":158,"props":359,"children":361},{"alt":7,"src":360},"/images/Coding_the_company-1024x401.jpg",[],{"type":31,"tag":32,"props":363,"children":364},{},[365],{"type":36,"value":366},"Si les parallèles sont nombreux entre par exemple le Senior Engineering Manager et le Staff Engineer, les différences sont nombreuses également :",{"type":31,"tag":120,"props":368,"children":369},{},[370,375],{"type":31,"tag":124,"props":371,"children":372},{},[373],{"type":36,"value":374},"L'Engineering manager (et les niveaux supérieurs) est attendu sur ses compétences en management, ses capacités d'organisation et d'influence. Il va travailler à fluidifier la communication entre groupes d'individus, gérer la croissance individuelle de chacun (people management), organiser le recrutement, mais aussi gérer les soucis de performance des individus et des équipes. Il va travailler sur la mise en place des bonnes pratiques (Agilité par exemple)",{"type":31,"tag":124,"props":376,"children":377},{},[378],{"type":36,"value":379},"Le Staff Engineer est attendu sur ses compétences et son influence technique. Il doit être capable de coordonner des initiatives technologiques sur plusieurs équipes. Il va contribuer également au développement des individus de l'équipe par une assistance régulière, du pair programming, des conférences internes.",{"type":31,"tag":32,"props":381,"children":382},{},[383],{"type":36,"value":384},"Donc oui, le Staff Engineer a des compétences en management avec l'objectif d'élaborer une vision technologique et de la mettre en œuvre.",{"type":31,"tag":32,"props":386,"children":387},{},[388],{"type":36,"value":389},"Et pour cela, il/elle peut coordonner de façon directe ou indirecte de larges groupes d'individus.",{"type":31,"tag":32,"props":391,"children":392},{},[393],{"type":36,"value":394},"Pour la petite anecdote, c'est mon parcours de CTO.",{"type":31,"tag":32,"props":396,"children":397},{},[398],{"type":36,"value":399},"Il y a de très bons CTO qui sont passés soit par la branche management, soit par la branche IC. Pour ma part, je suis passé par la branche IC et aujourd'hui encore je ne me considère pas comme un people manager.",{"type":31,"tag":32,"props":401,"children":402},{},[403],{"type":36,"value":404},"J'ai dû apprendre au fil des années à cultiver mes soft skills pour que mon expertise produise de l'impact.",{"type":31,"tag":63,"props":406,"children":408},{"id":407},"principal-engineer-distinguished-et-fellow-un-impact-grandissant",[409],{"type":36,"value":410},"Principal Engineer, Distinguished et Fellow un impact grandissant",{"type":31,"tag":32,"props":412,"children":413},{},[414],{"type":36,"value":415},"Parlons rapidement de ces positions. Ces titres ne sont pas très répandus en France (bien que très répandus par ailleurs) mais je pense qu’en lisant ces définitions vous allez reconnaître des personnes que vous connaissez ou avez connu.",{"type":31,"tag":32,"props":417,"children":418},{},[419],{"type":36,"value":420},"Le Principal Engineer est l'évolution du Staff Engineer. Si le Staff Engineer a un impact sur la technologie au sein de l'équipe produit, le Principal Engineer a une forte compréhension du business, et ses initiatives sont alignées sur les intérêts économiques de l'entreprise. Il sait traduire les besoins métiers en solutions technologiques et en KPI.",{"type":31,"tag":32,"props":422,"children":423},{},[424],{"type":36,"value":425},"Il va être le moteur du déploiement d'initiatives qui vont au-delà de l'équipe produit. Il va discuter très régulièrement avec les équipes finance, support, commerciales. Il ou elle a constamment une longueur d'avance sur les besoins de l'entreprise et sait les traduire en solutions qui vont améliorer l'efficacité de l'entreprise dans les années à venir.",{"type":31,"tag":32,"props":427,"children":428},{},[429],{"type":36,"value":430},"C'est également une personne qui va porter la communication et permettre le succès d'initiatives techs à grande échelle.",{"type":31,"tag":32,"props":432,"children":433},{},[434],{"type":36,"value":435},"Distinguished et Fellow en plus d'avoir un impact significatif pour leur entreprise via une expertise technologique ont en principe une aura externe.",{"type":31,"tag":32,"props":437,"children":438},{},[439],{"type":36,"value":440},"Je n'en ferai pas une description exacte puisqu'il s'agit de titres un peu honorifiques. Il n'existe pas de fiche de poste précise.",{"type":31,"tag":32,"props":442,"children":443},{},[444],{"type":36,"value":445},"On peut citer par exemple Kent Beck chez Gusto (créateur de XP, le canevas XUnit entre autres), James Gosling chez Amazon (créateur de Java), Gavin King chez IBM (créateur d'Hibernate, Ceylon et Seam entre autres).",{"type":31,"tag":32,"props":447,"children":448},{},[449],{"type":36,"value":450},"Inventer un nouveau langage n'est pas nécessaire mais devenir Fellow reste un accomplissement d'une belle carrière et d'un investissement personnel conséquent (dépôt de brevet ayant une large portée, leader sur des projets open source majeurs, etc.)",{"type":31,"tag":63,"props":452,"children":454},{"id":453},"software-engineer-votre-mission-si-vous-lacceptez",[455],{"type":36,"value":456},"Software Engineer, votre mission si vous l'acceptez...",{"type":31,"tag":32,"props":458,"children":459},{},[460],{"type":36,"value":461},"Maintenant qu'on a vu comment nous voyons les choses sur l'évolution de carrière chez Malt pour les personnes souhaitant se concentrer sur leurs contributions individuelles, je souhaitais aborder un thème qui me paraît complémentaire.",{"type":31,"tag":32,"props":463,"children":464},{},[465],{"type":36,"value":466},"J'aurais pu faire un second billet mais cela me semblait difficile de \"juste\" parler des paliers de séniorité sans parler du rôle de dev dans une équipe produit. Ce serait comme de parler uniquement de technique sans parler de \"à quoi ça sert\".",{"type":31,"tag":32,"props":468,"children":469},{},[470],{"type":36,"value":471},"Comme je le disais dans la partie précédente, les premières années pour un développeur permettent d'apprendre les fondamentaux de son métier, la technique, la veille, la collaboration, la méthode.",{"type":31,"tag":32,"props":473,"children":474},{},[475],{"type":36,"value":476},"Ensuite il faut se concentrer sur le fait d'avoir de l'impact et cela passe par sa contribution au produit.",{"type":31,"tag":32,"props":478,"children":479},{},[480],{"type":36,"value":481},"Attention je ne dis pas qu'on arrête d'apprendre sur les hard skills une fois atteint un pallier, loooiiinnn de là. C'est un travail constant de veille, même si je pense qu'on le fait aussi plus intelligemment.",{"type":31,"tag":32,"props":483,"children":484},{},[485],{"type":36,"value":486},"Mais revenons à nos moutons. Chez Malt un développeur peut contribuer sur deux activités clés : la discovery et le delivery.",{"type":31,"tag":63,"props":488,"children":490},{"id":489},"le-delivery",[491],{"type":36,"value":492},"Le Delivery",{"type":31,"tag":32,"props":494,"children":495},{},[496],{"type":36,"value":497},"Le delivery regroupe de façon très large de nombreuses activités : le développement en lui-même (coder, tester etc...), l'industrialisation, la mise en production, le monitoring etc...",{"type":31,"tag":32,"props":499,"children":500},{},[501],{"type":36,"value":502},"On parle également de Build et de Run.",{"type":31,"tag":32,"props":504,"children":505},{},[506],{"type":36,"value":507},"C'est un sujet qui me semble aujourd'hui très largement documenté. Il existe un large panel de méthodes, de pattern, d'organisation. Les plus aguerris apprennent à piocher dedans en fonction du contexte.",{"type":31,"tag":32,"props":509,"children":510},{},[511],{"type":36,"value":512},"Chez Malt l'équipe de dev est responsable du delivery au sens large.",{"type":31,"tag":32,"props":514,"children":515},{},[516],{"type":36,"value":517},"Vous noterez que ce n'est donc pas le PM qui est le responsable du delivery. Il est consulté, notamment sur les plannings, mais il/elle ne gère pas l'équipe de dev, ce qui lui permet de se concentrer sur la phase de Discovery.",{"type":31,"tag":32,"props":519,"children":520},{},[521],{"type":36,"value":522},"Si toute l'équipe de dev contribue, le/la Lead Engineer est le relais de communication avec le product manager.",{"type":31,"tag":32,"props":524,"children":525},{},[526],{"type":36,"value":527},"C'est à lui/elle de mener les discussions dans l'équipe de dev pour déterminer comment on va industrialiser et comment on va créer un plan de bataille pour travailler de front, la dette, le build des solutions vues en discovery, le travail de fond, le support niveau 3 etc...",{"type":31,"tag":32,"props":529,"children":530},{},[531],{"type":36,"value":532},"L'équipe de dev, représentée par son/sa Lead Engineer, doit travailler sur les questions clés du delivery : fiabilité, sécurité, scalabilité et performance.",{"type":31,"tag":32,"props":534,"children":535},{},[536],{"type":36,"value":537},"Son rôle est donc clé dans l'articulation entre discovery et delivery.",{"type":31,"tag":32,"props":539,"children":540},{},[541],{"type":31,"tag":75,"props":542,"children":545},{"href":543,"rel":544},"https://eventuallycoding.com/wp-content/uploads/2021/06/discovery-delivery-1.png",[79],[546],{"type":31,"tag":158,"props":547,"children":549},{"alt":7,"src":548},"/images/discovery-delivery-1.png",[],{"type":31,"tag":32,"props":551,"children":552},{},[553],{"type":36,"value":554},"L'engineering manager de son côté travaille pour aider le/la Lead engineer, fluidifier la communication avec d'autres équipes, organiser les cérémonies nécessaires (rétro par exemple), aider à la mise en place de métriques d'équipe, se coordonner avec le VP Engineering pour le staffing des squads de sa tribe.",{"type":31,"tag":32,"props":556,"children":557},{},[558],{"type":36,"value":559},"Dans certaines entreprises le/la Lead Engineer et l'Engineering Manager sont incarnés par une seule personne. Chez Malt nous avons choisi de séparer le rôle de management pur (incluant people management, recrutement, 1:1 etc...) du Lead Engineer.",{"type":31,"tag":63,"props":561,"children":563},{"id":562},"la-discovery",[564],{"type":36,"value":565},"La Discovery",{"type":31,"tag":32,"props":567,"children":568},{},[569],{"type":36,"value":570},"Si la phase de Delivery n'est pas une grande découverte pour la plupart, je remarque que la phase de Discovery n’implique pas toujours les équipes de dev qui sont parfois vues uniquement comme des exécutants en bout de chaîne, ce qui est sans doute l’une des plus grosses erreurs qu’une société puisse faire.",{"type":31,"tag":32,"props":572,"children":573},{},[574],{"type":36,"value":575},"J'ai malheureusement observé de nombreuses situations où l'équipe de dev découvre des solutions à implémenter lors de sprint plannings ou dans des kicks offs organisés en grande pompe.",{"type":31,"tag":32,"props":577,"children":578},{},[579],{"type":36,"value":580},"C'est tellement dommage d'embaucher des Software engineers pour ne pas les impliquer dans la Discovery. Leur plus grande valeur n'est pas de \"juste\" coder, mais de concevoir des solutions technologiques pour répondre à des problèmes, d'où le “Engineer” dans Software Engineer.",{"type":31,"tag":32,"props":582,"children":583},{},[584],{"type":36,"value":585},"Chez Malt les développeurs chevronnés (représentés par son/sa Lead Engineer) doivent s'impliquer dans la Discovery.",{"type":31,"tag":32,"props":587,"children":588},{},[589],{"type":36,"value":590},"Pour rappeler brièvement en quoi consiste la Discovery, il s'agit d'un ensemble d'activités, piloté par le Product Manager, visant à :",{"type":31,"tag":120,"props":592,"children":593},{},[594,599],{"type":31,"tag":124,"props":595,"children":596},{},[597],{"type":36,"value":598},"déterminer l'ensemble des problèmes à résoudre, l'objectif étant \"Design the right thing\"",{"type":31,"tag":124,"props":600,"children":601},{},[602],{"type":36,"value":603},"déterminer l'ensemble des solutions afin de \"Design things right\"",{"type":31,"tag":32,"props":605,"children":606},{},[607],{"type":31,"tag":75,"props":608,"children":611},{"href":609,"rel":610},"https://eventuallycoding.com/wp-content/uploads/2021/06/Double_diamond.jpg",[79],[612],{"type":31,"tag":158,"props":613,"children":615},{"alt":7,"src":614},"/images/Double_diamond-1024x604.jpg",[],{"type":31,"tag":32,"props":617,"children":618},{},[619],{"type":36,"value":620},"L'équipe de dev va être mise à contribution pour sa connaissance du produit existant, mais aussi la compréhension des besoins clients.",{"type":31,"tag":32,"props":622,"children":623},{},[624],{"type":36,"value":625},"Elle doit être capable de mettre en place des solutions simples et rapides pour mettre en place des AB Tests, extraire de la donnée, faire des prototypes, construire des maquettes (basse ou haute fidélité).",{"type":31,"tag":32,"props":627,"children":628},{},[629],{"type":36,"value":630},"C'est une étape qui nécessite pragmatisme et ingéniosité pour tester rapidement des hypothèses. On ne cherche pas à construire dans cette étape un produit industrialisé et scalable.",{"type":31,"tag":32,"props":632,"children":633},{},[634],{"type":36,"value":635},"Une équipe mature devrait avoir de multiples expérimentations en cours chaque semaine, et l'équipe de dev peut aider à cela.",{"type":31,"tag":32,"props":637,"children":638},{},[639],{"type":36,"value":640},"Je précise évidemment que le/la PM et le/la Product Designer peuvent aussi se passer de développement une grande partie du temps (interviews, nocode, maquette interactive avec Figma etc...).",{"type":31,"tag":32,"props":642,"children":643},{},[644],{"type":36,"value":645},"A cette étape l'équipe de dev est responsable de la question de la faisabilité et doit permettre rapidement de trouver les solutions les plus intelligentes ET faisables tout en discutant avec le/la PM qui est responsable de la valeur et la viabilité, et avec le/la Product Designer qui est responsable de l'utilisabilité.",{"type":31,"tag":32,"props":647,"children":648},{},[649],{"type":36,"value":650},"Voici qui conclut ce billet qui avait pour objectif de présenter comment nous envisageons chez Malt la progression individuelle des contributeurs individuels après le fameux niveau de Senior.",{"type":31,"tag":32,"props":652,"children":653},{},[654],{"type":36,"value":655},"L'appellation Senior est trompeuse, le chemin est encore long, et c’est heureux vu le temps de carrière qui reste ensuite. L’un des principaux indices de progression est axé autour de l’impact que l’on peut apporter.",{"type":31,"tag":32,"props":657,"children":658},{},[659],{"type":36,"value":660},"Et cet impact chez Malt se traduit notamment dans son apport à deux phases importantes du produit, le Delivery (classique sans doute), mais aussi la Discovery.",{"type":31,"tag":63,"props":662,"children":664},{"id":663},"ressources",[665],{"type":36,"value":666},"Ressources",{"type":31,"tag":120,"props":668,"children":669},{},[670,681,692,703,714],{"type":31,"tag":124,"props":671,"children":672},{},[673,675],{"type":36,"value":674},"un framework de career ladder : ",{"type":31,"tag":75,"props":676,"children":679},{"href":677,"rel":678},"https://career-ladders.dev/",[79],[680],{"type":36,"value":677},{"type":31,"tag":124,"props":682,"children":683},{},[684,686],{"type":36,"value":685},"une collection de framework de career path public : ",{"type":31,"tag":75,"props":687,"children":690},{"href":688,"rel":689},"https://www.progression.fyi/",[79],[691],{"type":36,"value":688},{"type":31,"tag":124,"props":693,"children":694},{},[695,697],{"type":36,"value":696},"Career path de Gitlab : ",{"type":31,"tag":75,"props":698,"children":701},{"href":699,"rel":700},"https://about.gitlab.com/handbook/engineering/career-development/",[79],[702],{"type":36,"value":699},{"type":31,"tag":124,"props":704,"children":705},{},[706,708],{"type":36,"value":707},"Career path Square : ",{"type":31,"tag":75,"props":709,"children":712},{"href":710,"rel":711},"https://developer.squareup.com/blog/squares-growth-framework-for-engineers-and-engineering-managers/",[79],[713],{"type":36,"value":710},{"type":31,"tag":124,"props":715,"children":716},{},[717],{"type":36,"value":718},"Placeholder : le futur billet de Benoît, notre VP engineering sur une explication détaillée du career path chez Malt (petite pression pour qu’il finisse son billet :))",{"title":7,"searchDepth":720,"depth":720,"links":721},2,[722,723,724,725,726,727,728,729],{"id":65,"depth":720,"text":68},{"id":174,"depth":720,"text":177},{"id":268,"depth":720,"text":271},{"id":407,"depth":720,"text":410},{"id":453,"depth":720,"text":456},{"id":489,"depth":720,"text":492},{"id":562,"depth":720,"text":565},{"id":663,"depth":720,"text":666},"markdown","content:articles:2021:06:24:senior-avec-6-ans-dexperience-et-apres.md","content","articles/2021/06/24/senior-avec-6-ans-dexperience-et-apres.md","md",1699798332681]