[{"data":1,"prerenderedAt":642},["Reactive",2],{"/articles/2021/09/01/differences-entre-vp-engineering-et-cto":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"id":10,"date":11,"categories":12,"tags":14,"img":18,"cover":19,"readingTime":20,"body":25,"_type":637,"_id":638,"_source":639,"_file":640,"_extension":641},"/articles/2021/09/01/differences-entre-vp-engineering-et-cto","01",false,"","Différences entre VP Engineering et CTO","Si le rôle de VP Engineering est relativement courant dans les entreprises anglo-saxonnes, cette dénomination est assez jeune en France et peut-être q...","1807","2021-09-01",[13],"waza",[15,16,17],"cto","startup","vp","Illustration_sans_titre-20-1024x393.jpg","cover4.jpg",{"text":21,"minutes":22,"time":23,"words":24},"12 min read",11.08,664800,2216,{"type":26,"children":27,"toc":634},"root",[28,36,41,46,51,71,76,91,100,105,110,115,120,125,130,135,140,152,159,171,185,190,195,200,205,210,215,220,225,230,235,240,259,271,276,290,295,300,305,327,333,338,343,348,353,358,363,368,373,378,383,388,393,398,404,409,414,419,424,429,434,440,445,450,455,460,472,477,483,488,493,498,503,508,513,519,524,529,534,539,544,563,568,579,590,601,612,623],{"type":29,"tag":30,"props":31,"children":32},"element","p",{},[33],{"type":34,"value":35},"text","Si le rôle de VP Engineering est relativement courant dans les entreprises anglo-saxonnes, cette dénomination est assez jeune en France et peut-être que vous n'en avez pas encore côtoyé. ",{"type":29,"tag":30,"props":37,"children":38},{},[39],{"type":34,"value":40},"Je souhaitais faire un billet sur ce rôle parfois méconnu, incompris, ou juste confondu avec le poste de CTO. ",{"type":29,"tag":30,"props":42,"children":43},{},[44],{"type":34,"value":45},"Et pour cela, je souhaitais décrire la façon dont ce rôle a été introduit dans l'équipe engineering de Malt. ",{"type":29,"tag":30,"props":47,"children":48},{},[49],{"type":34,"value":50},"En faisant cela, cela permettra de répondre à quelques questions que je me suis moi-même posé lorsque nous avons cherché notre VP Engineering :",{"type":29,"tag":52,"props":53,"children":54},"ul",{},[55,61,66],{"type":29,"tag":56,"props":57,"children":58},"li",{},[59],{"type":34,"value":60},"A partir de quelle taille d'équipe faudrait-il avoir un VP Eng ? ",{"type":29,"tag":56,"props":62,"children":63},{},[64],{"type":34,"value":65},"Quel est le profil type d'un VP Eng ?",{"type":29,"tag":56,"props":67,"children":68},{},[69],{"type":34,"value":70},"Dans quelle mesure son rôle et le mien se recoupe et comment cohabiter ?",{"type":29,"tag":30,"props":72,"children":73},{},[74],{"type":34,"value":75},"En espérant que mon expérience dans une startup de 0 à 250 employés puisse servir à d'autres.",{"type":29,"tag":30,"props":77,"children":78},{},[79],{"type":29,"tag":80,"props":81,"children":85},"a",{"href":82,"rel":83},"https://eventuallycoding.com/wp-content/uploads/2021/09/Illustration_sans_titre-20.jpg",[84],"nofollow",[86],{"type":29,"tag":87,"props":88,"children":90},"img",{"alt":7,"src":89},"/images/Illustration_sans_titre-20-1024x393.jpg",[],{"type":29,"tag":30,"props":92,"children":93},{},[94],{"type":29,"tag":95,"props":96,"children":97},"strong",{},[98],{"type":34,"value":99},"Avertissement",{"type":29,"tag":30,"props":101,"children":102},{},[103],{"type":34,"value":104},"Dans ce billet comme dans les précédents, je vais utiliser les termes US pour les métiers : VP, CTO etc... ",{"type":29,"tag":30,"props":106,"children":107},{},[108],{"type":34,"value":109},"Et honnêtement je ne me vois pas faire autrement. ",{"type":29,"tag":30,"props":111,"children":112},{},[113],{"type":34,"value":114},"La structuration des startups/scaleup est largement calquée sur les modèles américains. Et s'il est vrai que certains rôles peuvent être traduits en Français, c'est aussi vrai que l'esprit du poste en question est très lié à un modèle d'organisation \"à l'américaine\" et que les traductions ne rendent pas toujours l'esprit de ces postes.",{"type":29,"tag":30,"props":116,"children":117},{},[118],{"type":34,"value":119},"Est-ce que le directeur technique a véritablement le même rôle qu'un CTO ? Quand je vois les définitions de directeur technique sur internet, je peux vous dire que non ^^",{"type":29,"tag":30,"props":121,"children":122},{},[123],{"type":34,"value":124},"Et les traductions n'existent pas toujours. Qu'est-ce qu'un Principal Engineer, Staff Engineer, Engineering Manager ou même VP Engineering en Français ? ",{"type":29,"tag":30,"props":126,"children":127},{},[128],{"type":34,"value":129},"De fait, les titres reflètent bien souvent la culture managériale d’un pays et sur ce point, la France et les US sont assez éloignés. ",{"type":29,"tag":30,"props":131,"children":132},{},[133],{"type":34,"value":134},"Et c'est d'ailleurs ces différences culturelles qui expliquent en partie pourquoi le rôle de VP Engineering n'est pas forcément présent dans votre entreprise. ",{"type":29,"tag":30,"props":136,"children":137},{},[138],{"type":34,"value":139},"Second disclaimer, ça y est je commence les anglicismes, ce billet est écrit sous l’angle d’un CTO fondateur. Et ça a son importance. ",{"type":29,"tag":30,"props":141,"children":142},{},[143,145,150],{"type":34,"value":144},"En tant que fondateur, le rôle évolue dans le temps avec le “confort” (",{"type":29,"tag":95,"props":146,"children":147},{},[148],{"type":34,"value":149},"1",{"type":34,"value":151},") de pouvoir choisir son rôle dans l’organisation qui change, ce qui est assez différent d’une personne qui rejoindrait une entreprise avec un rôle de VP ou CTO et une mission claire dont il ne peut pas dévier. ",{"type":29,"tag":153,"props":154,"children":156},"h1",{"id":155},"a-partir-de-quelle-taille-déquipe-faudrait-il-un-vp-engineering",[157],{"type":34,"value":158},"A partir de quelle taille d'équipe faudrait-il un VP Engineering ?",{"type":29,"tag":30,"props":160,"children":161},{},[162],{"type":29,"tag":80,"props":163,"children":166},{"href":164,"rel":165},"https://eventuallycoding.com/wp-content/uploads/2021/09/Illustration_sans_titre-19.jpg",[84],[167],{"type":29,"tag":87,"props":168,"children":170},{"alt":7,"src":169},"/images/Illustration_sans_titre-19-1024x706.jpg",[],{"type":29,"tag":30,"props":172,"children":173},{},[174,176,183],{"type":34,"value":175},"Récemment j'ai écrit un billet sur ",{"type":29,"tag":80,"props":177,"children":180},{"href":178,"rel":179},"https://eventuallycoding.com/2021/05/03/cto-de-startup-a-scaleup/",[84],[181],{"type":34,"value":182},"l'évolution du rôle de CTO de startup à scaleup",{"type":34,"value":184},". Je racontais notamment que ce rôle de CTO dans les premières étapes comprend le fait d'être le premier développeur, le garant de la vision technologique et celui qui va créer l'équipe produit pour son passage à l'échelle.",{"type":29,"tag":30,"props":186,"children":187},{},[188],{"type":34,"value":189},"Par la suite, on apprend à se virer soi-même pour trouver les personnes qui vont nous remplacer sur telle ou telle partie du job. ",{"type":29,"tag":30,"props":191,"children":192},{},[193],{"type":34,"value":194},"Le rôle est à cheval entre un rôle de contributeur individuel, de leadership et de management. ",{"type":29,"tag":30,"props":196,"children":197},{},[198],{"type":34,"value":199},"Et puis à un moment dans la croissance de la société, le CTO doit faire un choix. Il devient de plus en plus dur d'être développeur, recruteur, organisateur, responsable de la stratégie, coach etc... ",{"type":29,"tag":30,"props":201,"children":202},{},[203],{"type":34,"value":204},"Et quand j'écris cela, c'est pour des raisons évidentes de temps disponible dans une journée. Je m'explique.",{"type":29,"tag":30,"props":206,"children":207},{},[208],{"type":34,"value":209},"Si on reprend les grands axes du rôle de CTO en startup, on retrouve :",{"type":29,"tag":30,"props":211,"children":212},{},[213],{"type":34,"value":214},"- la vision technologique (définition de l'architecture, scalabilité, faisabilité)",{"type":29,"tag":30,"props":216,"children":217},{},[218],{"type":34,"value":219},"- la gestion humaine (coaching, recrutement, fidélisation, gestion de la performance)",{"type":29,"tag":30,"props":221,"children":222},{},[223],{"type":34,"value":224},"- la gestion de l'exécution et du delivery (organisation et staffing des équipes, process de communication, méthodes agiles, mesures de la qualité)",{"type":29,"tag":30,"props":226,"children":227},{},[228],{"type":34,"value":229},"- la vision produit (adéquation entre tech et métier, définition produit, stratégie, discussion avec les autres C-Level, discussions avec les clients)",{"type":29,"tag":30,"props":231,"children":232},{},[233],{"type":34,"value":234},"A cela, pour un CTO fondateur, il faut ajouter toute la diversité des tâches liés à la création et la croissance de la société.",{"type":29,"tag":30,"props":236,"children":237},{},[238],{"type":34,"value":239},"Même si on part de l'hypothèse que la personne soit compétente et motivée par tous ces aspects du métier, il y a une limite matérialisée par le nombre d'heures disponibles dans une journée.",{"type":29,"tag":30,"props":241,"children":242},{},[243,245,250,252,257],{"type":34,"value":244},"Or, quand la boite grandit, ",{"type":29,"tag":95,"props":246,"children":247},{},[248],{"type":34,"value":249},"chacun de ces rôles prend plus de temps",{"type":34,"value":251}," (",{"type":29,"tag":95,"props":253,"children":254},{},[255],{"type":34,"value":256},"2",{"type":34,"value":258},") donc il faut faire des choix, ou bien tout faire moins bien, ce qui est un choix aussi ^^",{"type":29,"tag":30,"props":260,"children":261},{},[262],{"type":29,"tag":80,"props":263,"children":266},{"href":264,"rel":265},"https://eventuallycoding.com/wp-content/uploads/2021/09/Illustration_sans_titre-18.jpg",[84],[267],{"type":29,"tag":87,"props":268,"children":270},{"alt":7,"src":269},"/images/Illustration_sans_titre-18-1024x533.jpg",[],{"type":29,"tag":30,"props":272,"children":273},{},[274],{"type":34,"value":275},"Et donc, à partir de quand cela devient nécessaire ? ",{"type":29,"tag":30,"props":277,"children":278},{},[279,281,288],{"type":34,"value":280},"On parle souvent du palier de 7/8 personnes qui correspond à la taille idéale d'une équipe, la fameuse ",{"type":29,"tag":80,"props":282,"children":285},{"href":283,"rel":284},"http://blog.idonethis.com/two-pizza-team/",[84],[286],{"type":34,"value":287},"pizza team de Amazon",{"type":34,"value":289},". ",{"type":29,"tag":30,"props":291,"children":292},{},[293],{"type":34,"value":294},"Effectivement à ce palier en théorie on peut déjà rechercher un Engineering manager pour prendre en charge une partie de la responsabilité du delivery (organisation, process, qualité, people management). ",{"type":29,"tag":30,"props":296,"children":297},{},[298],{"type":34,"value":299},"Mon point de vue c'est, qu'en startup, chaque recrutement compte d'un point de vue financier et ça reste un peu overkill dans une équipe de 8 de commencer à introduire des rôles \"organisationnel\". ",{"type":29,"tag":30,"props":301,"children":302},{},[303],{"type":34,"value":304},"Donc ma stratégie a été un peu différente, je n'ai recruté volontairement que des seniors qui, en théorie selon moi, ne nécessitent pas de management. ",{"type":29,"tag":30,"props":306,"children":307},{},[308,310,325],{"type":34,"value":309},"Bref, pour une startup avec un CTO fondateur, ",{"type":29,"tag":95,"props":311,"children":312},{},[313,315,323],{"type":34,"value":314},"qui a des appétences de VP (",{"type":29,"tag":95,"props":316,"children":317},{},[318],{"type":29,"tag":95,"props":319,"children":320},{},[321],{"type":34,"value":322},"3",{"type":34,"value":324},")",{"type":34,"value":326},", je situerais ce palier plutôt aux alentours de 15/20 personnes.",{"type":29,"tag":153,"props":328,"children":330},{"id":329},"en-pratique-comment-avons-nous-recruté-notre-vp-chez-malt",[331],{"type":34,"value":332},"En pratique, comment avons- nous recruté notre VP chez Malt ?",{"type":29,"tag":30,"props":334,"children":335},{},[336],{"type":34,"value":337},"Fin 2018 nous étions environ 30 dans l'équipe produit, j'avais un peu tardé... Il n'existait aucun engineering manager (et donc aucun VP non plus). ",{"type":29,"tag":30,"props":339,"children":340},{},[341],{"type":34,"value":342},"Sauf que l'année 2018 m'avait montré les limites du modèle. Ma capacité à développer avait diminué de 50% par rapport à 2015 car les recrutements de l'année m'avaient pris un temps important. En parallèle, j'ai pu passer de moins en moins de temps avec les membres de l'équipe qui étaient pourtant de plus en plus nombreux.",{"type":29,"tag":30,"props":344,"children":345},{},[346],{"type":34,"value":347},"Ce que je savais, c'est que je souhaitais me décharger de la gestion humaine et la gestion du delivery, même si j'aimais bien ces sujets. ",{"type":29,"tag":30,"props":349,"children":350},{},[351],{"type":34,"value":352},"J'ai mis du temps à définir ce que j'attendais et comment ça fonctionnerait. Et forcément, si \"tout ce qui se conçoit bien s'énonce clairement\", l'inverse est vrai. Ayant du mal à le définir, j'ai sans doute eu du mal à l'expliquer, par exemple à Vincent, cofondateur, qui, comme moi quelques mois plus tôt, trouvait anticipé d'avoir un rôle organisationnel dans une petite structure. ",{"type":29,"tag":30,"props":354,"children":355},{},[356],{"type":34,"value":357},"Sauf que là, c'était déjà trop tard. ",{"type":29,"tag":30,"props":359,"children":360},{},[361],{"type":34,"value":362},"Premier trimestre 2019 j'ai mis sur papier une fiche de poste, un descriptif permettant de bien séparer le rôle du CTO de celui du VP. Cette étape a été importante puisqu'elle m'a permis de formaliser pour moi mais aussi pour les candidats que j'allais rencontrer. Eux aussi ont besoin que ce soit clair. ",{"type":29,"tag":30,"props":364,"children":365},{},[366],{"type":34,"value":367},"Selon Lever, notre ATS, 40 personnes sont entrées dans le processus pour ce poste. 6 ont été jusqu'à rencontrer l'équipe. ",{"type":29,"tag":30,"props":369,"children":370},{},[371],{"type":34,"value":372},"Le processus a démarré en février/mars 2020 et s'est conclu en septembre pour une prise de poste en décembre.",{"type":29,"tag":30,"props":374,"children":375},{},[376],{"type":34,"value":377},"Pour moi, l'exercice a été très difficile. Je sais très bien recruter des Software Engineer, j'ai un process rodé et sur chaque étape je sais détecter les mauvais et les bons signes.",{"type":29,"tag":30,"props":379,"children":380},{},[381],{"type":34,"value":382},"Mais un engineering manager ou un VP, je n'avais pas l'habitude. J'avais des critères un peu généraux : le fait d'avoir déjà vécu une phase de scale par exemple. Mais là il s'agissait de trouver la personne avec qui la relation devait être parfaite. ",{"type":29,"tag":30,"props":384,"children":385},{},[386],{"type":34,"value":387},"J'ai rencontré plein de gens très bien, mais c'est difficile de savoir si j'aurais pu travailler avec eux, si on allait partager la même vision. C'est un peu comme choisir un colocataire. Et puis dans cette histoire j’allais déléguer des parties sur lesquelles j’étais plutôt content de mes résultats et je voulais que le travail soit dans le même esprit.",{"type":29,"tag":30,"props":389,"children":390},{},[391],{"type":34,"value":392},"En conséquence, c’était compliqué de savoir si je prenais ou pas une bonne décision sur chaque personne que j’ai pu rencontrer et j’ai sans doute été très conservateur sur certains cas...",{"type":29,"tag":30,"props":394,"children":395},{},[396],{"type":34,"value":397},"En fin de compte, la recherche s'est conclue avec Benoit Guillon, ex Director Engineering chez Talend. Mais j’ai un peu triché puisque nous avions déjà travaillé ensemble 10 ans auparavant. Et la confiance que j’avais en cette personne a été un critère clé pour le choix final. ",{"type":29,"tag":153,"props":399,"children":401},{"id":400},"le-profil-type-dun-vp-engineering",[402],{"type":34,"value":403},"Le profil type d’un VP Engineering",{"type":29,"tag":30,"props":405,"children":406},{},[407],{"type":34,"value":408},"Ce titre de paragraphe est un peu fallacieux, il n’existe pas de profil type, ou tout du moins, nous n’aurons pas tous la même définition de ce profil type.",{"type":29,"tag":30,"props":410,"children":411},{},[412],{"type":34,"value":413},"De mon point de vue, un VP engineering est passé par le développement. Il existe des exemples de VP à succès qui n’ont pas été dev, mais c’est une exception. ",{"type":29,"tag":30,"props":415,"children":416},{},[417],{"type":34,"value":418},"C’est une personne qui doit être capable de comprendre les subtilités des problématiques du développement et l’arbitrage constant que l’on fait entre court et long terme. Attention, cependant, un(e) VP n’a pas nécessairement été un(e) excellent dev et on n’attends pas de cette personne qu’elle dirige la vision technologique. ",{"type":29,"tag":30,"props":420,"children":421},{},[422],{"type":34,"value":423},"En terme de parcours au sein d’une équipe d’ingénierie, on peut trouver des personnes qui sont passés par Chief Architect, Engineering Manager, Principal Engineer, donc avec une notion de leadership dans le rôle. ",{"type":29,"tag":30,"props":425,"children":426},{},[427],{"type":34,"value":428},"Comme la gestion des rapports humains ne coule pas de source simplement parce que l’on était un(e) bon développeur, la personne doit avancer par palier, donc en théorie dans la plupart des cas, on essaie de viser une personne ayant déjà eu une expérience sur une taille d’équipe similaire ou légèrement inférieure.",{"type":29,"tag":30,"props":430,"children":431},{},[432],{"type":34,"value":433},"Dans notre cas, le critère était d’avoir géré une équipe dans une phase de scale sur l’étape juste après nous, donc environ 100 personnes. On cherchait à apprendre de la personne en question pour gagner en rapidité d'exécution.",{"type":29,"tag":153,"props":435,"children":437},{"id":436},"le-recrutement-dun-vp-est-il-inévitable",[438],{"type":34,"value":439},"Le recrutement d’un VP est-il inévitable ?",{"type":29,"tag":30,"props":441,"children":442},{},[443],{"type":34,"value":444},"Je disais plus haut qu’à partir d’un certain palier, le CTO doit faire un choix sur ce qu’il veut faire (et peut faire). Il est tout à fait possible que le CTO fondateur choisisse de se concentrer sur la fonction de VP (people et delivery). ",{"type":29,"tag":30,"props":446,"children":447},{},[448],{"type":34,"value":449},"Le recrutement d’un VP et le fait d’abandonner ces activités n’est pas une fatalité. ",{"type":29,"tag":30,"props":451,"children":452},{},[453],{"type":34,"value":454},"Il est tout à fait possible au contraire de délaisser la partie vision technologique et de ne plus mettre les mains dans le cambouis assez tôt. Dans ce cas, le CTO va plutôt rechercher un Principal Engineer ou un Chief Architect. ",{"type":29,"tag":30,"props":456,"children":457},{},[458],{"type":34,"value":459},"Mais je triche un peu dans ma réponse, si vous avez suivi, effectivement le CTO fondateur a le choix de ne pas recruter de VP, mais dans ce cas il va prendre ce rôle (avec ou sans changement de titre, ce n’est pas le point important).",{"type":29,"tag":30,"props":461,"children":462},{},[463],{"type":29,"tag":80,"props":464,"children":467},{"href":465,"rel":466},"https://eventuallycoding.com/wp-content/uploads/2021/09/Illustration_sans_titre-17.jpg",[84],[468],{"type":29,"tag":87,"props":469,"children":471},{"alt":7,"src":470},"/images/Illustration_sans_titre-17-1024x1024.jpg",[],{"type":29,"tag":30,"props":473,"children":474},{},[475],{"type":34,"value":476},"Avec la croissance, le rôle se divise mais ne devient pas plus petit",{"type":29,"tag":153,"props":478,"children":480},{"id":479},"rôle-du-cto-vs-rôle-du-vp-engineering",[481],{"type":34,"value":482},"Rôle du CTO vs rôle du VP engineering ",{"type":29,"tag":30,"props":484,"children":485},{},[486],{"type":34,"value":487},"Concrètement, le rôle du VP engineering c’est quoi ? ",{"type":29,"tag":30,"props":489,"children":490},{},[491],{"type":34,"value":492},"VP comme CTO ce sont des rôles avec pas mal de variations suivant les boîtes car l’articulation des deux rôles peut justement amener à déporter plus ou moins de sujets sur l’un ou l’autre.",{"type":29,"tag":30,"props":494,"children":495},{},[496],{"type":34,"value":497},"Dans certains cas, le VP peut prendre en charge toute la stratégie tech, le delivery et le people management et le rôle de CTO peut totalement s’effacer.",{"type":29,"tag":30,"props":499,"children":500},{},[501],{"type":34,"value":502},"Vraiment j’insiste, ce rôle peut avoir des responsabilités et un rattachement hiérarchique assez différents selon les sociétés. ",{"type":29,"tag":30,"props":504,"children":505},{},[506],{"type":34,"value":507},"Alors pour ne pas réécrire ce que bien d’autres ont déjà bien écrit avant moi, je vous propose une sélection de sources en fin de billet qui complètent mon propos.",{"type":29,"tag":30,"props":509,"children":510},{},[511],{"type":34,"value":512},"Chez Malt, le VP a le people management (perf reviews, animation et vie d’équipe, organisation, recrutement) et le delivery sous sa responsabilité. La stratégie tech est encore partagée entre CTO et VP. En tant que CPTO je suis plus tourné vers l’extérieur et la stratégie long terme. ",{"type":29,"tag":153,"props":514,"children":516},{"id":515},"les-changements-depuis-larrivée-du-vp",[517],{"type":34,"value":518},"Les changements depuis l’arrivée du VP",{"type":29,"tag":30,"props":520,"children":521},{},[522],{"type":34,"value":523},"Cela fera office de conclusion pour ce billet. ",{"type":29,"tag":30,"props":525,"children":526},{},[527],{"type":34,"value":528},"Sur 2021 le rôle de VP est entièrement tourné vers la croissance de la société avec une structuration des recrutements qui augmentent, un travail fort sur l’accueil et l’accompagnement des nouveaux arrivants et la qualité du delivery dont la vitesse ne doit pas pâtir de la croissance.",{"type":29,"tag":30,"props":530,"children":531},{},[532],{"type":34,"value":533},"L’arrivée d’un VP m’a permis de prendre de la hauteur sur mon propre rôle. Ceci fait directement écho au billet “CTO de startup à scaleup” que j’évoquais plus haut. ",{"type":29,"tag":30,"props":535,"children":536},{},[537],{"type":34,"value":538},"J’ai pu me recentrer sur un rôle plus orienté stratégie tech, stratégie produit et plus tourné vers les autres équipes. Cette transition est encore en cours et la société continue de pas mal évoluer en ce moment. ",{"type":29,"tag":30,"props":540,"children":541},{},[542],{"type":34,"value":543},"Wait and see",{"type":29,"tag":545,"props":546,"children":547},"ol",{},[548,553,558],{"type":29,"tag":56,"props":549,"children":550},{},[551],{"type":34,"value":552},"Confort c’est vite dit. C’est parfois assez déstabilisant d’être forcé de grandir à la même vitesse que la société, de ne jamais pouvoir se créer une zone de confort qui dure plus de 6 mois, de se virer soi-même sans arrêt. Mais au moins on a le choix.",{"type":29,"tag":56,"props":554,"children":555},{},[556],{"type":34,"value":557},"C’est d’ailleurs vrai de tous les rôles et c’est pour cela qu’une équipe qui grandit a besoin de plus en plus de spécialiste d’une fonction",{"type":29,"tag":56,"props":559,"children":560},{},[561],{"type":34,"value":562},"Je souligne en gras car si le CTO n’a aucune appétence pour le people management et le recrutement, là au contraire il va falloir rapidement trouver quelqu’un pour ça. Mais de mon point de vue c’est un cas relativement rare et anormal que le CTO fondateur soit rebuté par ces aspects",{"type":29,"tag":30,"props":564,"children":565},{},[566],{"type":34,"value":567},"Autres sources :",{"type":29,"tag":30,"props":569,"children":570},{},[571,577],{"type":29,"tag":80,"props":572,"children":575},{"href":573,"rel":574},"https://www.linkedin.com/pulse/vpe-cto-brad-henrickson/",[84],[576],{"type":34,"value":573},{"type":34,"value":578},"  : on retrouve les variations de rôles pour CTO et VPE",{"type":29,"tag":30,"props":580,"children":581},{},[582,588],{"type":29,"tag":80,"props":583,"children":586},{"href":584,"rel":585},"https://www.beautifulcode.co/blog/94-vp-of-engineering-vs-cto-who-does-what",[84],[587],{"type":34,"value":584},{"type":34,"value":589}," avec une proposition de séparation des rôles par axe : vision, stratégie, supervision, responsabilité, planning etc…",{"type":29,"tag":30,"props":591,"children":592},{},[593,599],{"type":29,"tag":80,"props":594,"children":597},{"href":595,"rel":596},"https://superorbital.io/journal/cto-vs-vpe/",[84],[598],{"type":34,"value":595},{"type":34,"value":600}," un mini-billet qui insiste sur le fait qu’un CTO ne lead pas d’équipes, tandis qu’un bon VP peut leader des centaines de développeurs",{"type":29,"tag":30,"props":602,"children":603},{},[604,610],{"type":29,"tag":80,"props":605,"children":608},{"href":606,"rel":607},"https://jellyfish.co/blog/cto-vs-vp-engineering/",[84],[609],{"type":34,"value":606},{"type":34,"value":611}," cet article mentionne malgré tout la possibilité pour un CTO de garder une petite team de tech lead avec lui pour travailler sur de la R&D",{"type":29,"tag":30,"props":613,"children":614},{},[615,621],{"type":29,"tag":80,"props":616,"children":619},{"href":617,"rel":618},"https://www.ivyexec.com/career-advice/2015/cto-versus-vp-engineering-whats-the-difference/",[84],[620],{"type":34,"value":617},{"type":34,"value":622}," idem, le CTO est même vu au même rang hiérarchique avec report au CEO, comme le VP",{"type":29,"tag":30,"props":624,"children":625},{},[626,632],{"type":29,"tag":80,"props":627,"children":630},{"href":628,"rel":629},"https://review.firstround.com/give-away-your-legos-and-other-commandments-for-scaling-startups",[84],[631],{"type":34,"value":628},{"type":34,"value":633}," Moins lié directement mais relate l’importance de savoir changer de rôle avec la croissance d’une société",{"title":7,"searchDepth":635,"depth":635,"links":636},2,[],"markdown","content:articles:2021:09:01:differences-entre-vp-engineering-et-cto.md","content","articles/2021/09/01/differences-entre-vp-engineering-et-cto.md","md",1699821950696]